{"id":6361,"date":"2016-08-23T07:32:14","date_gmt":"2016-08-23T07:32:14","guid":{"rendered":"http:\/\/www.namasteindiatrip.com\/?page_id=6361"},"modified":"2022-09-09T04:47:40","modified_gmt":"2022-09-09T04:47:40","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions","title":{"rendered":"Term and Conditions – Namaste India Trip"},"content":{"rendered":"<style type=\"text\/css\"> \n#cmsmasters_row_673c2c9b66b698_34127429 .cmsmasters_row_outer_parent { \n\tpadding-top: 20px; \n} \n\n#cmsmasters_row_673c2c9b66b698_34127429 .cmsmasters_row_outer_parent { \n\tpadding-bottom: 25px; \n} \n\n#cmsmasters_row_673c2c9b66b698_34127429 .cmsmasters_row_inner.cmsmasters_row_fullwidth { \n\tpadding-left:2%; \n} \n#cmsmasters_row_673c2c9b66b698_34127429 .cmsmasters_row_inner.cmsmasters_row_fullwidth { \n\tpadding-right:2%; \n} \n<\/style><div id=\"cmsmasters_row_673c2c9b66b698_34127429\" class=\"cmsmasters_row cmsmasters_color_scheme_default cmsmasters_row_top_default cmsmasters_row_bot_default cmsmasters_row_fullwidth\">\n<div class=\"cmsmasters_row_outer_parent\">\n<div class=\"cmsmasters_row_outer\">\n<div class=\"cmsmasters_row_inner cmsmasters_row_fullwidth\">\n<div class=\"cmsmasters_row_margin\">\n<div class=\"cmsmasters_column one_first\">\n<div class=\"cmsmasters_text\">\n<p>Online Booking: You can purchase our services from our sales outlets, or you can register and book your tour\/services online through our website. Our website provides the facility of making online booking of tours and services. After confirmation in written from you an agreement made between you and us.<\/p>\n<h2><strong>Booking Amount:<\/strong><\/h2>\n<p>For the services contracted, a minimum deposit of 25% of the total cost is to be paid by you to <strong>Namaste India Trip Pvt. Ltd.<\/strong>. The deposit is required to hold the booking on confirmed basis.<\/p>\n<h2><strong>Balance Payment:<\/strong><\/h2>\n<p>The balance payment is to be paid 15 days prior to the date of start of services. Any booking made within 15 working days of the date of services would be considered as a late booking and for same the full and final payment is required to be made at the time of booking itself.<\/p>\n<p><strong>Note:<\/strong><\/p>\n<p>Apart from the above, in the case of bookings for special train journeys, hotel or resort bookings during the peak season (X-Mas, New Year, Pushkar Fair, Diwali, etc), full payment is required to be made at the time of booking itself.<\/p>\n<p>Even after making the 25% advance to confirm your bookings, in some cases it might be required that you need to pay an additional advance amount before the final balance payment date, depending on the hotel&#8217;s specific policy or contractor\/supplier&#8217;s payment deadline as and when applicable.<\/p>\n<p><strong>Special Note:<\/strong><\/p>\n<p>Please note that Namaste India Trip Pvt. Ltd  employee or agent will not ask for your Card Number, CVV, Net Banking login, Password, OTP etc. Nor will they ask you to transfer funds to a personal account or to install third-party apps like Any Desk, TeamViewer, etc.<\/p>\n<p>Please do not act on such a request. Report such incidents to <a href=\"mailto:info@narmadatourtravel.commm\info@narmadatourtravel.comomom<\/a><\/p>\n<p><strong>Payments:<\/strong> All payments are to be paid in behalf of <strong><strong>Namaste India Trip Pvt. Ltd.<\/strong>.<\/strong><\/p>\n<h2><strong>How to Pay:<\/strong><\/h2>\n<h3>Domestic payments<\/h3>\n<p>1. By Cash \/ Cheque \/ Demand Draft<br \/>\n2. By Electronic money transfer (RTGS &amp; NEFT)<br \/>\n3. By Mail Authorization (AMEX, Visa &amp; Master Card)<br \/>\n4. By Online Payment Gateway system through Amex, Visa &amp; Master Card<br \/>\n5. By Debit Card.<\/p>\n<h3>Outside of country payments<\/h3>\n<p>1. By Bank transfer to our bank (Bank Details)<br \/>\n2. By Mail Authorization (AMEX, Visa &amp; Master Card)<br \/>\n3. By Online Payment Gateway system through AMEX, Visa &amp; Master Card.<br \/>\n4. By Debit card.<\/p>\n<p>In case of payment through credit card, the bank charges (3% extra) &#8211; would be levied over and above the total amount.<\/p>\n<p><strong>Note:<\/strong><br \/>\n1. All payments should be free and clear of any withholding tax and deduction.<br \/>\n2. Bank charges, if any, for remittance (by remitting bank or by intermediary bank) would be strictly borne by payer.<\/p>\n<h3>Cancellation \/ No show \/ Early Departure Policy:<\/h3>\n<p>In case of cancellation of tour or travel services due to any reason, you are requested Please inform us in writing. Cancellation charges would be effective from the date we receive letter in writing and cancellation charges would be as follows:<br \/>\nCancellation charges for any mode of transport ticket are applicable as per the rules of the concerned authority.<br \/>\nAir ticket issued on special fare are non-refundable and the guest shall bear cancellation charges.<br \/>\n<strong class=\"bold\">Group Tours<\/strong><br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> If the reservation is canceled 30 days prior to the date of arrival &#8211; 90% may be refunded (except the transaction charges)<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> If the reservation is canceled 15 days prior to the date of arrival &#8211; 50% of the may be refunded (except the transaction charges)}<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> If the reservation is cancelled 07 days prior to the date of arrival &#8211; 25% of the may be refunded (except the transaction charges).<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> If the cancellation is any later than the above stated period or in case of &#8216;No Show&#8217;- No Refund.<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> No refund or any changes will be accepted at last minute for tour starting or after starting or middle of the tour.<br \/>\n<strong class=\"bold\">Individual Tours (FIT Tours)<\/strong><br \/>\nCancellation policy of Individual tours is subject to changes. It depends upon the cancellation policy of the respective hotels and other service operators your tour is associated with. Different hotels and service operators have different cancellation policies which we are required to abide by. In the unfortunate event of cancellation of trip by guests, we would charge 8% of total booking amount as processing charges + the charges levied by the corresponding service providers.<\/p>\n<h4><strong>Please note:<\/strong><\/h4>\n<p><img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> In case of special train journey (like Palace on Wheels, Royal Rajasthan on Wheels, Deccan Odyssey, Golden Chariot, Indian Maharaja &amp; Maharajas Express) – a separate cancellation policy is applicable (which would be advised as and when required).<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> For high peak season bookings (from 20th Dec to 15th Jan) – please note that if the booking for high peak season is\/are cancelled, due to whatsoever reason, no refund would be made for said cancellation.<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> During &#8220;Peak-Season,&#8221; which is defined by the density of tourist inflow in each region, and may vary from place to place and hotel to hotel, any particular hotel may implement a different cancellation policy. The travel agent is bound to follow the hotel specific cancellation policy; and in case of variation from the above-stated policy, the excess in cancellation charges will be borne by the client and not the travel agent.<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> In case you cancel the trip after commencement, refund would be restricted to a limited amount that too would depend on the amount that we would be able to recover from the hoteliers we patronize. For unused hotel accommodation, chartered transportation and missed meals etc. we do not take any guarantee to refund.<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> Modifications\/Cancellations sent directly to the hotel will not be honored.<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> In regard to unused or unutilized services (which are paid for and cancelled well in advanced) the refunds amounts would be worked out on the basis of cancellation policy as described above, any refund against a payment received through a Credit Card, will be made on the same credit card only. Please note that the refund process may take 2 to 8 weeks due to banking procedures.<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> No deductions will be made for the refunds (except the transaction charges), which are made due to unavailability of services. If the services requested are unavailable during the requested period, we will offer similar alternatives well before the commencement of the services and if the client does not find the alternatives acceptable, the advance will be refunded. However, once the alternative service is accepted by the client, cancellation of the same will be subject to the above-stated cancellation policy.<br \/>\nNo Refund for Unused Services<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> It is clearly understood that there shall be no refund or compensation whatsoever for unutilized services. This general rule applies to all kinds of non-utilization or under-utilization of tour services, whether of the whole or part of the tour and whether as a matter of your choice, or caused by your fault or compelled by circumstances such as ill-health, weather, external factors etc.<br \/>\n<img decoding=\"async\" src=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" alt=\"arrow\" width=\"14\" height=\"11\" align=\"absmiddle\" hspace=\"2\" vspace=\"5\" loading=\"lazy\" \/> There will be no refund if you fail to or are unable to utilize any of the services on the tour like airline travel, hotels, sightseeing, rides, cruises, meals, entrance fees, optional tours etc due to any reason whatsoever such as late reporting, ill-health etc.<\/p>\n<h3>Check-in and Checkouts Policy:<\/h3>\n<p><strong>(1)<\/strong> Check-In Timings: 1200 – 1500 Hours.<br \/>\n<strong>(2)<\/strong> Early arrival is subject to availability. For guaranteed early check-in, reservation needs to be made starting from the previous night.<br \/>\n<strong>(3)<\/strong> Check-Out Timings: 1000 &#8211; 1200 Hours.<br \/>\n<strong>(4)<\/strong> Late check-outs are available on request and subject to availability \/ Payment.<\/p>\n<h3>Extra Usage of Car\/Coaches<\/h3>\n<p>Please note that the cost of extra usage of vehicle (cars\/coaches with the driver) is not included in the services and hence extra usage of Vehicle after transfer or after sightseeing is not allowed until unless it is mentioned in the detailed itinerary\/services.<\/p>\n<p><strong>Please note:<\/strong> After the finalization of the tour or service cost, if there are any hikes in entrance fees of monuments, museums, taxes, fuel cost or guide charges by the Govt. of India, the same would be charged as extra.<\/p>\n<h3>Website Information Disclaimers:<\/h3>\n<p>The contents of web pages may not always be fully updated. We therefore ask you to confirm the current information by contacting us.<\/p>\n<h3>Please note:<\/h3>\n<p>The itinerary may have changed. The products and services displayed may have changed. The photos of meals\/sightseeing are for reference and may differ from the actual meals\/sights. Distance between places and temperatures are approximate and can change depending on travel, road conditions and climatic changes.<\/p>\n<h3>Itinerary may change at any time<\/h3>\n<p>we reserve the right to alter, amend, change or modify the tour package and itineraries before or during the tour. We will make reasonable efforts to notify you promptly of such changes as and when they are made.<\/p>\n<p>Such changes may be necessitated due to factors beyond our control such as Force Majeure events, strikes, fairs, festivals, sport events, weather conditions, traffic problems, overbooking of hotels\/flights, cancellation \/ re-routing of flights or railway, closure of \/ restricted entry at a place of sightseeing. Generally, we try to avoid dates when big Fairs, Exhibitions and other events are held in certain cities as hotels are fully booked several years ahead. If you have to travel on such dates, you may have to stay in alternate hotels or hotels in other cities.<\/p>\n<p>We will make reasonable efforts to keep the overall package of services unchanged. However, we shall not be liable to refund any amount or pay any compensation on account of any change in itinerary.<\/p>\n<h3>Liabilities and limitations:<\/h3>\n<p><strong>Namaste India Trip Pvt. Ltd.<\/strong> shall not be responsible for any delay or change in programme or expenses incurred or special\/consequential loss, injury and damage – directly or indirectly – due to natural hazards, flight cancellations, accident, breakdown of machinery or equipments, breakdown of transport, weather, sickness, landslides, political closures, acts of God, perils incident to the sea, floods, fire, acts of Government or any other authorities, wars, civil disturbances, riots, theft, pilferage, epidemics, quarantines, medical or custom department regulations, defaults, or any other causes beyond our control or any untoward incidents or any such causes whatsoever including any liability or extra expenses sustained by the Clients. Further, the Clients shall be liable for the liability or extra expenses incurred by him\/her as a result of the foregoing causes.<\/p>\n<p><strong>Namaste India Trip Pvt. Ltd.<\/strong> shall not be responsible and shall not accept any liability towards the Clients or his\/her legal representative for any loss of property or damages resulting from death or injuries including loss of services which the Clients may sustain on account of act, negligence or default by any transportation Company, hotel agents or any other body of persons, its agents or service providers providing such services or facilities or arising out of or while engaged in any tour, means of transportation or other services, whether due to ownership, maintenance , use, operation or control of any automobile, bicycle, boat, motor, or other vehicle in common carrier or otherwise and whether due to its or there negligence or otherwise or regardless of how caused. Clients using sporting equipment, bicycles, sailing boats, scuba diving gear, hired or supplied by hotels or rental bodies shall do so at their own risk.<\/p>\n<p>We do not have any insurance policy covering the expenses for accident, sickness, loss due to theft, or any other reasons. Visitors are advised to seek such insurance arrangements in their home country. All baggage &amp; personal property\/s at all times are at the client&#8217;s risk.<\/p>\n<h3>Modification in Booking by You<\/h3>\n<p>If you wish to amend or change your booking, you have to communicate your request to us in writing. Such requests for change or amendment will be accepted subject to availability.<\/p>\n<p><strong>Notes:<\/strong><br \/>\n<strong>(1)<\/strong> The amended or changed booking will be regarded as a new booking;<br \/>\n<strong>(2)<\/strong> An amendment fee of INR 500 is payable in case of every amendment or change; and<br \/>\n<strong>(3)<\/strong> In case the amendment is carried out within the cancellation period, then a cancellation charge shall apply as if a cancellation was made on the date the request for amendment or change is made. Please note the cancellation charges specified in the preceding section.<\/p>\n<h3>Change the Tour to another:<\/h3>\n<p>A request in writing for transfer from one tour to another 30 days prior to the departure will be treated as cancellation on that tour and a fresh booking on another. In these cases, a transfer fee of Rs.500\/- per person will be applicable in addition to the costs for re-processing your documentation including permits \/ Rail\/cruise \/ airlines\/bus bookings etc. due to the transfer to another tour. In case you transfer within the cancellation period, then the cancellation policy will apply.<\/p>\n<h3>Rate Of Exchange apply on Refunds:<\/h3>\n<p>Please note that refunds of foreign exchange component of the tour cost will be based on our buying rate of that date. When we receive Indian rupees from you in relation to a booking, we convert them into the foreign exchange component of the tour cost at our selling rate, then applicable. However, when we refund the foreign exchange component to you in Indian rupees, we do so at our buying rate applicable on the date of refund.<\/p>\n<h3>Therefore, please carefully note that<\/h3>\n<p><strong>(1)<\/strong> If you cause any injury or damage affecting the service provider, then you may be liable to the service provider and if the service provider recovers any monies from us for such injury or damages, we shall separately charge you for the same;<br \/>\n<strong>(2)<\/strong> We cannot be held responsible for any delay, deficiency, injury, death, loss or damage occasioned due to act or default of such service providers, their employees or agents.<\/p>\n<h3>Food<\/h3>\n<p>please refer to the itinerary in the website for details of the meals which would be served to you on the tour. Unlike an airline, we cannot process a special meal, nor can we guarantee a special diet. We, however, reserve the right to change the meal arrangement, where circumstances compel us to do so. At some places a meal allowance may be paid to you to enable you to have a meal of your own choice.<\/p>\n<h3>Accommodation<\/h3>\n<p>As the Client would be out sightseeing most of the time and retire to their rooms only for the night, the Company selects hotels at locations, which give comfort and value for money. Hence depending on the day-to-day itinerary, the hotel confirmed either in the city or away from the city centre. Modern facilities such as attached toilets with showers\/bathtubs are provided. We cannot guarantee the availability of adjoining rooms \/ interconnecting rooms \/ non-smoking room\/rooms on the same floor etc. and are subject to availability. If you seek a change in rooming while on a tour, the same will be subject to availability and you will need to pay any additional charges as may be applicable.<\/p>\n<h3>Law and Jurisdiction<\/h3>\n<p>This contract will be governed by Indian law. You agree that in the event of a dispute or difference between the parties the exclusive jurisdiction shall vest in the competent court\/ forum\/tribunal in Delhi only.<\/p>\n<h3>Your Suggestions:<\/h3>\n<p>If you have any tips, which you might want to share with us, do write into us at our Registered Office as listed above or email us at <a href=\"mailto:feedback@namasteindiatrip.com\">feedback@namasteindiatrip.com<\/a> or call to us at +91- 11-45538925.<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div id=\"cmsmasters_row_673c2c9b670839_12319881\" class=\"cmsmasters_row cmsmasters_color_scheme_default cmsmasters_row_top_default cmsmasters_row_bot_default cmsmasters_row_boxed\">\n<div class=\"cmsmasters_row_outer_parent\">\n<div class=\"cmsmasters_row_outer\">\n<div class=\"cmsmasters_row_inner\">\n<div class=\"cmsmasters_row_margin\">\n<div class=\"cmsmasters_column one_first\">\n<div class=\"cmsmasters_text\">\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div id=\"cmsmasters_row_673c2c9b670ff9_00914738\" class=\"cmsmasters_row cmsmasters_color_scheme_default cmsmasters_row_top_default cmsmasters_row_bot_default cmsmasters_row_boxed\">\n<div class=\"cmsmasters_row_outer_parent\">\n<div class=\"cmsmasters_row_outer\">\n<div class=\"cmsmasters_row_inner\">\n<div class=\"cmsmasters_row_margin\">\n<div class=\"cmsmasters_column one_first\">\n<div class=\"cmsmasters_text\">\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n\n","protected":false},"excerpt":{"rendered":"Online Booking: You can purchase our services from our sales outlets, or you can register and book your tour\/services online through our website. Our website provides the facility of making online booking of tours and services. After confirmation in written from you an agreement made between you and us. Booking Amount: For the services contracted,...","protected":false},"author":5,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-6361","page","type-page","status-publish","hentry"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms and Conditions - Namaste India Trip<\/title>\n<meta name=\"description\" content=\"This user agreement and terms and conditions in for the use of services of Namaste India Trip. specific terms &amp; conditions are mentioned too.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms and Conditions - Namaste India Trip\" \/>\n<meta property=\"og:description\" content=\"This user agreement and terms and conditions in for the use of services of Namaste India Trip. specific terms &amp; conditions are mentioned too.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:modified_time\" content=\"2022-09-09T04:47:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions\",\"url\":\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions\",\"name\":\"Terms and Conditions - Namaste India Trip\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\",\"datePublished\":\"2016-08-23T07:32:14+00:00\",\"dateModified\":\"2022-09-09T04:47:40+00:00\",\"description\":\"This user agreement and terms and conditions in for the use of services of Namaste India Trip. specific terms & conditions are mentioned too.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Term and Conditions – Namaste India Trip\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/\",\"name\":\"Namaste India Trip\",\"description\":\"Best Tour Operators in India\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/#organization\",\"name\":\"Namaste India Trip\",\"url\":\"https:\/\/www.namasteindiatrip.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/wp-content\/uploads\/2019\/02\/namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/wp-content\/uploads\/2019\/02\/namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\",\"https:\/\/www.instagram.com\/namasteindiatrip\/\",\"https:\/\/www.linkedin.com\/in\/namasteindiatrip\/\",\"https:\/\/www.youtube.com\/user\/NamasteInidaTrip\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Terms and Conditions - Namaste India Trip","description":"This user agreement and terms and conditions in for the use of services of Namaste India Trip. specific terms & conditions are mentioned too.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions","og_locale":"en_US","og_type":"article","og_title":"Terms and Conditions - Namaste India Trip","og_description":"This user agreement and terms and conditions in for the use of services of Namaste India Trip. specific terms & conditions are mentioned too.","og_url":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions","og_site_name":"Namaste India Trip","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_modified_time":"2022-09-09T04:47:40+00:00","og_image":[{"url":"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg"}],"twitter_card":"summary_large_image","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions","url":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions","name":"Terms and Conditions - Namaste India Trip","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg","datePublished":"2016-08-23T07:32:14+00:00","dateModified":"2022-09-09T04:47:40+00:00","description":"This user agreement and terms and conditions in for the use of services of Namaste India Trip. specific terms & conditions are mentioned too.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/terms-and-conditions"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/images\/arrow.jpg"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/terms-and-conditions#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/"},{"@type":"ListItem","position":2,"name":"Term and Conditions – Namaste India Trip"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/#website","url":"https:\/\/www.namasteindiatrip.com\/","name":"Namaste India Trip","description":"Best Tour Operators in India","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/#organization","name":"Namaste India Trip","url":"https:\/\/www.namasteindiatrip.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/wp-content\/uploads\/2019\/02\/namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/wp-content\/uploads\/2019\/02\/namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip","https:\/\/www.instagram.com\/namasteindiatrip\/","https:\/\/www.linkedin.com\/in\/namasteindiatrip\/","https:\/\/www.youtube.com\/user\/NamasteInidaTrip"]}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/pages\/6361","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/comments?post=6361"}],"version-history":[{"count":19,"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/pages\/6361\/revisions"}],"predecessor-version":[{"id":30703,"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/pages\/6361\/revisions\/30703"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/wp-json\/wp\/v2\/media?parent=6361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}