{"id":1013,"date":"2014-12-27T12:21:29","date_gmt":"2014-12-27T12:21:29","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=1013"},"modified":"2023-08-10T07:27:42","modified_gmt":"2023-08-10T07:27:42","slug":"famous-indian-food","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/","title":{"rendered":"Top 20 Tasty and Popular Dishes in India"},"content":{"rendered":"<p>Our country India with its cultural diversities is also a paradise for foodies and gluttons. There is a vast array of cuisines in our country, each one reflecting cultural, regional uniqueness. If you are passionate about food, you would surely love to taste and gain some knowledge on the most popular Indian dishes. This article below will help you in that. So read on:<\/p>\n<p>India is a land of diversity and variety and this applies to its cuisine as well. There is no standard form of Indian cuisine as each of its states has something different and unique to offer to the discerning foodie. Savory, sweet, curried, steamed, fried, roasted, slow cooked and garnished with fiercely guarded recipes these dishes will simply blow your mind away. Here is a comprehensive list of ever popular dishes as well as state wise popular delicacies that you must aspire to taste once in your life.<\/p>\n<h3><strong>1. Madra from Himachal Pradesh<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1023\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Madra.jpg\" alt=\"Madra\" width=\"700\" height=\"381\" \/><br \/>\nHimachal Pradesh boasts a lot of different cuisines but Pachadi cuisine is counted amongst one of the best. One of the best examples of traditional Pahari cuisine is Madra which is a creamy concoction perfect for those short and chilly winter days. Madra is slow cooked over a charcoal fire and boasts of an eclectic mix of ingredients like chick peas, sultana (long raisins), yoghurt, almonds and finely grated coconut. The aroma from this dish will make your mouth water and it tastes equally good with rice or chapattis.<\/p>\n<h3><strong>2. Irachi Ishtu or Kerala Chicken Stew<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1024\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Chicken-Stew.jpg\" alt=\"Chicken Stew\" width=\"700\" height=\"381\" \/><br \/>\nIrachi Ishtu tastes unlike the usual coconut flavored dishes of the south. This is comfort food at its best and is best had on a lazy Saturday or Sunday brunch when you are done sleeping in late. Irachi Ishtu is flavored with full bodied spices like cardamom, elaichi and cinnamon using chicken, tender leg of lamb or beef. The Kerala Chicken Stew should be served piping hot with fluffy white Appam or plain slices of white bread. If you are a vegetarian then try the Ishtu made with button hole mushrooms…it’s equally delicious.<\/p>\n<h3><strong>3. Makki Roti and Sarson Saag from Punjab<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1026\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Makki-Roti-and-Sarson-Saag-from-Punjab.jpg\" alt=\"Makki Roti and Sarson Saag\" width=\"700\" height=\"451\" \/><br \/>\nThis dish has been innumerable Bollywood movies, cookbooks and named by several high profile celebrities as their favorite winter recipe. Almost all good Indian Restaurants serve this Punjabi delicacy in the months of November to February. The subtly flavored earthy textured Makki Roti made with corn meal tastes wonderful with tender cooked mustard green (sarson saag) that is generously flavored by cumin and cooked in butter. A plate of freshly cut green salad and a tall glass of cold creamy salty lassi is all you need to complete this flavorsome true blue Punjabi meal.<\/p>\n<h3><strong>4. Daab Chingri from West Bengal<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1027\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Daab-Chingri-from-West-Bengal.jpg\" alt=\"Daab Chingri\" width=\"700\" height=\"431\" \/><br \/>\nKing Sized Prawns infused with tender coconut juice equals culinary utopia in the Bengal heartlands. It’s no easy feat to cook up this dish as the prawn has to be cooked inside tender coconut till all its flavors get infused in the tender succulent meat. Like most traditional Bengali dishes this one too is soaked with pungent mustard oil. Cream, mustard seeds, coconut grating, red chili, salt and turmeric foes in Daab Chingri to give it its distinct taste, This delectable prawn curry has a soupy texture and is best savored with steaming white long grained rice.<\/p>\n<h3><strong>5. Pork with dried Bamboo strips from Nagaland<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1030\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Pork-with-dried-Bamboo-Strips.jpg\" alt=\"Pork with dried Bamboo Strips\" width=\"700\" height=\"383\" \/><br \/>\nNagaland brings to you its signature dish the Naga Pork curry spiked with tender Bamboo shoots. This is a dish that will make your eyes water by its sharp flavors and delicious spicy taste. If you are a meat lover then you will be hooked to this dish from the very first bite. Made with tender pork pieces which are slow cooked over medium flame with an infusion of local herbs, red chili flakes and lots of freshly ground ginger. This dish is spicy without being oily and heavy and has an exotic appeal about it. Have it with hot boiled rice and pickled onions.<\/p>\n<h3><strong>6. Thalipeeth from Maharashtra<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1031\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Thalipeeth-from-Maharashtra.jpg\" alt=\"Thalipeeth\" width=\"700\" height=\"383\" \/><br \/>\nFinally we have a dish which scores full marks on the health front as well as taste!! The Maharashtrian Thalipeeth is low calorie, full of fiber and beats muesli and oats in taste any day. These pancakes take a long time to make but once made can be preserved for days. Roasted Chana lentils, urad dal, wheat extracts, sorghum flakes, pieces of millet, rice extracts all go into making this wholesome flavoursome Thalipeeth The flavor of the multi grain pancakes comes from coriander, onion powder, cumin and fresh coriander pieces. Served with thick buffalo cream this dish spells Delicious with a capital D.<\/p>\n<h3><strong>7. Litti Chokha from Bihar<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1032\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Litti-Chokha-from-Bihar.jpg\" alt=\"Litti Chokha\" width=\"700\" height=\"431\" \/><br \/>\nThis humble dish from the streets of Bihar has made it to many international food festivals and graced the covers of pan India gourmet magazines. This dish can be had as a snack or can serve as main course on winter mornings. Litti is made from wheat balls which are stuffed with masala Pitthi which is a mixture of coarsely ground spices along with roasted gram flour. Chokha is made up of charcoal grilled Brinjals or roasted charred mashed potatoes. Litti Chokha tastes amazing with a delicious dollop of pure ghee on the side.<\/p>\n<h3><strong>8. Masor Tenga from Assam<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1033\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Masor-Tenga.jpg\" alt=\"Masor Tenga\" width=\"700\" height=\"431\" \/><br \/>\nMasor Tenga comes from Assam and is a fresh take on the traditional fish curry of Bengal. The Assamese version is made with fresh water fish only and is slow cooked with baby tomatoes, long lemons (Assamese Kaji Nemu) and preserved dried mangosteen. This dish is made sans onion or garlic and has a unique spicy tangy flavor to it. Masor Tenga is best savored with long grained Basmati rice and sweet coconut chutney. This is a dish that is traditionally cooked as a lunch item.<\/p>\n<h3><strong>9. Rogan Josh from Kashmir<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1034\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Rogan-Josh.jpg\" alt=\"Rogan Josh\" width=\"700\" height=\"431\" \/><br \/>\nThe Persians brought this dish into India and many Indians have since then mentally thanked Persians for introducing them to this exotic and wonderfully delicious pattern. The Rogan Josh has to made with chunks of meat cut from tender lamb or a very young goat. The meat has to be slow cooked over charcoal fire and mixed with fiery red chilies and an assortment of Persian spices. Sultanas and blanched almonds are sometimes added to the Rogan Josh and it is believed to induce vitality and vigor in the body. Best had with soft buttery naans or fluffy white rice the Rogan Josh still rules the Indian culinary palette.<\/p>\n<h3><strong>10. Biryani<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1036\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg\" alt=\"Biryani\" width=\"575\" height=\"431\" \/><br \/>\nBiryani is the quintessential favorite of almost every Indian belonging from whichever state. There are a total of 16 different types of Biryani which are cooked in India with the hot favorites being Lucknow Biryani, Hyderabadi Biryani, Awadhi Biryani, Calcutta Biryani etc. The type of spice used in Biryani dictates its flavor but the rice used is almost always Basmati. Biryani is slow cooked over a dim fire in a covered pot while the rice, meat\/ vegetables, spices are all layered on top of each other till the flavors all infuse into each other and give the dish a whole bodied flavor. There is sometimes a succulent aloo or a boiled egg (or sometimes both) in this delicious staple Indian favorite.<\/p>\n<h3><strong>11. Malai Kofta<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1038\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Malai-Kofta.jpg\" alt=\"Malai Kofta\" width=\"575\" height=\"393\" \/><br \/>\nEven if you are a meat lover you will be seduced by the charms of this creamy concoction made with vegetable deep fried balls cooked in a saucy delectable curry. A selection of vegetables are fried and rolled together with arrowroot to form small balls that are then cooked in a cram and tomato onion curry. If you are still craving for the meaty version then try the meatball kofta which is equally tasty. This is a signature Mughlai dish.<\/p>\n<h3><strong>12. Paranthas<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1039\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Paranthas.jpg\" alt=\"Paranthas\" width=\"575\" height=\"431\" \/><br \/>\nOne of the most versatile items of Indian food this Parantha is a hot favorite with Indians of every age, sex and economic status. In fact there are entire lanes like  Gaya Bihar’s Paranthe Wali Gali which is dedicated to the Parantha made with a variety of fillings like potato, cauliflower, radish, Methi, and even unusual choices like okra, Aubergines, chillies and gourd. However the potato and the cauliflower versions of the North Indian Parantha wins hands down for their popularity. This dish can be best described as deep fried flatbread stuffed with choice of vegetables (or meat) and savored with a dollop of cold creamy yoghurt. Add on some white butter and fiery pickle for added taste.<\/p>\n<h3><strong>13. Palak Paneer<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1041\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Palak-Paneer.jpg\" alt=\"Palak Paneer\" width=\"575\" height=\"370\" \/><br \/>\nThis is one dish rich in vitamins and minerals and a true vegetarian’s delight indeed. The white cubes of cottage cheese sunken in the smooth creamy pureed green spinach sauce tossed and fried with garam masala, green chilies and generous amount of garlic, looks utterly mouthwatering. Enjoy this authentic Punjabi dish with parathas or Jeera rice and have a truly memorable dining experience.<\/p>\n<h3><strong>14. Dosa<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1042\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Dosa.jpg\" alt=\"Dosa\" width=\"575\" height=\"383\" \/><br \/>\nWho can forget the humble yet delicious and healthy Dosa that has tempted people for ages. Though Dosa originally came from South India it is now found in every street in India as it’s amazingly versatile and easy to prepare. Fermented rice batter crisp fried into golden circles and combined with tangy Sambhar and creamy coconut chutney is what makes this dish such a delectable combination. Dosa can be filled with a variety of stuffing’s from potatoes to carrots to cauliflowers to egg and chicken and can serve as a breakfast or lunch item.<\/p>\n<h3><strong>15. Tandoori Chicken<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1043\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Tandoori-Chicken.jpg\" alt=\"Tandoori Chicken\" width=\"575\" height=\"382\" \/><br \/>\nThis is yet another Indian dish that tastes exceptionally well apart from being very healthy too. The only effort you really need for this dish is to remember to soak the chicken pieces overnight in a mixture of yoghurt and finely ground spices for one night before you actually cook the dish. You will also need a tandoor or clay oven to cook this dish. Cooking it requires very less effort and results are always delicious.<\/p>\n<h3><strong>16. Dhokla<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1045\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Dhokla.jpg\" alt=\"Dhokla\" width=\"575\" height=\"402\" \/><br \/>\nDhokla originated from Gujarat but now it’s famous all over India as a tea time or a breakfast item. Dhokla is light, delicious and easy on the digestive system and cooking it doesn’t take too much time or effort. Fermented rice and batter made of chickpeas are all you are going to need for making Dhokla. Sprinkle on grated coconut, salted chillies, chopped coriander on top of the dhokla and have it with tangy tamarind chutney.<\/p>\n<h3><strong>17. Aloo Gobi<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1046\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Aloo-Gobhi.jpg\" alt=\"Aloo Gobhi\" width=\"575\" height=\"407\" \/><br \/>\nCome winter and you are sure to sniff the flavor of the hearty aloo Gobi curry wafting out from every North Indian home. This is a true blue Punjabi dish that has been embrace whole heartedly by people of all religions all across India. Medium diced potatoes and cauliflower along with peas and tomato is what goes into this wholesome curry that tastes amazingly good both with rice and roti. Aloo Gobi is seasoned with Jeera, Dhaniya and garam masala powder while freshly chopped coriander on the top gives this dish that added burst of colour.<\/p>\n<h3><strong>18. Gajar Halwa<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1047\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Gajar-Halwa.jpg\" alt=\"Gajar Halwa\" width=\"575\" height=\"401\" \/><br \/>\nHow can a discussion about tasty Indian dishes be complete without the famous Indian desserts? Come winter and Gajar Halwa is on every desi food lust list. As identified by its name this delicious dessert is entirely made up of carrots and so is stocked with vitamin A. Gajar Halwa is esoned with cashews, almonds and Pista and should be consumed piping hot. The Halwa simply melts into your mouth when you taste it taking you into gastronomic heaven. You have to try this dish to believe it.<\/p>\n<h3><strong>19. Shrikhand<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1048\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Shrikhand.jpg\" alt=\"Shrikhand\" width=\"575\" height=\"409\" \/><br \/>\nThis is a traditional summertime dessert that originated from Gujarat. Though this dish takes a long time to prepare as the yoghurt has to be processed correctly; the cooking technique is extremely simple. Strands of pure Saffron added to Shrikhand hikes up its taste and makes it taste even more delicious. Generally Pistachios make for a good combination with cold Shrikhand.<\/p>\n<h3><strong>20. Jalebi<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2739\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Sardar-Jalebi-Wala.jpg\" alt=\"Sardar Jalebi Wala\" width=\"741\" height=\"350\" \/><br \/>\nJalebi is a sweet that almost every Indian loves from the bottom of their hearts. Though the dish essentially looks like a messed up piece of orange sugar strings overlapping each other aimlessly the art of making those rings require quite a bit of practice. Just bite off a piping hot piece of jalebi after dipping it into cold Rabri and then suck on it to forget all the care in the world.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our country India with its cultural diversities is also a paradise for foodies and gluttons. There is a vast array of cuisines in our country, each one reflecting cultural, regional uniqueness. If you are passionate about food, you would surely love to taste and gain some knowledge on the most popular Indian dishes. This article below will help you in [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5046,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[45],"tags":[],"class_list":["post-1013","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top 20 Traditional Indian Foods - List of Indian dishes<\/title>\n<meta name=\"description\" content=\"India is a land of diversity and variety and this applies to its cuisine as well. There is a vast array of cuisines in our country, regional uniqueness.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top 20 Traditional Indian Foods - List of Indian dishes\" \/>\n<meta property=\"og:description\" content=\"India is a land of diversity and variety and this applies to its cuisine as well. There is a vast array of cuisines in our country, regional uniqueness.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2014-12-27T12:21:29+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-10T07:27:42+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"575\" \/>\n\t<meta property=\"og:image:height\" content=\"431\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Top 20 Tasty and Popular Dishes in India\",\"datePublished\":\"2014-12-27T12:21:29+00:00\",\"dateModified\":\"2023-08-10T07:27:42+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/\"},\"wordCount\":2042,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg\",\"articleSection\":[\"Food\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/\",\"name\":\"Top 20 Traditional Indian Foods - List of Indian dishes\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg\",\"datePublished\":\"2014-12-27T12:21:29+00:00\",\"dateModified\":\"2023-08-10T07:27:42+00:00\",\"description\":\"India is a land of diversity and variety and this applies to its cuisine as well. There is a vast array of cuisines in our country, regional uniqueness.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg\",\"width\":575,\"height\":431,\"caption\":\"Biryani\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Top 20 Tasty and Popular Dishes in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Top 20 Traditional Indian Foods - List of Indian dishes","description":"India is a land of diversity and variety and this applies to its cuisine as well. There is a vast array of cuisines in our country, regional uniqueness.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/","og_locale":"en_US","og_type":"article","og_title":"Top 20 Traditional Indian Foods - List of Indian dishes","og_description":"India is a land of diversity and variety and this applies to its cuisine as well. There is a vast array of cuisines in our country, regional uniqueness.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2014-12-27T12:21:29+00:00","article_modified_time":"2023-08-10T07:27:42+00:00","og_image":[{"width":575,"height":431,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Top 20 Tasty and Popular Dishes in India","datePublished":"2014-12-27T12:21:29+00:00","dateModified":"2023-08-10T07:27:42+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/"},"wordCount":2042,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg","articleSection":["Food"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/","name":"Top 20 Traditional Indian Foods - List of Indian dishes","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg","datePublished":"2014-12-27T12:21:29+00:00","dateModified":"2023-08-10T07:27:42+00:00","description":"India is a land of diversity and variety and this applies to its cuisine as well. There is a vast array of cuisines in our country, regional uniqueness.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Biryani.jpg","width":575,"height":431,"caption":"Biryani"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/famous-indian-food\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Top 20 Tasty and Popular Dishes in India"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1013","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=1013"}],"version-history":[{"count":6,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1013\/revisions"}],"predecessor-version":[{"id":8515,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1013\/revisions\/8515"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5046"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=1013"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=1013"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=1013"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}