{"id":1117,"date":"2015-01-21T12:55:01","date_gmt":"2015-01-21T12:55:01","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=1117"},"modified":"2022-02-26T11:03:11","modified_gmt":"2022-02-26T11:03:11","slug":"things-to-do-in-the-north-east-india","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/","title":{"rendered":"Things to Do In the North East India during Your Vacation"},"content":{"rendered":"<p>The North East India tour will introduce you to India in its most fecund and exotic form with abundant dense green forest covers, a vast array of rich and rare fauna and flora, undulating hills carpeted with lush green tufts of grass and the famous tea gardens. Furthermore the tribes residing in that part of the country, their lifestyle, the crafts, and the famous Bihu festival all would fascinate you a lot. Adventure, wildlife, Nature-North East India actually has everything that a traveler’s heart seeks. If you wish to know in details about the things to do in North East during vacation, go through the article below.<\/p>\n<p>The Golden Triangle is so visited and talked about it is rather worn at the edges. The princely tour of Rajasthan loses its glitter after a while and Goa is now so overcrowded that you might just as well stroll along Chowpatty for the beach experience. Kerala and the south have become so familiar it would be better to head to Sri Lanka or Maldives for the price but the sameness of sand, coconut and the sea can make you go nuts. So what do you do if you want something transcendentally different for your next tour? Look East they said and with wisdom so it is time to pack your bags and take a deeper look at the mystique of the North Eastern sister states of Arunachal, Mizoram, Assam, Manipur, Tripura, Meghalaya and Nagaland. Between them the sisters will keep you happily occupied and come away feeling fully replete.<\/p>\n<p><strong>01. Arunachal Pradesh<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1256\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg\" alt=\"Tawang Monastery\" width=\"700\" height=\"450\" \/><\/p>\n<ol>\n<li>Start with Arunachal Pradesh, the most North-Eastern part of the country and home to people speaking over 50 dialects.<\/li>\n<li>Try conversing with the locals and it is an adventure in itself. Give it up and head to the Tawang Monastery, the largest one in India and second only to the one in Lhasa.<\/li>\n<li>After you pay your respects to the Wise Buddha it is time to get some extremely fresh air and to do this you head to the Sela Pass in Tawang District. Find time to meditate in typical Buddhist setting or alongside the Sela Lake.<\/li>\n<li>Refreshed you can now head for Bomdila Eaglenest Wildlife Sanctuary and do what you came here for: trekking in the wilds with the valleys and peaks making for a visual treat with the crowning glory going to the Gorichen peaks of the Himalayas in the distance.<\/li>\n<li>The still waters of Shungatser Lake bordered by stately conifers are sheer poetry of Nature and worth the trek.<\/li>\n<li>After you have admired the Nuranang Falls and then visited Rukhmini Nagar rear Roing and then traipsed over to Ganga Lake, set out on a river rafting expedition on the Siang River or the Subansiri River. It is exhilarating and if you love fish, you will get your fill.<\/li>\n<li>Some of you might simply visit Itanagar, and visit the fort and then ignore everything else, preferring to live in the tribal villages with their simple lifestyle.<\/li>\n<\/ol>\n<p><strong>02. Assam<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1120\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Bihu-Festival.jpg\" alt=\"Bihu Festival\" width=\"700\" height=\"360\" \/><\/p>\n<ol>\n<li>Assam is the largest of the seven sisters, a plump rotund matron if you like to call her that, well filled with nature, wildlife and also bustling cities.<\/li>\n<li>Are you brave enough to face a rhino? They are dangerous and you could do it from a distance as you travel on elephant back along well-worn trails of the Kaziranga National Park.<\/li>\n<li>Now for some peace and quiet of another kind and this time it is pleasant boating on the Brahmaputra during which you might come across lively river dolphins cavorting in the fresh waters of this mighty river.<\/li>\n<li>Get a bit of spirituality and head for the unique Kamakhya temple, one of the shakti peeths in India where you can pray devoutly to have your wish fulfilled as to millions of devotees.<\/li>\n<li>Majuli is what makes your trip worthwhile. It is one of the largest river islands and even if you spend only a couple of hours here, you will find the food, people and way of life so distinctly different.<\/li>\n<li>Assam can be your cup of tea in more ways than one. The tea cup of India has numbers of tea gardens and if you are lucky you could get to stay in one for a day and pick the delicate tea leaves alongside other pickers working to the chant of songs. Brew a fresh cup of tea and then move on.<\/li>\n<li>If you have the time visit the Manas National Park, the Dibru Saikhowa National Park and the Orang National Park or drop in at Umananda Island, the smallest island in the middle of a river. Before you leave sample local bamboo shoot delicacies and the spicy foods for which Assam is so well known.<\/li>\n<\/ol>\n<p><strong>03. Manipur<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1122\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Sendra-Island-Manipur-e1422705043405.jpg\" alt=\"Sendra Island, Manipur\" width=\"700\" height=\"300\" \/><br \/>\nManipur is heartbreakingly beautiful with its abundance of greenery and water bodies as well as temples.<\/p>\n<ol>\n<li>Alight on the Sendra Island in the middle of Loktak Lake. Soak in the sunshine or walk around and admire the scenery. This is a photographer’s paradise so be sure to have your camera ready and then indulge yourself in well-earned rice beer. Round off the evening with a Manipuri dance show or a display of martial arts for which the state is so famous. Sendra Island, Manipur<\/li>\n<li>Much as you love the Loktak Lake it is time to move on and the Keibul Lamjao National Park is the next thing to visit in Manipur after which you could drip in at a Metei tribal village and consider staying for a day or two to soak in the tribal life.<\/li>\n<li>The Dzukou Valley, however, can be the highlight of your tour with its rolling and undulating grassy meadows bejeweled with flowers, a truly lovely sight to delight your heart and soul.<\/li>\n<li>Just as attractive is the Barak Waterfalls which you should not miss for its picturesque beauty.<\/li>\n<\/ol>\n<p><strong>04. Meghalaya<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1123\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Living-Root-Bridges-Meghalaya.jpg\" alt=\"Living Root Bridges, Meghalaya\" width=\"700\" height=\"383\" \/><br \/>\nThe land of clouds invites you to explore its beauties.<\/p>\n<ol>\n<li>Start with the Khosi Hills about 11 KM from Mairang and admire the unique mammoth rounded dome of red granite that looks like an inverted super bowl. Climbing it is a challenge and you can pat yourself on the back if you do succeed.<\/li>\n<li>The Jaintia Hills about 65 Km from Shillong are easier and offer more by way of attractions chief of which are the monoliths or Menhirs that would delight Obelisk of the Gauls. These Menhirs are symbolic stones erected by erstwhile Jaintia Kings to commemorate victories in battle. While here explore the Thadlaskein Lake, the Umhang Lake and cross the stone bridge at Thlumuwi to be rewarded by the sight of the Maui Waterfalls. The Umlawan Cave in the same region is one you must explore for it being the longest and deepest in India. Be warned though: it is all of 21 km long.<\/li>\n<li>The Garo Hills are equally fascinating and the Tura Peak will challenge you to navigate the forests and steep foot tracks. Do not forget to visit the Nokrek Biosphere in the vicinity and then move on to Chibragre where you will see the confluence of the Rongram and Ganol Rivers. Boating along the yellow-ochre rocky shores is a joyful experience. Head into the Baghmara Reserve Forest and you will be impressed by the splendid variety of wildlife and colorful birds. Do not leave this area without visiting Siju where you will love to explore the Dobakkol or bat cave and lose yourself in its cool serenity as your boat glides in the semi-darkness. Round off the trip with a visit to the Imilchang Dare waterfall and take a dip in the pool, alive with multicolored fish.<\/li>\n<li>If sightseeing does not interest you can always go trekking in the Living Root Bridge area, explore the Kyllang Rock or saunter along the David Scott Trail, admiring waterfalls and native habitats as you go along. For the really tough the trek from Cherrapunjee to Pynursula or Krang is the one to take. River canyoning on the Sohra is only for the very fit so be sure before you under this perilous activity.<\/li>\n<li>Try your hand at skiing on water, yachting if you more sedate or travel on high speed boats or water scooting. Simply exhilarating. Then you can pick up a bow and try to hit a target. Archery is quite popular here.<\/li>\n<\/ol>\n<p><strong>05. Mizoram<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1124\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Vantawng-Falls.jpeg\" alt=\"Vantawng Falls\" width=\"700\" height=\"431\" \/><br \/>\nMizoram is the land of misty Blue Mountains and home to people believed to have migrated from China with their unique blend of culture. The region is strikingly green and you will see quaint wooden houses built n stilts, rolling green farms, hills and rivers flowing through deep gorges.<\/p>\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>A climb up the Phawngpui or the Blue Mountain is soul lifting since the locals consider it the abode of Gods. You will love the unique combination of flora that includes striking trees and colorful flowers, as also the view of haze covered valleys and hills below.<\/li>\n<li>The Dampa Sanctuary offers ample opportunities to come face to face with leopards, elephants, deer and tigers but it is the lush greenery that will impress you even more. The Ngengpui sanctuary is the larger one, spread over an area of 110 square kilometers and home to plethora of wildlife. Trekking under the tall green canopies is a wonderfully soothing experience.<\/li>\n<li>Just as lovely is the Vantawng Falls a scenic spot to take a break, have a picnic and walk around.<\/li>\n<li>The Tamdil Lake reflects tranquility and you can take a boat out to the middle, lean back and relax to the sound of water and the quiet whisper of the wind.<\/li>\n<li>If you are fond of caves then Mizoram has its fair share of caverns in the mountainsides.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p><strong>06. Nagaland<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1127\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Japfu-Peak.jpg\" alt=\"Japfu Peak\" width=\"700\" height=\"431\" \/><br \/>\nNagaland is home to rich tropical forests, rolling hills and plains and also a number of tribes with their own customs and way of life. You could consider living in a Naga village for a day just to live life their way.<\/p>\n<ol>\n<li>The Japfu Peak is a challenge for the adventurously inclined. Bamboo predominates and navigating the dense growth is physically strenuous but the view from atop, especially the sunrise, is quite enchanting.<\/li>\n<li>From the mountains to the Dzukou valley is a lovely journey made even more rewarding with the sight of flowers in full bloom. The valley is aptly called the Valley of Flowers and is magically enchanting enough to make you want to stay here for a longer time.<\/li>\n<li>Fakim Sanctuary is another must visit place, a medley of bubbling Rvulets, rich green forest cover and an abundance of animals such as monkey,s bears, boars, jungle cats and tiger coexisting with pheasants, jungle fowls and horn bills.<\/li>\n<li>The Intanki Wildlife sanctuary is another attraction not far from Dimapur and is home to Sloth Bears, tigers, elephants, deer and wild dogs as well as colorful birds. Trekking on well-worn trails is a wonderful experience and the cool atmosphere keeps you going for miles.<\/li>\n<li>Round off your visit to Nagaland with a visit to Meluri and the Shilloi Lake. The area is a lovely picnic spot with a number of rivers and hillocks presenting a magnificent view.<\/li>\n<\/ol>\n<p><strong>07. Tripura<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-4625\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Tripura.jpg\" alt=\"Tripura\" width=\"700\" height=\"449\" \/><br \/>\nTripuri is a motley collection of tribes and settlers from Bengal and Manipur and as such presents a rich cultural milieu. However, of more interest are the wildlife sanctuaries and the temples of which the Tripura Sundari Temple is the most famous.<\/p>\n<ol>\n<li>Only 25 km from Agartala you will come upon the Sepahijala wildlife sanctuary spread over 18.5 kms and home to birds, lovely orchids and animals. A well-developed Park, the facilities here include elephant rides and boating.<\/li>\n<li>Another one a bit farther of is the Trishna Wildlife Sanctuary where birds are the attraction and you can enjoy trekking here as well.<\/li>\n<li>Gomati Sanctuary is larger with an area of 389 sq. km and home to thousands of birds clustered around the Gumti reservoir, a huge man made reservoir covering 300 sq. km. boating on this reservoir is the ideal way to get close to the birds and observe them in their natural habitat.<\/li>\n<li>If you love dense green forests, then the Rowa Wildlife Sanctuary will prove a more attractive destination. The Sanctuary also has a large number of birds and animals but you will love the variety of flora more than the fauna.<\/li>\n<\/ol>\n<p>North East India presents a different face not just in the lush greenery that is in stark contrast to the desert of Rajasthan but also in the people and customs that vary from one city to the other and one region to the other. It is quite unlike any region of India and is refreshingly interesting. This land challenges the brave to go on treks into the wild green interiors or climb mountains and then go white water rafting in the swirling waters.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The North East India tour will introduce you to India in its most fecund and exotic form with abundant dense green forest covers, a vast array of rich and rare fauna and flora, undulating hills carpeted with lush green tufts of grass and the famous tea gardens. Furthermore the tribes residing in that part of the country, their lifestyle, the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5743,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[89],"tags":[],"class_list":["post-1117","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-india"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top Places &amp; Best Things to Do in North East India<\/title>\n<meta name=\"description\" content=\"Adventure, wildlife, Nature-North East India actually has everything that a traveler’s heart seeks. Get full information on things to do in North East India.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top Places &amp; Best Things to Do in North East India\" \/>\n<meta property=\"og:description\" content=\"Adventure, wildlife, Nature-North East India actually has everything that a traveler’s heart seeks. Get full information on things to do in North East India.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2015-01-21T12:55:01+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-26T11:03:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"600\" \/>\n\t<meta property=\"og:image:height\" content=\"450\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Things to Do In the North East India during Your Vacation\",\"datePublished\":\"2015-01-21T12:55:01+00:00\",\"dateModified\":\"2022-02-26T11:03:11+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/\"},\"wordCount\":2125,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg\",\"articleSection\":[\"India\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/\",\"name\":\"Top Places & Best Things to Do in North East India\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg\",\"datePublished\":\"2015-01-21T12:55:01+00:00\",\"dateModified\":\"2022-02-26T11:03:11+00:00\",\"description\":\"Adventure, wildlife, Nature-North East India actually has everything that a traveler’s heart seeks. Get full information on things to do in North East India.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg\",\"width\":600,\"height\":450,\"caption\":\"Tawang Monastery\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Things to Do In the North East India during Your Vacation\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Top Places & Best Things to Do in North East India","description":"Adventure, wildlife, Nature-North East India actually has everything that a traveler’s heart seeks. Get full information on things to do in North East India.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/","og_locale":"en_US","og_type":"article","og_title":"Top Places & Best Things to Do in North East India","og_description":"Adventure, wildlife, Nature-North East India actually has everything that a traveler’s heart seeks. Get full information on things to do in North East India.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2015-01-21T12:55:01+00:00","article_modified_time":"2022-02-26T11:03:11+00:00","og_image":[{"width":600,"height":450,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Things to Do In the North East India during Your Vacation","datePublished":"2015-01-21T12:55:01+00:00","dateModified":"2022-02-26T11:03:11+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/"},"wordCount":2125,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg","articleSection":["India"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/","name":"Top Places & Best Things to Do in North East India","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg","datePublished":"2015-01-21T12:55:01+00:00","dateModified":"2022-02-26T11:03:11+00:00","description":"Adventure, wildlife, Nature-North East India actually has everything that a traveler’s heart seeks. Get full information on things to do in North East India.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg","width":600,"height":450,"caption":"Tawang Monastery"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/things-to-do-in-the-north-east-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Things to Do In the North East India during Your Vacation"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1117","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=1117"}],"version-history":[{"count":3,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1117\/revisions"}],"predecessor-version":[{"id":7554,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1117\/revisions\/7554"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5743"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=1117"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=1117"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=1117"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}