{"id":1229,"date":"2015-04-18T11:39:12","date_gmt":"2015-04-18T11:39:12","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=1229"},"modified":"2023-12-16T10:41:37","modified_gmt":"2023-12-16T10:41:37","slug":"buddhist-pilgrimage-sites-in-india","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/","title":{"rendered":"Buddhist Pilgrimage Sites in India"},"content":{"rendered":"<p>Gautam Buddha, a great spiritual Guru and God incarnate had number of disciples during his lifetime. He founded a new religion ‘Buddhism’ which now is a major religion worldwide and nationwide. There are a huge number of Buddhist pilgrimage destinations in India where pilgrims from all round the world make a bee line. Each of these places is intricately connected with Lord Buddha. To know more on Buddhist pilgrimage in India, read on-<\/p>\n<p>The 6th century ascetic Buddha who showed the whole world the path of light and divinity is now worshipped by almost 1\/3rd of the human population. Buddha is a religious icon who is known to inspire devotion and faith even in on followers i.e. non Buddhists. Devout Christians, Hindus and people of all other religions are likely to be inspired by the holistic and expansive principles of Buddhism. Gautam Buddha has strong roots in India and there are many places here that rightfully claim the top position in the Buddhist Pilgrimage circuit in India.<\/p>\n<h3><strong>Caturmahapratiharya or the Four Great Wonders<\/strong><\/h3>\n<p>There is very little information available about the origins of Buddhist Pilgrimage sites as Buddhism first began as an offshoot of Hinduism before commanding its own set of traditions. According to the Mahaparinibbana Sutta Buddha instructs his primary disciple Ananda about the four places of light and power which every spiritual person should look upon. The four places are Lumbini (birthplace of Lord Buddha), Bodh Gaya (attainment of realization), Sarnath (disbursement of teaching) and Kushinagar (Buddha passed away).<\/p>\n<p><strong>Lumbini<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1230\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg\" alt=\"The World Peace Pagoda Lumbini\" width=\"700\" height=\"383\" \/><br \/>\nLord Buddha or Prince Siddhartha as he was known then was born in the middle of a lovely garden called Lumbini; there is a giant Asokan Pillar at the exact spot in the garden bearing the words “here is the birthplace of Buddha”. Lumbini is on the Indo Nepal border. You can stay at Bhairawa and then obtain the permit to visit Lumbini before returning back to Bhairawa.<\/p>\n<p><strong>Bodh Gaya<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-3259\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Bodh-Gaya.jpg\" alt=\"Bodh Gaya\" width=\"700\" height=\"486\" \/><br \/>\nBodh Gaya was known as Uruvela in Buddha’s time and it was the seat of inspiration for all the earlier Buddha’s of Buddhism along with Gautama Buddha. All the future Buddha’s are also expected to attain enlightenment at this place. Bodh Gaya is also fondly called the center of the Buddhist Universe and Navel of Earth. Right at the center of the town is the Mahabodhi temple which has the Buddha tree behind it, all the mystic surrounding shrines make up the Buddha’s seven weeks in Gaya. There is a lot of international tourist traffic in Bodh Gaya and you can see the hundreds of beautiful pink lilies in the lake. Other beautiful spots here are the Niranjana River and the Bodhi tree (especially during the full moon). At one part of Bodh Gaya there is an 80 feet Japanese Buddha statue. If you are interested in gaining knowledge about Buddhism then contact the Root Institute, Mahabodhi Society and Korean Temple.<\/p>\n<p><strong>Sarnath<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1232\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Sarnath-Chaukhandi-Stupa.jpg\" alt=\"Sarnath Chaukhandi Stupa\" width=\"700\" height=\"383\" \/><br \/>\nSarnath is just 15 km away from Varanasi and it is at the lovely deer park of Sarnath that the Buddha preached his first two discourses. Dhammacakkappavattana Sutta and Anattalakkhana Sutta are the two great discourses he taught. The ruined gardens of Sarnath are still full of the mystic relics of Buddha and it is a profound spiritual experience to just stroll through the garden. Pilgrims would also like to check the Asoka Pillar, Dhamek Stupa and the Mulagandhakuti Vihara. If you are interested in Indo Buddhist art then don’t miss paying a visit to the Sarnath Museum. Apart from this there are interesting Burmese, Korean, Tibetan, Chinese and Thai temples in Sarnath.<\/p>\n<p><strong>Kushinagar<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1236\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Kushinagar.jpg\" alt=\"Parinirvana Stupa\" width=\"700\" height=\"420\" \/><br \/>\nMahaparinibbana Sutta contains a moving account of the final years of Gautama Buddha and the last few moments he spent at Kushinagar or Kusinara. Buddha was said to rest his body between two sal trees and draw hi last breath and attain Parinivana\/nirvana. There is a beautiful Nirvana temple built right at this spot and ruins of ancient monasteries are artistically presented amidst the gardens. Interestingly Kusinara is full of Sal trees. There is a museum in Kusinara containing authentic Buddhism relics which you can visit. You can try staying at Gorakhpur while planning a visit to Kusinara.<\/p>\n<h3><strong>Four Sites of Buddhism Miracles<\/strong><\/h3>\n<p>As the religion of Buddhism gained Momentum there was special impetus placed on four sites where miraculous events had taken place in context of Lord Buddha. These four sites collectively known as Rajgriha symbolized the height of power of Buddhism; Rajgriha, Sravasti, Vaishali, Smakasya.<\/p>\n<p><strong>Sravasti<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1237\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/sravasti-buddha-temple.jpg\" alt=\"sravasti buddha temple\" width=\"700\" height=\"400\" \/><br \/>\nSravasti’s principal attraction today is the ancient historical resort called the Jetavana which was built by the rich businessman Anathapindika. This place was preferred a lot by Buddha who spent the 20 last monsoons of his life there. There are many monasteries near Jetavana and they are set artistically amidst fragrant gardens. The Buddha preached many discourses here and also performed a miracle wherein he tamed a mad elephant. If you are interested in gaining further knowledge about Buddhist then do read the Angulimala Sutta which is available here. Don’t miss paying a visit to the State Museum and the Sri Lankan Temple here. It’s easy to reach Sravasti from Lucknow.<\/p>\n<p><strong>Sankassa\/Sankasya<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1238\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Sankassa-Uttar-Pradesh.jpg\" alt=\"Sankassa Uttar Pradesh\" width=\"700\" height=\"400\" \/><br \/>\nAfter attaining enlightenment Lord Buddha was approached by his deceased mother in his dreams. Legend has it that she asked to hear his discourse and Buddha promised to visit her at her heavenly abode. For three months Buddha was in Tusita heaven tutoring his mother on Abhidhamma. Later he descended from heaven at the place Sankassya. Obviously this place holds a very special significance for Buddhists as Ashoka emperor erected one of the pillars here.. Sankassya is difficult to reach but it is well connected to Sravasti.<\/p>\n<p><strong>Vaishali<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1241\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Vaisali-Bihar.jpg\" alt=\"Vaisali Bihar\" width=\"700\" height=\"385\" \/><br \/>\nVaishali was said to be one of the most popular sites of Buddha and he held it in special affection. Many events occured in Vaisaly like a group of monkeys offering the Buddha honey and Buddha preaching his sermon to Ambapali a prostitute. It is said the Lord Buddha delivered the Maha Sihanada Sutta or the long discourse over here. After a century post the nirvana attainment of Buddha a historic council was held in Vaishali and monks all over India participated in it to redefine the charts of Buddhism for the future. If you visit Vaishali then don’t forget to see the Asoka Lion Pillar, Japanese temple, Kharauna Lake and Stupa built over Vijjans (containing the ashes of Buddha). The only place to stay in Vaishali is the government tourist bungalow.<\/p>\n<p><strong>Rajgir<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1242\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Rajgir-Pegoda.jpg\" alt=\"Rajgir Pegoda\" width=\"700\" height=\"383\" \/><br \/>\nThe beauty and interesting terrain of Rajgir makes it a very popular religious Buddhist pilgrimage site. Rajgir is full of mystical ruins, dry forests, silent murmurs and majestic rocks. Rajgir was earlier known as Rajgriha and it was the capital of ancient state of Magadh (one of the biggest state of pre independence North India), there are several places of interest in Rajgir like the luscious Bamboo Grove, Cave of Devadatta, Cave of Satta Panna, mango grove of Jivaka, Pippilika Cave where Maha Kassapa liked to stay along with Boar’s Grott. What really captivates the mind about Rajgriha is the beautiful white and golden Japanese Stupa that is situated on the hill of Ratana. There are multiple thermal springs around and these are excellent sites to have a hot bath. Rajgir is filled with Swetambara and Digambara Jain monks.<\/p>\n<p>This is an excellent place to educate yourself on the discourses of Lord Buddha, Monks suggest the following options.<\/p>\n<ul>\n<li>Going up to the Vulture Peak point and reading Maha Saropama Sutta<\/li>\n<li>Going down to Boar’s Grotto and reading Dighanaka Sutta<\/li>\n<li>Meditating in Jivaka Mango grove after reading Jivaka Sutta<\/li>\n<li>Relaxing in Bamboo Garden and reading Dantabhumi Sutta.<\/li>\n<\/ul>\n<h4><strong>Pilgrimage Sites in other Parts of India<\/strong><\/h4>\n<p>Very few people know that the name Bihar is actually a derivation of Vihara which is a Buddhist place or worship or a monastery. Apart from the Buddhism sites which are mentioned above Bihar have innumerable other places which have a deep connect with Buddhism.<\/p>\n<p><strong>Gaya<\/strong><\/p>\n<p>Gaya in Bihar is not as popular as its cleaner cousin Bodh Gaya it it too has a deep connection to Buddhism. Interestingly Gaya is also one of the seven most religious towns of Hinduism. Buddha stayed in Gaya for a long period of time and delivered one of his most powerful discourses; the third discourse there. The site of the sermon is called Brahmayoni and it is a steep hill that was earlier called Gayasisa. The Fire Sermon which has a lot of drama and imagery was delivered by Lord Buddha at Gaya. The depiction is beautifully described in the poem Wasteland penned by T.S Eliot. If you are really interested in the origins of Buddhism then a visit to the Gayasissa is compulsory. Another good place is Tankitamancha or as it is known now Sujikund. This is where Gautam Buddha encountered and defeated the evil spirit Suchiloma. The state museum there has a good collection of Buddhist sculpture.<\/p>\n<p><strong>Champanagar<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1245\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Champanagar.jpg\" alt=\"Champanagar\" width=\"700\" height=\"300\" \/><br \/>\nGautam Buddha paid multiple visits to Champanagar during his lifetime and called it his favourite Eastern haunt. Interestingly the city got its name from the hundreds of Champaka trees that grow there. Champak flowers are well known for their sweet and strong fragrance. Ancient town of Champanagar was the place where Gautam Buddha taught the Kandarka and the Sonadanda Sutta. There is a beautiful lake here which is filled with hundreds of blooming lotuses (the Buddha’s favourite flowers). There is also a blue placid lake called Saravana Talib which is surrounded from all sides by Buddha statues.<\/p>\n<p>To reach Champanagar you have to take the road from Ganges to the Eastern Side of Bhagalpur via Patna.<\/p>\n<p><strong>Barabar Hills<\/strong><\/p>\n<p>The Barabar Hills were built by Emperor Asoka for the residence of the Ajivaka ascetics. The most prominent and beautiful of all this caves is the Lomas Rishi Cave that is fashioned out of gigantic chunk of Granite Hummock with an intricate wooden and thatch exterior. The cave has an interesting interior which is enhanced by large rectangular chamber with rare glass polish. Interestingly the cave looks like it has been cut by a modern laser. The book called Passage to India which is written by EM Foster has scenes describing the cave. The cave is at Kurkihar on the way between Rajgir and Gaya.<\/p>\n<p><strong>Indasala Cave<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1248\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Indasala-Cave.jpg\" alt=\"Indasala Cave\" width=\"700\" height=\"431\" \/><br \/>\nThis is quite a remote cave but is revered by Buddhist pilgrims all over the world for being the seat of one of the most famous discourses of Buddha; Sakkapanha Sutta. Propounded of Tibetan Buddhism Guhyasamaja Tantra lived inside the cave which is right at the base of the steep Giriyek mountain. The Giriyek road which connects to Rajgir runs along the Northern side of the mountain and leads to Hansa Stupa which is an interesting monument.<\/p>\n<p><strong>Nalanda<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1249\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/nalanda-ancient-university.jpg\" alt=\"Nalanda Ancient University\" width=\"700\" height=\"382\" \/><br \/>\nAnother famous place in Bihar; the Nalanda holds the biggest university of Buddhism and is of special interest to all Buddhist scholars. Buddha is said to have met and coached his successor Maha Kassapa at Nalanda. Kul Village near Nalanda is the birthplace of Moggallana who is one of the most famous disciples of Nalanda. It was in the 5th century that a monastic establishment was created in Nalanda and it later became the most famous center of Buddhist learning. Students from Korea, China and Sri Lanka have been known to come to Nalanda for learning. An interesting account of this university was described in the tales of Dharmasvamin in 1234. The temple 3 ruins of Nalanda, Nalanda museum are some great places you should not miss visiting.<\/p>\n<p><strong>Uttar Pradesh<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1250\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/kaushambi-allahabad.jpg\" alt=\"kaushambi allahabad\" width=\"700\" height=\"410\" \/><br \/>\nThe most important seat of Buddhism in Uttar Pradesh is Kaushambi which is near Allahabad. This place was actually the capital of ancient state Vamsa and it was here that many events in the life of Buddha had taken place. There are lovely ruins in Kosambi and each of them has a different story to tell about the life of Gautam Buddha. The many artifacts and scriptures recovered from the ruins of Kosambi are now on display at the Allahabad Museum and Archeology museum in Allahabad University.<\/p>\n<p><strong>Prabhosa<\/strong><br \/>\nOnce in Kosambi do make it a point to visit Prabhosa Hills as this is where Gautam Buddha spent the sixth monsoon retreat. It is said that the Buddha performed silent meditation here which is why no discourses have been taught here. The largest cave where Buddha stayed is now named Sita’s window. From the very top of Prabhosa Hill you will get a splendid view of Yamuna River. Prabhosa is only 11 km away from Kosambi.<\/p>\n<p><strong>Madhya Pradesh<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1252\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Sanchi-Stupa.jpg\" alt=\"Sanchi Stupa\" width=\"700\" height=\"407\" \/><br \/>\nMadhya Pradesh is notable in the Buddhist pilgrimage circuit for the Sanchi Shanti Stupa which is situated in Raisen District that is 46 km North East of Bhopal, The Sanchi Stupa is the most ancient stone structure in Madhya Pradesh as it was commissioned by Ashoka and designed by his wife Devi. The Stupa houses the inscriptions and relics of Maha Moggallana and Sariputra who are the two principal disciples of Buddha. This Shanti Stupa is also the place from where king Mahinda set out to proselytize the kingdom of Lanka.<\/p>\n<h3><strong>Mahayana Buddhism Pilgrimage Sites<\/strong><\/h3>\n<p>There are many Buddhist pilgrimage sites that are connected to the deities and other manifestations of spiritual figures of Buddhism along with\/apart from Gautam Buddha. These sites are mostly connected to Tibetan Buddhism or neo Mahayana Buddhism as opposed to Hinayana Buddhism pilgrimage sites described above. These sites are found in Leh-Ladakh, Indo China border, Indo Tibet border, Himachal Pradesh etc. These are mostly monasteries that contain Thangkas and ancient scrolls and some of them even have Tantric precedents.<\/p>\n<p><strong>Dharamsala<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1253\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Gyatso-monastery-in-Dharamsala.jpg\" alt=\"Gyatso monastery in Dharamsala\" width=\"700\" height=\"399\" \/><br \/>\nDharamsala and McLeodGanj (Upper Dharamsala) are both important centers of Tibetan Buddhism. The Dalai Lama has a strong connection to Dharamsala as post 1960 the CTA (Central Tibetan Administration) moved to Dharamsala. The Tibetan refugees all stringently follow the Dalai Lama and it is an important destination for foreign tourists. As this is an important hill station that is filled with beautiful monasteries you can visit it for a taste of its natural beauty as well as pilgrimage value.<\/p>\n<p><strong>Rumtek Monastery<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1254\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Rumtek-Monastery-in-Sikkim-e1429689976181.jpg\" alt=\"Rumtek Monastery in Sikkim\" width=\"700\" height=\"303\" \/><br \/>\nThis monastery in Sikkim is called the Dharmachakra Center as it is the center of the famous Karma Kagyu center of Tibetan Buddhism. The Rumtek Monastery is extremely beautiful and it is set against a backdrop of flowing streams, craggy mountains and hundreds of blooming flowers in the summer. Rangjung Rigpe Dorje was the presiding figure of the Monastery; this monastery is 24 km away from Gangtok the capital city of Sikkim.<\/p>\n<p><strong>Tabo Monastery<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1255\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Tabo-Monastery-in-Spiti.jpg\" alt=\"Tabo Monastery in Spiti\" width=\"700\" height=\"450\" \/><br \/>\nThe Monastery of Tabo is one of the most sacred seats of Tibetan Buddhism, This ancient monastery was founded in 996 CE or the Fire Ape Tibetan Year. Tabo is till now known as the most ancient Buddhist enclave in India. There are a huge number of beautiful frescoes that are drawn on the walls which describe the Buddhist Pantheon. Dalai Lama had held the 1983 and the 1996 Kalachakra ceremonies and this important monastery has gained protection under ASI or Archeological Survey of India.<\/p>\n<p><strong>Tawang Monastery<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-1256\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Tawang-Monastery.jpg\" alt=\"Tawang Monastery\" width=\"700\" height=\"450\" \/><br \/>\nThis is the biggest monastery outside Lhasa Tibet and holds special importance for all followers of Tibetan Buddhism. Interestingly this monastery is built on the several hundred square feet of area that Tibet had relinquished to India.<\/p>\n<p><strong>Suggested Tours<\/strong><\/p>\n<ul>\n<li><a href=\"https:\/\/www.namasteindiatrip.com\/buddhist-pilgrimage-tour-packages\">Buddhist Tour Packages<\/a><\/li>\n<li><a href=\"https:\/\/www.namasteindiatrip.com\/ajanta-ellora-caves-tour\">Ajanta Ellora Caves Tour<\/a><\/li>\n<li><a href=\"https:\/\/www.namasteindiatrip.com\/buddhist-pilgrim\">Buddhist Pilgrimage Tour<\/a><\/li>\n<li><a href=\"https:\/\/www.namasteindiatrip.com\/buddhist-circuit-train-tour\">Buddhist Train Tour<\/a><\/li>\n<li><a href=\"https:\/\/www.namasteindiatrip.com\/buddhist-tour-with-golden-triangle\">Buddhist Tour with Golden Triangle<\/a><\/li>\n<li><a href=\"https:\/\/www.namasteindiatrip.com\/india-nepal-buddhist-tour\">India Nepal Buddhist Tour<\/a><\/li>\n<li><a href=\"https:\/\/www.namasteindiatrip.com\/footsteps-of-buddha-1\">Footsteps of Buddha Tour<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Gautam Buddha, a great spiritual Guru and God incarnate had number of disciples during his lifetime. He founded a new religion ‘Buddhism’ which now is a major religion worldwide and nationwide. There are a huge number of Buddhist pilgrimage destinations in India where pilgrims from all round the world make a bee line. Each of these places is intricately connected [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5766,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[50],"tags":[],"class_list":["post-1229","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-pilgrimage"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Buddhist Pilgrimage in India - Buddhist Places in India<\/title>\n<meta name=\"description\" content=\"Get detailed information about Buddhist Pilgrimage in India. There are a huge number of Buddhist pilgrimage destinations in India.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Buddhist Pilgrimage in India - Buddhist Places in India\" \/>\n<meta property=\"og:description\" content=\"Get detailed information about Buddhist Pilgrimage in India. There are a huge number of Buddhist pilgrimage destinations in India.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2015-04-18T11:39:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-12-16T10:41:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"575\" \/>\n\t<meta property=\"og:image:height\" content=\"383\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Buddhist Pilgrimage Sites in India\",\"datePublished\":\"2015-04-18T11:39:12+00:00\",\"dateModified\":\"2023-12-16T10:41:37+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/\"},\"wordCount\":2582,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg\",\"articleSection\":[\"Pilgrimage\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/\",\"name\":\"Buddhist Pilgrimage in India - Buddhist Places in India\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg\",\"datePublished\":\"2015-04-18T11:39:12+00:00\",\"dateModified\":\"2023-12-16T10:41:37+00:00\",\"description\":\"Get detailed information about Buddhist Pilgrimage in India. There are a huge number of Buddhist pilgrimage destinations in India.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg\",\"width\":575,\"height\":383,\"caption\":\"The-World-Peace-Pagoda-Lumbini\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Buddhist Pilgrimage Sites in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Buddhist Pilgrimage in India - Buddhist Places in India","description":"Get detailed information about Buddhist Pilgrimage in India. There are a huge number of Buddhist pilgrimage destinations in India.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/","og_locale":"en_US","og_type":"article","og_title":"Buddhist Pilgrimage in India - Buddhist Places in India","og_description":"Get detailed information about Buddhist Pilgrimage in India. There are a huge number of Buddhist pilgrimage destinations in India.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2015-04-18T11:39:12+00:00","article_modified_time":"2023-12-16T10:41:37+00:00","og_image":[{"width":575,"height":383,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Buddhist Pilgrimage Sites in India","datePublished":"2015-04-18T11:39:12+00:00","dateModified":"2023-12-16T10:41:37+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/"},"wordCount":2582,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg","articleSection":["Pilgrimage"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/","name":"Buddhist Pilgrimage in India - Buddhist Places in India","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg","datePublished":"2015-04-18T11:39:12+00:00","dateModified":"2023-12-16T10:41:37+00:00","description":"Get detailed information about Buddhist Pilgrimage in India. There are a huge number of Buddhist pilgrimage destinations in India.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/The-World-Peace-Pagoda-Lumbini.jpg","width":575,"height":383,"caption":"The-World-Peace-Pagoda-Lumbini"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/buddhist-pilgrimage-sites-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Buddhist Pilgrimage Sites in India"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1229","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=1229"}],"version-history":[{"count":6,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1229\/revisions"}],"predecessor-version":[{"id":8816,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1229\/revisions\/8816"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5766"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=1229"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=1229"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=1229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}