{"id":1955,"date":"2017-04-15T12:12:27","date_gmt":"2017-04-15T12:12:27","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=1955"},"modified":"2023-07-19T06:05:27","modified_gmt":"2023-07-19T06:05:27","slug":"kochi-tourism","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/","title":{"rendered":"Kochi: At The Gateway of Kerala"},"content":{"rendered":"<ul>\n<li><strong>Country:<\/strong> India<\/li>\n<li><strong>State:<\/strong> Kerala<\/li>\n<li><strong>District:<\/strong> Ernakulam<\/li>\n<li><strong>Area:<\/strong> 9 square kilometres<\/li>\n<li><strong>Elevation:<\/strong> sea level<\/li>\n<li><strong>Population:<\/strong> 5 million (metropolitan)<\/li>\n<li><strong>Literacy Rate:<\/strong> 94 per cent<\/li>\n<li><strong>Female to male ratio:<\/strong> 1,024 per 1,000<\/li>\n<li><strong>Pin code:<\/strong> 682<\/li>\n<li><strong>Telephone Code:<\/strong> 484<\/li>\n<li><strong>Time Zone:<\/strong> GMT plus 5:30<\/li>\n<\/ul>\n<p>Kochi (earlier known as Cochin) is a sea port city on the south-western coast of the southern state of Kerala. It is the second largest city in Kerala after the state capital, Trivandrum. The strategic location of Kochi has earned it the name of ‘Queen of Arabian Sea’. Kochi is next only to Mumbai as the most important city in the western coast. The metropolitan limits of today’s Kochi include mainland Ernakulam, old Kochi, Thrippunithura to the southeast, the suburbs of Edappally, Kalamassery and Kakkanad to the northeast and a group of islands closely scattered in the Vembanad Lake. Most of these islands (including Bolgatty Island, Vallarpadam, Kumbalam, Vypeen Island, Willingdon Island, Ramanthuruthu and others) are very small in size that varies from six square kilometres to less than a square kilometre. Besides Malayalis, the majority community, Tamils, Gujaratis, Jews, Sikkimese, Anglo-Indians, Konkani’s and Tuluvas also reside in Kochi. Once the Jewish community called Malabar Yehuden formed a big proportion of the population of Kochi. Kochi is the headquarters of the Southern Naval Command of the Indian Navy. Kochi has been ranked among the top fifty tourist spots in the world.<\/p>\n<p><strong>Kerala<\/strong><\/p>\n<p>Kerala is located in the south-western part of the Indian peninsular. The state covers an area of 38,863 square km and is bordered by Karnataka in the north, Tamil Nadu in the east and the Arabian Sea in the west. Thiruvananthapuram or Trivandrum is the state capital of Kerala. Malayalam is the dominant language in Kerala. Kerala, for its scenic beauty, is called ‘God’s Own Country’.<\/p>\n<p><strong>History<\/strong><\/p>\n<p>In the twelfth century AD, Kochi (then Cochin) was established as the centre of the kingdom of Cochin after the fall of the Kulasekhara Empire. Kochi was an important spice trading centre on the Arabian Sea coast since the 14th century. Kochi became the first European colonial settlement in India following the Portuguese occupation in 1503. Kochi was the capital of Portuguese India till 1530 when the latter decided to shift it to Goa. Kochi hosted the grave of Vasco da Gama, the famous European explorer to have set sail for India and was buried at St. Francis Church until his remains were returned to Portugal in 1539. Kochi was subsequently occupied by the Dutch and the British as well as the rulers of Mysore. The hereditary premiership of Kochi held by the Paliath Achan also concluded during this period. By the Anglo-Dutch Treaty of 1814, Kochi was ceded to the Britishers in lieu of the Bangka Island. In 1866, Fort Kochi became a municipality and in 1896, the ruler of Cochin, subservient to the British, initiated local administration. In 1947, when India gained independence from, Cochin joined the Indian Union.<\/p>\n<p><strong>Possible source of the origin of the name ‘Kochi’<\/strong><\/p>\n<ul>\n<li>Some say it has evolved from the Malayalam term ‘Koch Azhi’, meaning ‘small lagoon’.<\/li>\n<li>Some indicate the name to have come from the Sanskrit word ‘Go shree’ which means ‘prosperous with cows’.<\/li>\n<li>A third source says the name has come from the term ‘Kaci’, which means ‘harbour’<\/li>\n<li>Many European accounts say the name Kochi has evolved after the ‘Kochchi’ river.<\/li>\n<\/ul>\n<p><strong>Geography<\/strong><\/p>\n<p>Kochi city is bordered by the Western Ghats mountain range in the east and the Arabian Sea in the west. Kochi is mainly located at the sea level with a coastline nearly 50 km long. The main rock types found in Kochi are Archaean-basic dykes, Charnockites and Gneisses. Soil of Kochi consists of sediments such as alluvium, Teri’s and brown sands. Hydromorphic saline soils are found in areas surrounding the backwaters.<\/p>\n<p><strong>Climate<\/strong><\/p>\n<p>Kochi experiences tropical monsoon climate. Its proximity to the equator and coast and mountain results in minimum variation in the seasonal temperature. Annual temperature ranges between 20 to 35 degree Celsius. Winter extends from December to January (maximum temperature around 28 degrees Celsius), summer from February to April (maximum temperature around 4 degree Celsius) and monsoon from May to November (maximum temperature around 31 degree Celsius). Kochi experiences heavy rainfall between June and September owing to its location in the windward side of the Western Ghats. During October-December, the city gets lighter rain. Average annual rainfall is 274 cm.<\/p>\n<p><strong>Flora and Fauna<\/strong><\/p>\n<p>The predominantly tropical flora of the region includes, Launaea, Ipomoea, Lippia, Moniera, Cynodon, and others. The Mangalavanam area at the centre of the city hosts several types of migratory birds and also supports mangrove trees. It is also home to a protected bird sanctuary. The backwaters harbour has different types of fishes and dolphins.<\/p>\n<h3><strong>Attractions in and Around Kochi<\/strong><\/h3>\n<p><strong>Kumarakom<\/strong><\/p>\n<p>A tourist village on Vembanad Lake in Kottayam district. Houseboats and boat-race are popular tourist attractions here. Kumarakom also has a bird sanctuary.<\/p>\n<p><strong>Willingdon Island<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg\" alt=\"Willingdon Island\" width=\"700\" height=\"466\" class=\"alignnone size-full wp-image-1961\" \/><\/p>\n<p>A manmade island set up in 1933 and is the headquarters of the Southern Naval Command.<\/p>\n<p><strong>Mangalavanam Bird Sanctuary<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Mangalavanam-Bird-Sanctuary.jpg\" alt=\"Mangalavanam Bird Sanctuary\" width=\"700\" height=\"423\" class=\"alignnone size-full wp-image-1962\" \/><\/p>\n<p>It features several birds type besides animals like Indian flying fox, Eurasian otter, painted bat, Dusky Pam squirrel besides various types of butterflies and spiders.<\/p>\n<p><strong>Mattancherry<\/strong><\/p>\n<p>The Dutch palace and the Jain Temple here are worthy to be visited<\/p>\n<p><strong>Paradesi Synagogue<\/strong><\/p>\n<ul>\n<li>One of the oldest synagogues in the world<\/li>\n<li>Munnar Hill Resort (130 Kms)<\/li>\n<li>Fort Kochi<\/li>\n<li>Vasco House<\/li>\n<li>St Francis Church of the 16th century: It is the oldest church built by the Europeans in India<\/li>\n<li>Hill Palace of Thrippunithura<\/li>\n<li>Pallipuram Fort at Vypeen Island<\/li>\n<li>Veega Land amusement park<\/li>\n<li>Marine Drive, Cherai Beach and Fort Kochi Beach<\/li>\n<li>Santa Cruz Basilica of the sixteenth century<\/li>\n<li>Vembanad Lake<\/li>\n<li>The longest and one of the largest lake in India<\/li>\n<li>Bolgatty Palace that has been turned into a heritage hotel now<\/li>\n<li>Parishath Thampuran Museum<\/li>\n<\/ul>\n<p><strong>Kalamassery Museum of Kerala History<\/strong><\/p>\n<p>Places like Lakshadweep (Agatti island is 459 km from Kochi), Kothamangalam (where the Thattekad Bird sanctuary is located) 60 km east of Kochi, Thekkady (where the Periyar Wildlife Sanctuary is located) 190 km east of Kochi, Kodungallur which is 35 km north of Kochi, Kodanad (30 km), Kalady (48 km), Cheruthuruthi (110 km), Alleppey (63 km) can also be visited from Kochi.<\/p>\n<p><strong>Economy<\/strong><\/p>\n<p>Kochi is an important industrial centre in south-western India.<\/p>\n<p>The Cochin shipyard is the largest shipyard and has the biggest ship building facility in India.<\/p>\n<p>The largest industrial belt in Kerala called Eloor is located 17 km north from Kochi. Eloor has a concentration of over 250 industrial units manufacturing chemical, petrochemical, pesticide, fertilizers, leather and other types of products.<\/p>\n<p>Gold and textile retailing, seafood and spices exports, tourism, health services, banking are other major industries based in Kochi.<\/p>\n<p>The fishing harbour at Thoppumpady supplies fish to the local as well as foreign markets.<\/p>\n<p>Kochi is also growing as a significant Information Technology hub. Easy access to undersea cables and lower operational costs as compared to other big cities is a major reson behind Kochi’s emergence as an IT hub. Info Park and KINFRA Export Promotion Industrial Park (a fully owned subsidiary of the Kerala Industrial Infrastructure Development Corporation) at Kakkanad are some of the major hubs in Kochi. Sobha Hi-Tech City and Smart City are also related to the fast evolving IT industry in Kochi.<\/p>\n<p><strong>BPCL Kochi Refineries at Ambalamugal<\/strong><\/p>\n<p>Coconut Development Board, Spices Board of India, Marine Products Export Development Authority, International Pepper Exchange (handles global trade in black pepper) and Coir Board of India are all based in the city of Kochi.<\/p>\n<p><strong>Cochin Port<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Cochin-Port.jpg\" alt=\"Cochin Port\" width=\"700\" height=\"430\" class=\"alignnone size-full wp-image-1959\" \/><\/p>\n<p>Cochin Port is a significant reason behind the city’s emergence as a major industrial centre in southern India. The port terminal at Willingdon Island handles the export and import of cargo. Another international container transshipment terminal is being commissioned at Vallarpadam island of Kochi. The port is under the administration of the Cochin Port Trust. Italso operates passenger ships to Colombo and Lakshadweep.<\/p>\n<p><strong>How to Reach Kochi<\/strong><\/p>\n<p><strong>By Air:<\/strong> Kochi International Airport is a world class airport located at Nedumbassery, about 30 km from the Kochi city. Kochi is connected with major Indian cities as well as those abroad by air.<\/p>\n<p><strong>By Rail:<\/strong> Kochi has three main railway stations, namely, Ernakulam Junction, Ernakulam Tower and Harbour Terminus on Willington Island. Kochi is connected to New  Gaya Bihar, Mumbai, Chennai and other places through railways. There is also a Navy airport in Kochi.<\/p>\n<p><strong>By Road:<\/strong> Kochi is also well-connected by road to several parts of the country. National Highway 17 (Mumbai-Kochi), National Highway 47 (Salem-Kanyakumari) and national Highway 49 (Kochi-Rameswaram) connect Kochi. Kochi is about 220 kilometres north of Trivandrum. National Highway 47 A (the shortest national highway in India) connects Kundannoor with Kochi.<\/p>\n<p><strong>By Water:<\/strong> Ships connect Kochi with places like Lakshadweep and Colombo in Sri Lanka. Besides, ferry services operated by Kerala Shipping and Inland Navigation Corporation, State Water Transport Department and also by private agencies are available from various boat jetties in the city. However, the construction of the Goshree bridges that connect Kochi’s islands, the importance of ferry transport has receded.<\/p>\n<p><strong>Accommodation<\/strong><\/p>\n<ul>\n<li>Bharat Hotel<\/li>\n<li>Old Harbour Hotel<\/li>\n<li>Ramada Resort<\/li>\n<li>Dream Hotel Cochin<\/li>\n<li>Taj Malabar Cochin<\/li>\n<li>Killians Boutique Hotel<\/li>\n<li>Hotel Arches<\/li>\n<li>Sajome<\/li>\n<li>Poovath Heritage Hotel<\/li>\n<li>Brunton Boatyard<\/li>\n<li>Ambady Palmgrove Club<\/li>\n<li>Koder House<\/li>\n<li>Abad Atrium Hotel<\/li>\n<li>Fort House<\/li>\n<li>Raintree Lodge<\/li>\n<li>Gokulam Park<\/li>\n<li>Green Woods-Bethlehem<\/li>\n<li>The Mercy<\/li>\n<li>The Old Courtyard Hotel<\/li>\n<li>Serena Spa Koder House<\/li>\n<li>Hotel Cochin Durbar<\/li>\n<li>The Woods Manor<\/li>\n<li>Casino Hotel<\/li>\n<\/ul>\n<p><strong>Facts about Kochi<\/strong><\/p>\n<p><strong>Court<\/strong><\/p>\n<p>Kerala High Court<\/p>\n<p><strong>Civic body<\/strong><\/p>\n<p>Kochi Corporation headquartered in Ernakulam (earlier there were three separate municipalities at Fort Cochin, Mattancherry and Ernakulam which were later merged to form the single Cochin civic body)<\/p>\n<p><strong>Electricity<\/strong><\/p>\n<p>Kerala State Electricity Board<\/p>\n<p>Urban development; Greater Cochin Development Authority (GCDA)<\/p>\n<p><strong>Bourse<\/strong><\/p>\n<p>Cochin Stock Exchange<\/p>\n<p><strong>Police<\/strong><\/p>\n<p>Kochi City Police under Police Commissioner<\/p>\n<p><strong>Religion<\/strong><\/p>\n<p>Hinduism, Christianity, Islam are the major religions while Jainism, Judaism, Sikhism and Buddhism have minor followings. Kochi, in fact, is the city with the largest Christian population in India.<\/p>\n<p><strong>Language<\/strong><\/p>\n<p>Malayalam and English are the main languages spoken in Kochi. Besides, Tamila and Hindi are also spoken.<\/p>\n<p><strong>Festivals<\/strong><\/p>\n<p>Onam, Vishu, Holi, Diwali, Easter, Eid ul-Fitr and Milad-e-sherif are celebrated in Kochi reflecting its truly composite character. A merry-making fest called Cochin Carnival is celebrated at Fort Kochi in end December.<\/p>\n<p><strong>Sports stadium<\/strong><\/p>\n<p>The Jawaharlal Nehru Stadium is the famous stadium in Kochi &amp; count as one of the best &amp; largest multi-purpose stadiums in India.<\/p>\n<p><strong>Famous Personalities<\/strong><\/p>\n<p>Changampuzha Krishna Pillai, Kesari Balakrishna Pillai, G. Sankara Kurup, Vyloppilli Sreedhara Menon are some of the famous litterateurs of Kochi. Besides, prominent social reformers like Sahodaran Ayyappan and Pandit Karuppan also hail from Kochi.<\/p>\n<p><strong>University and Institutes<\/strong><\/p>\n<p>Cochin University, Mahatma Gandhi University, Central Institute of Fisheries Nautical and Engineering Training, National University of Advanced Legal Studies, National Institute of Oceanography and the Central Marine Fisheries Research Institute.<\/p>\n<p><strong>Newspapers<\/strong><\/p>\n<p>Mathrubhumi, Malayala Manorama, Deshabhimani, Madhyamam, Deepika, Kerala Kaumudi, and Veekshanam and the Hindu, the New Indian Express and the Pioneer in English. Dailies in Hindi, Kannada, Tamil and Telugu are also available in Kochi. Magazines and religious publications like the Sathyadeepam, The Week and Vanitha are also published in Kochi.<\/p>\n<p><strong>Television Channels<\/strong><\/p>\n<p>Jeevan TV, Amrita TV, Manorama News, Asianet Cable Vision, Indiavision and Kairali TV.<\/p>\n<p><strong>Film Festival<\/strong><\/p>\n<p>Cochin International Film Festival (CIFF) is hosted in the city every year.<\/p>\n<p><strong>Dance<\/strong><\/p>\n<p>Kathakali<\/p>\n<p><strong>Special tourist attraction<\/strong><\/p>\n<p>Backwaters<\/p>\n<p><strong>Concerns in Kochi<\/strong><\/p>\n<ul>\n<li>Steep rise in unemployment<\/li>\n<li>Water crisis<\/li>\n<li>Growth of slum population<\/li>\n<li>High crime rate<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Country: India State: Kerala District: Ernakulam Area: 9 square kilometres Elevation: sea level Population: 5 million (metropolitan) Literacy Rate: 94 per cent Female to male ratio: 1,024 per 1,000 Pin code: 682 Telephone Code: 484 Time Zone: GMT plus 5:30 Kochi (earlier known as Cochin) is a sea port city on the south-western coast of the southern state of Kerala. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5836,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[33],"tags":[],"class_list":["post-1955","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-kerala"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Kochi Travel Guide Tourism &amp; Travel Guide - Places to visit in Cochin<\/title>\n<meta name=\"description\" content=\"Kochi is a sea port city on the south-western coast of the southern state of Kerala. Get full detailed information on Kochi tourism.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Kochi Travel Guide Tourism &amp; Travel Guide - Places to visit in Cochin\" \/>\n<meta property=\"og:description\" content=\"Kochi is a sea port city on the south-western coast of the southern state of Kerala. Get full detailed information on Kochi tourism.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-04-15T12:12:27+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-19T06:05:27+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"700\" \/>\n\t<meta property=\"og:image:height\" content=\"466\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Kochi: At The Gateway of Kerala\",\"datePublished\":\"2017-04-15T12:12:27+00:00\",\"dateModified\":\"2023-07-19T06:05:27+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/\"},\"wordCount\":1874,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg\",\"articleSection\":[\"Kerala\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/\",\"name\":\"Kochi Travel Guide Tourism & Travel Guide - Places to visit in Cochin\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg\",\"datePublished\":\"2017-04-15T12:12:27+00:00\",\"dateModified\":\"2023-07-19T06:05:27+00:00\",\"description\":\"Kochi is a sea port city on the south-western coast of the southern state of Kerala. Get full detailed information on Kochi tourism.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg\",\"width\":700,\"height\":466,\"caption\":\"Willingdon-island-kochi\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Kochi: At The Gateway of Kerala\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Kochi Travel Guide Tourism & Travel Guide - Places to visit in Cochin","description":"Kochi is a sea port city on the south-western coast of the southern state of Kerala. Get full detailed information on Kochi tourism.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/","og_locale":"en_US","og_type":"article","og_title":"Kochi Travel Guide Tourism & Travel Guide - Places to visit in Cochin","og_description":"Kochi is a sea port city on the south-western coast of the southern state of Kerala. Get full detailed information on Kochi tourism.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2017-04-15T12:12:27+00:00","article_modified_time":"2023-07-19T06:05:27+00:00","og_image":[{"width":700,"height":466,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Kochi: At The Gateway of Kerala","datePublished":"2017-04-15T12:12:27+00:00","dateModified":"2023-07-19T06:05:27+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/"},"wordCount":1874,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg","articleSection":["Kerala"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/","name":"Kochi Travel Guide Tourism & Travel Guide - Places to visit in Cochin","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg","datePublished":"2017-04-15T12:12:27+00:00","dateModified":"2023-07-19T06:05:27+00:00","description":"Kochi is a sea port city on the south-western coast of the southern state of Kerala. Get full detailed information on Kochi tourism.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Willingdon-island-kochi.jpg","width":700,"height":466,"caption":"Willingdon-island-kochi"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/kochi-tourism\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Kochi: At The Gateway of Kerala"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1955","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=1955"}],"version-history":[{"count":5,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1955\/revisions"}],"predecessor-version":[{"id":8422,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/1955\/revisions\/8422"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5836"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=1955"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=1955"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=1955"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}