{"id":2041,"date":"2017-05-03T12:57:25","date_gmt":"2017-05-03T12:57:25","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=2041"},"modified":"2022-02-26T11:41:40","modified_gmt":"2022-02-26T11:41:40","slug":"lucknow","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/","title":{"rendered":"Lucknow: The Royal City"},"content":{"rendered":"<ul>\n<li><strong>Country:<\/strong> India<\/li>\n<li><strong>State:<\/strong> Uttar Pradesh<\/li>\n<li><strong>District:<\/strong> Lucknow<\/li>\n<li><strong>Area:<\/strong> 2,528 square kilometres (metro)<\/li>\n<li><strong>Elevation:<\/strong> 128 m<\/li>\n<li><strong>Population: <\/strong>3 million<\/li>\n<li><strong>Pin code:<\/strong> 226<\/li>\n<li><strong>Telephone Code:<\/strong> 0522<\/li>\n<li><strong>Time Zone:<\/strong> GMT plus 5:30<\/li>\n<\/ul>\n<p>Lucknow (also known by the names of City of the Nawabs or the Golden City of the East, Shiraz-i-Hind, Constantinople of India), is the capital of Uttar Pradesh, the most populous state located in the northern heartland of India. One of the ninety Minority Concentrated Districts of India, Lucknow is famous for its architecture, gardens, music, poetry and cuisines. It is a popular subject of study for the keen students of history and culture. Lucknow is the second largest city of Uttar Pradesh after Kanpur and is a fast-growing metro city in India.<\/p>\n<p>Lucknow historically has been a learning centre in Hindi and Urdu. The city is famous for its Urdu Shayari (poetry).<\/p>\n<p><strong>History<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2051\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Lucknow-the-city-of-Nababs.jpg\" alt=\"Lucknow the city of Nababs\" width=\"700\" height=\"452\" \/><br \/>\nThe city of Lucknow and its adjoining parts in the Awadh region came under the successive rule of the  Gaya Bihar Sultanate, the Mughals, the Nawabs of Awadh and the British since the mid-14th century. It was also an important centre of action during the Sepoy mutiny of 1857 as well as the freedom movement against the British rule.<\/p>\n<p>Till the second decade of the 18th century, Awadh was a part of the Mughals administered by a Governor appointed by the Mughal Emperor in  Gaya Bihar. Awadh has historically been known as the granary house of India and it was strategically a key place for controlling the Doab region between the Ganga and Yamuna Rivers. Awadh has been a strong kingdom till the third Nawab; Shuja-ud-Daula succumbed to the British in the Battle of Buxar of 1964 while aiding Mir Qasim, the fugitive Nawab of Bengal.  Thereafter, the defeated king had to cede parts of his kingdom as well as penalties to the east India Company. The British also appointed a Resident at Awadh and gradually brought it under their strong control. They, however, abstained from capturing Awadh for that would have brought them under direct confrontation with the Marathas and the Mughals, even though the latter was in decline. Lucknow came into prominence when it was promoted as the capital of Awadh by Nawab Asaf-ud-Daula. The Awadhi Nawabs had made lasting contributions towards the architectural magnificence of the city.<\/p>\n<p>In 1798, the fifth Nawab, Wazir Ali abdicated and the British, subsequently, helped Saadat Khan to accede to the throne. A puppet king was installed by the British in the form of Saadat Khan, who by a treaty with the British in 1801, had given half of Awadh to the British East India Company and the state virtually became a vassal state of the Europeans. All revenues and assets of Awadh were spent behind the Britishers while the inefficient Awadhi rulers continued with their luxurious and pompous lifestyles. In 1856, the East India Company took military initiative and annexed Awadh, their long awaiting desire and put the kingdom under Sir Henry Lawrence’s command. The Nawab, Wajid Ali Shah was captured and put to exile. Wajid Ali’s minor son was crowned the king during the 1857 revolt during when Sir Lawrence was killed. Lucknow was sieged as well. However, the British later recaptured Awadh after the rebellion met a defeat. It was put under a chief commissioner once again.<\/p>\n<p>In 1901, Lucknow, which served as the capital of Awadh since 1775, was merged with the United Provinces of Agra and Oudh (Anglicized version of Awadh) and was made the provincial capital in 1920. In 1947 after India gained independence, Lucknow became the capital of Uttar Pradesh, or the erstwhile Uttar Pradesh.<\/p>\n<p>The city had played a historical role during the modern Indian freedom movement as well. The famous Lucknow pact of 1916 was signed here while it had strong connections with the Khilafat Movement. During the Khilafat Movement, Maulana Abdul Bari of Lucknow had actively co-operated with Mahatma Gandhi and Maulana Mohammad Ali.<\/p>\n<p>The All India Kisan Sabha was formed at the Lucknow session of the Indian national Congress in 1936 to organize and lead peasant grievances against the oppressive zamindars and it played an instrumental role in igniting the farmers’ movement in India.<\/p>\n<p><strong>Geography<\/strong><br \/>\nLucknow is located in the heart of the Northern Plains and is drained by the Gomti River, which divides it into Trans-Gomti and Cis-Gomti regions. Lucknow is flanked by Rai Bareilly district in the south, Barabanki district in the east, Sitapur and Hardoi districts in the north and Unnao district in the west. Lucknow is located in seismic zone III.<\/p>\n<p><strong>Climate<\/strong><br \/>\nThe city experiences hot sub-tropical climate with high level of humidity. Winter here is dry extending from November to February while summer extends from April to June. Monsoon extends from mid-June to mid-September with an average rainfall of 1,010 mm. The south-west monsoon winds are mainly responsible for the rains in Lucknow. In winter, the maximum temperature can hover around 21 degree Celsius while the summer temperature can rise up to 45 degree Celsius.<\/p>\n<p><strong>Economy\/Industries<\/strong><\/p>\n<p><strong>Public sector undertakings<\/strong><br \/>\nLucknow is the headquarters of the Small Industries Development Bank of India (SIDBI) and Pradeshiya Industrial and Investment Corporation of Uttar Pradesh (PICUP). Confederation of Indian Industry (CII) and Entrepreneurship Development Institute of India (EDII) also have their presence in Lucknow.<\/p>\n<p>Information Technology: Big IT firms like Tata Consultancy Services and IBM have their presence here.<\/p>\n<p>Manufacturing units like Hindustan Aeronautics Limited, Eveready Industries, and Tata Motors.<\/p>\n<p>Processing industries like milk production, steel-rolling, LPG bottling.<\/p>\n<p><strong>Real estate<\/strong><\/p>\n<ul>\n<li>Hookah tobacco paste.<\/li>\n<li><\/li>\n<li>Agriculture like sugarcane growing. Sugar industries are located close to the sugarcane plantations.<\/li>\n<li>Unique embroidery like Chikan and Lakhnavi Zardosi.<\/li>\n<li>Kite-making, fragrance called attar, handicrafts like pottery, earthen toys, and bone carving products.<\/li>\n<li>Coaching for competitive examinations.<\/li>\n<li>Banking like the Reserve Bank of India, Citibank, ABN-AMRO and others.<\/li>\n<li>Oil companies like Indian Oil Corporation, Hindustan Petroleum, Bharat Petroleum and others.<\/li>\n<\/ul>\n<p><strong>Biotechnology<\/strong><\/p>\n<ul>\n<li>Insurance<\/li>\n<li>Attractions of Lucknow<\/li>\n<li>Chhota Imambara<\/li>\n<li>Bara Imambara (or Asafi Imambara)<\/li>\n<li>Roomi Darwaza<\/li>\n<li>Husainabad Clock Tower<\/li>\n<li>Residency<\/li>\n<li>Shah Najaf<\/li>\n<li>Bhul Bhulaiya<\/li>\n<li>Chatter Manzil<\/li>\n<li>State Museum<\/li>\n<li>Shaheed Smarak<\/li>\n<li>Ambedkar Memorial<\/li>\n<li>Planetarium<\/li>\n<li>Lucknow Zoo<\/li>\n<li>Ramakrishna Math<\/li>\n<li>Vidhan Sabha building<\/li>\n<li>Charbagh railway station<\/li>\n<\/ul>\n<p><strong>St Joseph’s Cathedral<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2044\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg\" alt=\"St Joseph’s Cathedral, Lucknow\" width=\"700\" height=\"498\" \/><br \/>\nA building built in the British Baroque style Parks like Ambedkar Memorial, Lohia Park, Swarna Jayanti Park, Begum Hazrat Mahal Park, Globe Park, Haathi Park, Nimbu Park, and National Botanical Garden at Sikandar Bagh Picnic spots like Kukrail Crocodile Park, Musa Bagh and Utretia Excursions to Katarina Ghat, Dudhwa National Park, Nawabganj Bird Sanctuary and Samaspur Bird Sanctuary can also be made from Lucknow.<\/p>\n<p><strong>Culture<\/strong><\/p>\n<p>Lucknow is famous for its age-old Shiite culture. Mir Anis and Mirza Dabeer, both poets, became great advocates of a unique genre of Shia poetry called Marsia based on Imam Hussain’s sacrifice in the Battle of Karbala.<\/p>\n<p><strong>Cuisine<\/strong><\/p>\n<p>Biryanis, Naans and kebabs including, Kakori Kebabs, Galawati Kebabs, Tundey Kebabs, Shami Kebabs, Boti Kebabs, Patili-ke-Kebabs, Ghutwa Kabab and Seekh Kebabs, Makhan malai, Chaat, Rewari, paan, kofta, raita, samosa among others.<\/p>\n<h4><strong>How to Reach Lucknow<\/strong><\/h4>\n<p><strong>By Air: <\/strong>Lucknow is served by the Amausi International Airport, located about 20 km from the heart of the city. Besides domestic airlines, several international carriers operate from Lucknow. Special flights operate from Lucknow during the time of Haj.<\/p>\n<p><strong>By Rail:<\/strong> Charbagh railway station is the main railhead of Lucknow, which is also served by various other railway stations (thirteen of them to be precise). Lucknow is a major stop on the rail route connecting various cities of northern India with east, west and central zones.<\/p>\n<p><strong>By Road:<\/strong> Lucknow is connected to New  Gaya Bihar via National Highway-24, Shivpuri near Jhansi (via NH-25), Varanasi (via NH-56) and Mokama (via NH-28). Important bus stations are located at Alambagh and Qaiser Bagh.<\/p>\n<p><strong>City Transport<\/strong><\/p>\n<p>Buses, taxis, auto and cycle rickshaws are the major modes of transportation in the city of Lucknow. Lucknow Mahanagar Parivahan Sewa operates the city bus service.<\/p>\n<p><strong>Sister Cities of Lucknow<\/strong><\/p>\n<ul>\n<li>Montreal, Canada<\/li>\n<li>Brisbane, Australia<\/li>\n<li>Facts about Lucknow<\/li>\n<li>Governance of city<\/li>\n<li>Lucknow Municipal Corporation<\/li>\n<li>Law and order<\/li>\n<li>District Collector<\/li>\n<\/ul>\n<p><strong>Police<\/strong><\/p>\n<p>Lucknow Police. Traffic Police is a semi-autonomous body under the Lucknow Police.<\/p>\n<p><strong>Parliamentary Constituencies<\/strong><\/p>\n<p>Two constituencies, namely, Lucknow and Mohanlalganj<\/p>\n<p><strong>Markets<\/strong><\/p>\n<p>Aminabad, Alambagh, Kapoorthala, Nishatganj, Indiranagar, Mahanagar, Hazratganj area is an upscale shopping market with colonial- style buildings.<\/p>\n<p><strong>Movie Hall\/Entertainment<\/strong><\/p>\n<p>East End Mall, Saharaganj, Zee Mall<\/p>\n<p><strong>Urban planning<\/strong><\/p>\n<p>Lucknow Development Authority<\/p>\n<p><strong>Court<\/strong><\/p>\n<p>Lucknow has a permanent bench at the Allahabad High Court<\/p>\n<p><strong>Sex ratio<\/strong><\/p>\n<p>827 females for every 1,000 males<\/p>\n<p><strong>Literacy rate<\/strong><\/p>\n<p>69 per cent<\/p>\n<p><strong>Industrial enclaves<\/strong><\/p>\n<p>Chinhat, Aishbagh, Talkatora, Amousi<\/p>\n<p><strong>People<\/strong><\/p>\n<p>Mostly from eastern Uttar Pradesh along with distribution of Bengalis, Anglo-Indians and South Indians<\/p>\n<p><strong>Religion<\/strong><\/p>\n<p>Hinduism, Islam, Sikhism, Jainism, Christianity, Buddhism<\/p>\n<p><strong>Language<\/strong><\/p>\n<p>Urdu, Hindi, English<\/p>\n<p><strong>Dance<\/strong><\/p>\n<p>Kathak Patronized by the Nawabs<\/p>\n<p><strong>Music<\/strong><\/p>\n<p>lucknow Bhatkhande Music University named after the great musician Pandit Vishnu Narayan Bhatkhande is a world-famous music institute; Bhartendu Academy of Dramatic Arts or Bhartendu Natya Academy, is a deemed university; Lokrang Sanskritik Samiti working on folk songs<\/p>\n<p><strong>Film<\/strong><\/p>\n<p>Lucknow traditionally has had impacted Bollywood’s films by various means, be it shooting, scriptwriting or story background. Famous films like Umrao Jaan, Pakeeza, Shatranj Ke Khiladi, and Junoon have been shot against the backdrop of Lucknow. Some of the most noted scriptwriters and lyricists of the Hindi movie industry hail from this region, including: Kaifi Azmi, Javed Akhtar, Majrooh Sultanpuri, B C Verma.<\/p>\n<p><strong>Radio channels<\/strong><\/p>\n<p>Radio Mirchi 98.3 MHz, Radio City 91.1 MHz, Red FM 93.5 MHz, AIR FM Rainbow 100.7 MHz, Gyan Vani 105.6 MHz<\/p>\n<p><strong>Newspapers<\/strong><\/p>\n<p>Times of India, Hindustan Times, The Pioneer, and Indian Express (English), Swatantra Bharat, Amar Ujala, Jansatta, Rashtriya Sahara (Hindi), Jayeza daily, Sahafat, aag, Qaumi Khabrein (Urdu).<\/p>\n<p><strong>Educational Institutes<\/strong><\/p>\n<p>IIM Lucknow, St Francis College, Colvin Taluqdars College Christ Church College, University of Lucknow,  Babasaheb Bhimrao Ambedkar University, Chhatrapati Shahu ji Maharaj Medical University Saroj Engineering College, Shri Ramswaroop Engineering College, GICET, NIEC, Sherwood Engineering College and others.<\/p>\n<p><strong>Research Institutes<\/strong><\/p>\n<p>National Botanic Research Institute, Central Drug Research Institute, Indian Institute of Toxicology Research , Central Institute of Medicinal and Aromatic Plants.<\/p>\n<p><strong>Hospitals<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2045\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Sahara-Hospital-Lucknow.jpg\" alt=\"Sahara Hospital, Lucknow\" width=\"700\" height=\"481\" \/><br \/>\nSahara Hospital, Apollo Hospital.<\/p>\n<p><strong>Sports<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2047\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/football-Lucknow.jpg\" alt=\"Football, Lucknow\" width=\"700\" height=\"448\" \/><br \/>\nCricket, football, badminton, hockey, golf are some of the popular sports of Lucknow. The city hosted the prestigious Sheesh Mahal Cricket Tournament for some time. Gulli Danda is also a favourite sport among the local youths. K D Singh Babu Stadium, Lucknow Golf Club is some of the major sports complex in Lucknow. Charbagh, Mahanagar also have sports stadia.<\/p>\n<p><strong>Sports personalities<\/strong><\/p>\n<p>Mohammad Kaif, Suresh Raina, Piyush Chawla, Rudra Pratap Singh (cricket), K D Singh (hockey), Ghaus Mohammad Khan (tennis).<\/p>\n<p><strong>Other noted personalities<\/strong><\/p>\n<p>Manikonda Chalapathi Rau (journalist), Vinod Mehta (businessman), Talat Mahmood (singer), Shantanu Moitra, Naushad (composer), Atal Bihari Vajpayee (former Prime Minister of India), Shankar Dayal Sharma (former President of India).<\/p>\n<p><strong>Accommodation<\/strong><\/p>\n<ul>\n<li>Comfort Inn Lucknow<\/li>\n<li>Hotel Arif Castles<\/li>\n<li>Hotel Clarks Avadh<\/li>\n<li>Hotel Europe Palace<\/li>\n<li>Hotel Gemini Continental<\/li>\n<li>Hotel Manglam<\/li>\n<li>Hotel Mera Mann<\/li>\n<li>Hotel Mohan<\/li>\n<li>Hotel Simla Palace<\/li>\n<li>La Place Park Inn<\/li>\n<li>Piccadily Hotel<\/li>\n<li>Taj Residency<\/li>\n<li>Tulip Inn<\/li>\n<li>Hotel Mezban<\/li>\n<li>Hotel Deep Avadh<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Country: India State: Uttar Pradesh District: Lucknow Area: 2,528 square kilometres (metro) Elevation: 128 m Population: 3 million Pin code: 226 Telephone Code: 0522 Time Zone: GMT plus 5:30 Lucknow (also known by the names of City of the Nawabs or the Golden City of the East, Shiraz-i-Hind, Constantinople of India), is the capital of Uttar Pradesh, the most populous [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5710,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[53],"tags":[],"class_list":["post-2041","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uttar-pradesh"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Lucknow Travel Guide – Things to do &amp; Sightseeing in Lucknow<\/title>\n<meta name=\"description\" content=\"Lucknow known as the City of Nawabs &amp; capital of Uttar Pradesh &amp; 2nd largest city of UP. Get detailed information about Lucknow tourism and travel guide.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Lucknow Travel Guide – Things to do &amp; Sightseeing in Lucknow\" \/>\n<meta property=\"og:description\" content=\"Lucknow known as the City of Nawabs &amp; capital of Uttar Pradesh &amp; 2nd largest city of UP. Get detailed information about Lucknow tourism and travel guide.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-05-03T12:57:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-26T11:41:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"700\" \/>\n\t<meta property=\"og:image:height\" content=\"498\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Lucknow: The Royal City\",\"datePublished\":\"2017-05-03T12:57:25+00:00\",\"dateModified\":\"2022-02-26T11:41:40+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/\"},\"wordCount\":1794,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg\",\"articleSection\":[\"Uttar Pradesh\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/\",\"name\":\"Lucknow Travel Guide – Things to do & Sightseeing in Lucknow\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg\",\"datePublished\":\"2017-05-03T12:57:25+00:00\",\"dateModified\":\"2022-02-26T11:41:40+00:00\",\"description\":\"Lucknow known as the City of Nawabs & capital of Uttar Pradesh & 2nd largest city of UP. Get detailed information about Lucknow tourism and travel guide.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg\",\"width\":700,\"height\":498,\"caption\":\"St-Joseph’s-Cathedral-Lucknow\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Lucknow: The Royal City\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Lucknow Travel Guide – Things to do & Sightseeing in Lucknow","description":"Lucknow known as the City of Nawabs & capital of Uttar Pradesh & 2nd largest city of UP. Get detailed information about Lucknow tourism and travel guide.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/","og_locale":"en_US","og_type":"article","og_title":"Lucknow Travel Guide – Things to do & Sightseeing in Lucknow","og_description":"Lucknow known as the City of Nawabs & capital of Uttar Pradesh & 2nd largest city of UP. Get detailed information about Lucknow tourism and travel guide.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2017-05-03T12:57:25+00:00","article_modified_time":"2022-02-26T11:41:40+00:00","og_image":[{"width":700,"height":498,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Lucknow: The Royal City","datePublished":"2017-05-03T12:57:25+00:00","dateModified":"2022-02-26T11:41:40+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/"},"wordCount":1794,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg","articleSection":["Uttar Pradesh"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/","name":"Lucknow Travel Guide – Things to do & Sightseeing in Lucknow","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg","datePublished":"2017-05-03T12:57:25+00:00","dateModified":"2022-02-26T11:41:40+00:00","description":"Lucknow known as the City of Nawabs & capital of Uttar Pradesh & 2nd largest city of UP. Get detailed information about Lucknow tourism and travel guide.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/St-Joseph’s-Cathedral-Lucknow.jpg","width":700,"height":498,"caption":"St-Joseph’s-Cathedral-Lucknow"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/lucknow\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Lucknow: The Royal City"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/2041","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=2041"}],"version-history":[{"count":4,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/2041\/revisions"}],"predecessor-version":[{"id":7619,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/2041\/revisions\/7619"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5710"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=2041"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=2041"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=2041"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}