{"id":3713,"date":"2018-11-16T06:30:00","date_gmt":"2018-11-16T06:30:00","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=3713"},"modified":"2023-07-19T05:14:28","modified_gmt":"2023-07-19T05:14:28","slug":"places-to-visit-in-chennai","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/","title":{"rendered":"Best Places to Visit in Chennai"},"content":{"rendered":"<p>Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel attractions in Chennai. Since this city has been my home for the last two decades, I could easily list the places of interest in Chennai.<\/p>\n<p>The city has many travel attractions in the form of beaches, open parks and many theme parks. Vedanthangal bird sanctuary is located at around 80 km from Chennai. Vandalur Zoological Park is one of the best maintained parks that houses a large number of animal species. The city also boasts of a couple of forests, Guindy national park and the Nanmangalam reserve forest.<\/p>\n<p>Marina, Elliots, Uthandi and Thiruvanmiyur are some of the well known beaches in Chennai. The city is a busy metropolis with a young working class mushrooming the roads in the peak hour traffic. The city is known for its busy shopping activities in the T Nagar area. People from all over India and abroad throng the busy streets of T Nagar for shopping.<\/p>\n<p>This city has a strong linkage to the colonial past as it was developed mainly during the British era. Many of the old buildings constructed during the British regime stands today as a reminder of the distant past. This city has a long rainy season that starts from June and goes on till December. The copious rains and the beautiful beaches must have attracted the British.<\/p>\n<p>There are plenty of good hotels like Taj Connemara, Taj Fisherman&#8217;s Cove, Hyatt, Hilton and Residency Towers.<\/p>\n<h3><strong>Vandalur Zoo in Chennai<\/strong><\/h3>\n<p>Arignar Anna Zoological Park is a Zoological garden located in Vandalur spread over 602 hectares. Since it is located on the outskirts, it can be reached within an hour&#8217;s drive from the heart of city.<\/p>\n<p>Though the Vandalur zoo was opened on 1985, it did not have a good green cover initially. I remember visiting Vandalur Zoo long back and it was a bit of struggle spending time there in the hot conditions without adequate tree cover. If I was not able to cope up with the heat, imagine the plight of poor animals. But things have changed for the better since then.<\/p>\n<p>I have visited Vandalur zoo several times in the last ten years and it is a green oasis in the middle of the city. The place resembles a dense jungle and I feel that the animals look lot more healthy now compared to earlier times. I like visiting the park in the first half of the day as the heat will build up in the second half. There is a restaurant run by TTDC (Tamil Nadu tourism development corporation) and we get mostly south Indian food only.<\/p>\n<p>Whenever I visit, I like to take the tour of the park in a battery-operated vehicle and also go on a lion safari. It would take a full day to cover the park by walk. But being on our foot for that long could be a bit strenuous and I opt for the tour on a battery operated vehicle. Other than the lions elephants and tigers, the park boasts of a very diverse animal population that includes zebras, giraffe, white tiger (shown in picture), bison, hippopotamus and many more.<\/p>\n<p>I like this zoological park primarily because they have taken maximum care to create a natural ambiance for the animals. The wild animals are housed in large enough areas for them not to feel caged. The image shown above was shot by me during one of my visit and I am glad that this almost looked like a good wildlife photography.<\/p>\n<h3><strong>Vedanthangal Bird Sanctuary<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-3717\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg\" alt=\"Vedanthangal Bird Sanctuary\" width=\"900\" height=\"500\" \/><\/p>\n<p>Vedanthangal bird sanctuary is a protected area located in Chennai-Trichy highway shortly after Chengalpattu. It takes about ninety minutes of drive to reach Vedanthangal from Chennai. The major part of the drive is on the national highway but the last stretch is on a narrow village road. Since the village road is well maintained, driving through the countryside is a pleasurable experience.<\/p>\n<p>The sanctuary is a very small one and the walking area provided for tourists is also very short. There is good car parking space available and the place can be reached by buses too. There are no major restaurants here and so one should plan the breakfast or lunch stopover on the way. We get stuff like tender coconuts, snacks and ice cream in the stalls located near the entrance. Some of the stalls disappear on less crowded days.<\/p>\n<p>This is a seasonal spot as it can be visited only between November and February. The monsoon rains need to fill the lake here and then only the migratory birds will flock in thousands. If there is a severe monsoon failure that leaves the lake dry, then the migratory birds would not visit here. I wonder how these birds get the information about whether the lake is full or not. Do they check internet or get a mobile update?<\/p>\n<p>As I understand, the water in the lake serves two purposes. One, it serves as good source of food for the visiting birds with a large fish population. Two, it also offers the much needed protection to the birds during their nesting season by submerging the trees and keeping the predatory animals like wild cats at bay.<\/p>\n<p>I am not so much into bird watching but what drives me here is my love for nature. I understand there are many bird species like pelicans, herons, cranes and storks. I cannot differentiate one from the other. But I love watching the beauty of this winged creature. I would advise the bird watching enthusiasts to carry a telescope or a pair of binoculars as there are very many viewpoints available to get a closer look of birds.<\/p>\n<h3><strong>Marina Beach in Chennai<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-3715\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Marina-Beach-Chennai.jpg\" alt=\"Marina Beach, Chennai\" width=\"900\" height=\"500\" \/><\/p>\n<p>Chennai prides itself by having some of the best beaches. Marina is the city&#8217;s most popular beach. It is located closer to the heart of city in the areas of Triplicane and Santhome. Marina beach is heavily crowded during the evenings. It is a favorite place for the morning walkers. The walkers start thronging the place as early as 5.00 AM and this is the first sign that the city is gearing up for a new day.<\/p>\n<p>In the evenings, the road abetting the beach has heavy traffic but the beach offers solace to the residents from the heat during the day. Sea breeze would set in usually by afternoon and so the beaches are pleasant in the early evening even on hot summer days. The waves are high and there are plenty of people who stand by the shore to cool their heels against the crashing waves.<\/p>\n<p>Taking bath in the sea is not allowed in any of the other beaches in Chennai. The Bay of Bengal sea has an unpredictable nature with strong underwater currents. This current could drown some of the best swimmers at times. So I would advise anyone to refrain from swimming in the Chennai Sea as safety is of paramount importance.<\/p>\n<p>I love the walks in the evenings having an ice cream or a snack like noodles. The Chilli Bajji (Milagai Bajji as it is known in Tamil) and the fish fry are two special attractions of Marina beach and you would find many stalls selling such items. Marina beach also boasts of a large area for parking cars and two wheelers. It is well connected by buses and metro rail.<\/p>\n<p>Elliots beach in Besant Nagar is another popular place which is also very crowded these days. The crowd is usually younger here compared to Marina. There are also beaches in Thiruanmiyur and Uthandi. The one at Uthandi is one of the least crowded. The picture shown above was taken at Thiruvanmiyur beach during a rainy day.<\/p>\n<h3><strong>Guindy National Park, Chennai<\/strong><\/h3>\n<p>Guindy national park is one of the smallest national park of India. The small size of the park is understandable as it is located right in the middle of Chennai city. The Guindy national park is located in and around IIT, Raj Bhavan (the Governor&#8217;s abode) and the children&#8217;s park. Since it is a protected area, the public may not be able to access the restricted areas of the park. However, the children&#8217;s park located on the northern side of the park is open to public.<\/p>\n<p>The children&#8217;s park and the adjoining snake park let people to have a look at the park from the periphery. Despite its small size, the place looks noticeably more pleasant and cooler than the rest of the city. The drop in temperature inside the park is around 5 degree Celsius as compared to rest of the city. This is what good greenery and nature can help achieve. I wish we have retained nature the same way in other places as well.<\/p>\n<p>The main attraction of the park is the presence of a large number of deer in the main forest area. Some of the deer stray often into neighboring areas and can be easily spotted around IIT, Children&#8217;s park or even Guindy Engineering College. When I spotted the deer for the first time in this area, I was really surprised that mankind has allowed such a beautiful animal to thrive in the middle of a city in natural setting.<\/p>\n<p>The Children&#8217;s park can be visited anytime between 9 AM and 6 PM. It has a large children&#8217;s play area and has a reasonably good number of animals and birds. But we do not get to see the big cats here. There is a dense tree cover inside and so I always find this place very pleasant irrespective of how the rest of city feels.<\/p>\n<p>Snake Park is open to public from 9 AM to 5.30 PM. The staff there sometimes gives useful lectures and demonstrations to children and general public. There is one fact that I have learnt there I would not forget for a long time. Only about ten percent of the snakes that we see outside are venomous. So next time when you see a snake, you do not have to run if you know whether it belongs to the 90% side or 10% side.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel attractions in Chennai. Since this city has been my home for the last two decades, I could easily list the places of interest in Chennai. The city has many travel attractions in the form of beaches, open parks and many [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5814,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[27],"tags":[],"class_list":["post-3713","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-tamil-nadu"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Best Tourist Places to Visit in Chennai - Attractions<\/title>\n<meta name=\"description\" content=\"Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel places in Chennai. Click here to read the article.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Best Tourist Places to Visit in Chennai - Attractions\" \/>\n<meta property=\"og:description\" content=\"Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel places in Chennai. Click here to read the article.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-11-16T06:30:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-19T05:14:28+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"900\" \/>\n\t<meta property=\"og:image:height\" content=\"500\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Best Places to Visit in Chennai\",\"datePublished\":\"2018-11-16T06:30:00+00:00\",\"dateModified\":\"2023-07-19T05:14:28+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/\"},\"wordCount\":1695,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg\",\"articleSection\":[\"Tamil Nadu\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/\",\"name\":\"Best Tourist Places to Visit in Chennai - Attractions\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg\",\"datePublished\":\"2018-11-16T06:30:00+00:00\",\"dateModified\":\"2023-07-19T05:14:28+00:00\",\"description\":\"Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel places in Chennai. Click here to read the article.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg\",\"width\":900,\"height\":500,\"caption\":\"Vedanthangal-Bird-Sanctuary\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Best Places to Visit in Chennai\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Best Tourist Places to Visit in Chennai - Attractions","description":"Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel places in Chennai. Click here to read the article.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/","og_locale":"en_US","og_type":"article","og_title":"Best Tourist Places to Visit in Chennai - Attractions","og_description":"Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel places in Chennai. Click here to read the article.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2018-11-16T06:30:00+00:00","article_modified_time":"2023-07-19T05:14:28+00:00","og_image":[{"width":900,"height":500,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Best Places to Visit in Chennai","datePublished":"2018-11-16T06:30:00+00:00","dateModified":"2023-07-19T05:14:28+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/"},"wordCount":1695,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg","articleSection":["Tamil Nadu"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/","name":"Best Tourist Places to Visit in Chennai - Attractions","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg","datePublished":"2018-11-16T06:30:00+00:00","dateModified":"2023-07-19T05:14:28+00:00","description":"Chennai is the capital city of Tamil Nadu state in India and this lens would briefly touch upon the travel places in Chennai. Click here to read the article.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Vedanthangal-Bird-Sanctuary.jpg","width":900,"height":500,"caption":"Vedanthangal-Bird-Sanctuary"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/places-to-visit-in-chennai\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Best Places to Visit in Chennai"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/3713","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=3713"}],"version-history":[{"count":7,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/3713\/revisions"}],"predecessor-version":[{"id":8408,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/3713\/revisions\/8408"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5814"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=3713"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=3713"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=3713"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}