{"id":3803,"date":"2019-02-01T05:29:06","date_gmt":"2019-02-01T05:29:06","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=3803"},"modified":"2023-10-03T07:38:52","modified_gmt":"2023-10-03T07:38:52","slug":"maharajas-palace-hotels-in-india","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/","title":{"rendered":"List of Maharaja’s Palace Hotels in India"},"content":{"rendered":"<p><strong>Majestic Hotels and Stunning Vacation Destination in India<\/strong><\/p>\n<p>It would take many months of traveling to comprehensively explore India, but it is also possible to get a good insight into some of the history and culture in just two weeks tour of northern India, visiting some of the popular and famous attractions. There are many stunningly extravagant palaces which have been converted into luxury hotels which are interesting to visit in their own right, but make splendid places to stay while touring.<\/p>\n<p>This article is about my travel recommendations and hotel reviews for northern India, from my experiences of vacations and business in India, with particular emphasis on some of the fantastic maharaja’s palaces that are now some of the best hotels in the world. Many of these are in Rajasthan; Jaipur, Udaipur, Deogarh and New  Gaya Bihar and Agra.<\/p>\n<h3><strong>Hotels in India<\/strong><\/h3>\n<p><strong>Where to Stay in India<\/strong><br \/>\nI generally don’t find expensive hotels very interesting. They can be very pleasant places to stay, with efficient service, or convenient places from which to do business, but so rarely have real style or character of their own, soon my vacations I would often rather stay in a hut in a jungle than a typical luxury hotel. Some hotels in India, however, are very special and interesting places to visit or stay at, often converted from restored Maharajas’ palaces and other grand buildings. Here is a review of some of my favourite hotels that I have stayed at or visited during two holidays and a business trip in India.<\/p>\n<p><strong>1. Shahpura House Hotel, Jaipur – “The Pink City”<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" src=\"\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg\" alt=\"Shahpura House Jaipur\" width=\"750\" height=\"450\" class=\"alignnone size-full wp-image-8730\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg 750w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur-300x180.jpg 300w\" sizes=\"auto, (max-width: 750px) 100vw, 750px\" \/><br \/>\nJaipur, the capital of Rajasthan, has many beautiful historic building, some of which have been converted into fantastic hotels. We arrived in Jaipur by train, in a second class air-conditioned carriage, which was tolerable and on arrival there was absolutely torrential rain. We got soaked while trying to fight off the porters and find a taxi to our hotel. The Jai Mahal Palace and Raj Mahal Palace hotels are incredibly interesting, unique and grand destinations, however, unfortunately, we found accommodation at the Shahpura House hotel, which had been recommended by the travel agent who booked this tailor-made trip. The Shahpura House hotel is not a good recommended palace Hotels that I referred to; the restaurant here was horrible, there was no bar available and no alcohol was served inside the hotel and the reception staff seem to be running an expensive taxi “service” (i.e. scam) with the local taxi firms. The bedroom was O.K. but we wished that we had booked one of the palace hotels.<\/p>\n<p>The weather was so bad that we decided to explore the wonderful hotels by taxi, ordered from our hotel reception. First we went to the Raj Mahal hotel, a splendid old building, built around 1850, for an aperitif and dinner. Drinks were served in the library, then dinner in the dining room. This was an extremely pleasant and relaxing place to spend an evening, with a good restaurant and would probably make a wonderful base from which to explore the beautiful city.<\/p>\n<p>The most famous tourist attraction in Jaipur is the Amer Fort, which we visited while it was still raining heavily, so we hired driver and car for Rs 850 or about £10 and drove to Amer not far from Jaipur, where we chartered an elephant for Rs 500, for the ride up the hill to the fort at the top. Amer Fort is beautiful and impressive, but particularly photogenic because of the rows of elephants awaiting tourists. On the day we were there they were covered with sheets of polythene like enormous raincoats. Apparently, elephants are not waterproof. We walked back down the hill past the ascending elephants in search of some lunch.<\/p>\n<p><strong>2. Hilton Trident Hotel, Jaipur<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" src=\"\/blog\/wp-content\/uploads\/2023\/10\/Hilton-Jaipur.jpg\" alt=\"Hilton Jaipur\" width=\"750\" height=\"450\" class=\"alignnone size-full wp-image-8713\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Hilton-Jaipur.jpg 750w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Hilton-Jaipur-300x180.jpg 300w\" sizes=\"auto, (max-width: 750px) 100vw, 750px\" \/><br \/>\nWe went to the Hilton Trident Hotel for Lunch (Rs 1400) near the fort and opposite the beautiful Jal Mahal Water Palace. A stunning and famous view, but a fairly boring hotel compared to many we had seen. Clean and pleasant, but with an international “Hilton” feel about it, although a good place to go for a meal if you want some “Continental” food. Probably a good place for Americans or less adventurous tourists to stay, or a place to escape if you have had too much culture.<\/p>\n<p>We drove to Jaipur centre to explore the City Palace and Hawa Mahal, which are impressive, but after seeing so many palaces they perhaps seemed a little less interesting than even some of the hotels.<\/p>\n<p><strong>3. Jai Mahal Palace Hotel, Jaipur<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" src=\"\/blog\/wp-content\/uploads\/2023\/10\/Jai-Mahal-Palace-Jaipur.jpg\" alt=\"Jai Mahal Palace Jaipur\" width=\"750\" height=\"450\" class=\"alignnone size-full wp-image-8718\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Jai-Mahal-Palace-Jaipur.jpg 750w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Jai-Mahal-Palace-Jaipur-300x180.jpg 300w\" sizes=\"auto, (max-width: 750px) 100vw, 750px\" \/><br \/>\nWe continued our exploration of hotels with the Jai Mahal Palace, a splendid old colonial building with beautiful manicured gardens, converted into an hotel. We were again caught out by the hotel taxi scam and despite the short distance paid Rs 180 or £2, when it should have been about Rs 50. Not that this was going to break the bank, but it is annoying to be taken advantage of. The drinks at the hotel however were quite reasonably priced for such a majestic setting, with an Indian gin and tonic and an Indian red wine in the bar costing just £6 although 34.5% extra tax would have been added if it were imported booze. It again cost Rs 200 and everyone was ripping us off by now, but who cares?<\/p>\n<p>The following day the rain had stopped, so we hired a Tuc-Tuc for a few hours to explore some of the other tourist attractions. The Central Museum was the usual rubbish: badly restored objects d’arte, miniature paintings etc. It was worth visiting, but not for a long time, so we continued to the Zoo and saw tigers at last (we didn’t see any on our “Tiger Safari” in Ranthambore National Park). It is not a great zoo, with very few animals in fairly poor enclosures. It is very sad to see these wonderful creatures confined like that. We were followed by various admirers who wanted to speak to us or take photos with us.<\/p>\n<p><strong>4. Rambagh Palace, Jaipur<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-3807\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Rambagh-Palace-Jaipur.jpg\" alt=\"Rambagh Palace, Jaipur\" width=\"700\" height=\"409\" \/><br \/>\nWe went to Rambagh Palace, built by Maharaja Ram Singh II as a hunting lodge and now an hotel, for lunch, and then, because it was so good returned again in the evening. There is a wonderful dining room with chandeliers and high ceilings. Lunch for two cost £40 and was delicious, with a wide variety of dishes. We later had tea next to the croquet lawn, until the mosquitoes started biting then went into “The Polo Bar” for refuge. Dinner inside the huge grand dining room was slightly disappointing, but only because lunch had been so good. This, unfortunately, was a buffet, with lots of people attending, which detracted from the formal splendor of the place. We took the Tuc-Tuc back and paid the driver £7 for the 5 hours he waited, which was probably far too much. He seemed happy though, and so were we.<\/p>\n<p><strong>5. Deogarh Mahal Hotel, Deogarh<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-3808\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Deogarh-Mahal-Hotel-Deogarh.jpg\" alt=\"Deogarh Mahal Hotel, Deogarh\" width=\"700\" height=\"453\" \/><br \/>\nWe continued our journey to Udaipur by road, stopping off at Deogarh, which is a small town with just one hotel, but well worth visiting. The journey was fairly scary with terrible road conditions, Lorries traveling towards us on the wrong side of the road and lots of cows with very little road sense. Seat belts in the car would have been reassuring. We stopped for tea at a very grubby service station.<\/p>\n<p>We stayed at the Deogarh Mahal hotel, another converted palace at the top of the hill built in the 1670. Extremely pleasant and again an hotel that is interesting in its own right. Lunch was served outside on a roof-terrace or the courtyard, drinks on another terrace and dinner on yet another roof terrace all with wonderful views. Dinner was very good Indian thali, about 12 dishes served in little metal bowls.<\/p>\n<p><strong>6. Shiv Niwas Palace, Udaipur<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-3809\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Shiv-Niwas-Palace-Udaipur.jpg\" alt=\"Shiv Niwas Palace, Udaipur\" width=\"700\" height=\"422\" \/><br \/>\nWe stayed at the Shiv Niwas Palace, a beautiful old building which is actually part of the city palace. We had a glorious view over the lake across to another palace from our huge terrace and balcony, and each evening as the sun went down and the air cooled we were treated to a hysterical display in the trees opposite. Mother monkeys brought their offspring for training in this relatively safe location allowing them fifteen minutes of swinging and general naughtiness before heading home. The Shiv Niwas Palace hotel has a pool in one of the courtyards with tables at which lunch, dinner and drinks can be served, which is very pleasant although not as good as the view we had from our room’s multiple terraces.<\/p>\n<p>Udaipur is a wonderful place just to wander around on foot or by Tuc-Tuc. There is a museum in the palace and a classic car collection near-by, “The Royal Cars”, including some Mercedes, Rolls Royces two jeep\/safari Rolls Royce hybrids and various other American and British cars from 1920′s to about 1960′s. There is also another substandard Zoo. Nothing too exciting, but an enjoyable relaxing place to visit.<\/p>\n<p><strong>7. The Taj View Hotel, Agra<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-3810\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/The-Taj-View-Hotel-Agra.jpg\" alt=\"The Taj View Hotel, Agra\" width=\"700\" height=\"435\" \/><br \/>\nIn Agra we stayed in the Taj View Hotel, which only really had one positive attribute, which was that we really could see the Taj Mahal from the bedroom. Just Through the smog, The Taj Mahal was visible, peeking out from behind some less attractive buildings.<\/p>\n<p><strong>New  Gaya Bihar<\/strong><\/p>\n<p> Gaya Bihar is an interesting city with fascinating history and some wonderful purpose-built hotels. While not as historically interesting as some of the Marharajas’ palaces, there are some impressive art deco hotels. My two favorite hotels in  Gaya Bihar are the Imperial, which I stayed at on a holiday and the Oberoi which I used when I was working in Noida.<\/p>\n<p>The Imperial Hotel is a very grand art deco building with luxurious rooms a beautiful interior, a few expensive boutiques an excellent bar and a selection of restaurants, from “continental” style to Asian or Indian. The “1911″ restaurant is a good place to step back in time and enjoy beautiful surroundings and good food or just a drink. For dinner, in the “continental” style restaurant, I had the very un-Indian “Foie Gras Lasagne” starter followed by Guinea Fowl and pigs trotter stew, which was extremely good. The Oberoi Hotel is even more luxurious and expensive with a similar selection of restaurants and bars. Claridges Hotel is also worth a visit for a luxurious spot of tiffin or dinner in the excellent Indian restaurant.<\/p>\n<p><strong>Summary:<\/strong> Some of the most interesting hotels in the world<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Majestic Hotels and Stunning Vacation Destination in India It would take many months of traveling to comprehensively explore India, but it is also possible to get a good insight into some of the history and culture in just two weeks tour of northern India, visiting some of the popular and famous attractions. There are many stunningly extravagant palaces which have [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":8730,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[93],"tags":[],"class_list":["post-3803","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-hotels"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>List of Maharaja’s Palace Hotels in India - Luxury Hotels<\/title>\n<meta name=\"description\" content=\"List of Maharaja’s Palace Hotels in India - Luxury Hotels\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"List of Maharaja’s Palace Hotels in India - Luxury Hotels\" \/>\n<meta property=\"og:description\" content=\"List of Maharaja’s Palace Hotels in India - Luxury Hotels\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-02-01T05:29:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-10-03T07:38:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"450\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"List of Maharaja’s Palace Hotels in India\",\"datePublished\":\"2019-02-01T05:29:06+00:00\",\"dateModified\":\"2023-10-03T07:38:52+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/\"},\"wordCount\":1742,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg\",\"articleSection\":[\"Hotels\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/\",\"name\":\"List of Maharaja’s Palace Hotels in India - Luxury Hotels\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg\",\"datePublished\":\"2019-02-01T05:29:06+00:00\",\"dateModified\":\"2023-10-03T07:38:52+00:00\",\"description\":\"List of Maharaja’s Palace Hotels in India - Luxury Hotels\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg\",\"width\":750,\"height\":450,\"caption\":\"Shahpura House Jaipur\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"List of Maharaja’s Palace Hotels in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"List of Maharaja’s Palace Hotels in India - Luxury Hotels","description":"List of Maharaja’s Palace Hotels in India - Luxury Hotels","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/","og_locale":"en_US","og_type":"article","og_title":"List of Maharaja’s Palace Hotels in India - Luxury Hotels","og_description":"List of Maharaja’s Palace Hotels in India - Luxury Hotels","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2019-02-01T05:29:06+00:00","article_modified_time":"2023-10-03T07:38:52+00:00","og_image":[{"width":750,"height":450,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"List of Maharaja’s Palace Hotels in India","datePublished":"2019-02-01T05:29:06+00:00","dateModified":"2023-10-03T07:38:52+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/"},"wordCount":1742,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg","articleSection":["Hotels"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/","name":"List of Maharaja’s Palace Hotels in India - Luxury Hotels","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg","datePublished":"2019-02-01T05:29:06+00:00","dateModified":"2023-10-03T07:38:52+00:00","description":"List of Maharaja’s Palace Hotels in India - Luxury Hotels","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2023\/10\/Shahpura-House-Jaipur.jpg","width":750,"height":450,"caption":"Shahpura House Jaipur"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/maharajas-palace-hotels-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"List of Maharaja’s Palace Hotels in India"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/3803","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=3803"}],"version-history":[{"count":4,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/3803\/revisions"}],"predecessor-version":[{"id":8741,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/3803\/revisions\/8741"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/8730"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=3803"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=3803"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=3803"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}