{"id":4361,"date":"2019-03-04T12:46:56","date_gmt":"2019-03-04T12:46:56","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=4361"},"modified":"2022-10-27T06:29:47","modified_gmt":"2022-10-27T06:29:47","slug":"panch-kedar","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/","title":{"rendered":"Panch Kedar &#8211; Where Shiva is Worshipped in Different Forms"},"content":{"rendered":"<p>Uttarakhand mostly reckoned as Devbhoomi or Land of holy abodes and is the most visited pilgrimage destinations in North India. There are myriads of legends associated with the origin of the holy abodes of Devbhoomi which are related to an array of five holy temples of Lord Shiva collectively called as Panch Kedar. This set of Lord Shiva temple includes Tungnath, Kedarnath, Rudranath, Madhyamaheshwar and Kalpeshwar. All these revered and heavily visited shrines are beautifully located in the Garhwal Himalayan Ranges whose origins are mostly associated with the Pandavas of Mahabharata. Each of the temples is popular for its amazing location and the tranquil ambiance. However, it is not very easy to reach these holy shrines as there is no motorable or straight road going to the destinations. The splendid journey of Panch Kedar (it generally takes 15-16 days to complete this spiritual journey) gives you a lifelong memorable journey experience. Snow-clad mountains, lush green meadows, imposing and magnificent mountain peaks, wildlife, and enchanting water streams add more glory to the spiritual and tranquil significance of this journey. This entire sacred journey is stretched up to 170 km commencing from Rishikesh in the order: Kedarnath, Tungnath, Rudranath, Madhyamaheshwar, and Kalpeshwar.<\/p>\n<h2><strong>Legends behind the Origin of Panch Kedar<\/strong><\/h2>\n<p>Similar to other pilgrimage places, Panch Kedar also has numerous legends associated with its origin. One of the most popular is taken from the Mahabharata era. The legend states that Pandavas were heavily burdened with the guilt of fratricide. To seek blessings from Lord Shiva and to please him for that they performed atonement but Lord Shiva didn’t want to absolve their sins so easily. To hide from Pandavas he disguised himself in a bull at Guptkashi. Pandavas came searching for him and reached in the Garhwal Himalayan Ranges. Bheema (one of the mighty Pandava brothers) recognized lord Shiva and tried to catch the bull then Lord Shiva as a bull dived into the ground and disappeared. Lord Shiva then reappeared in the Garhwal Himalayan Range in different parts at different places. His hump was discovered at Kedarnath, navel at Madhyamaheshwar, face at Rudranath, arms at Tungnath, and hair at Kalpeshwar. Since then, he has been worshipped differently at different spots of Panch Kedar.<\/p>\n<h3><strong>Kedarnath Temple<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"\/blog\/wp-content\/uploads\/2022\/03\/Kedarnath-Temple.jpg\" alt=\"Kedarnath Temple\" width=\"700\" height=\"500\" class=\"alignnone size-full wp-image-7849\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2022\/03\/Kedarnath-Temple.jpg 700w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2022\/03\/Kedarnath-Temple-300x214.jpg 300w\" sizes=\"auto, (max-width: 700px) 100vw, 700px\" \/><br \/>\nLocated in a picturesque landscape studded with beautiful mountains, snow-covered peaks, lush green valleys, and dense forests, Kedarnath is considered one of the most important and the sacred shrine of Panch Kedar. The temple is nestled at an elevation of 3584 meters above the sea level in the Rudraprayag district of Uttarakhand. It is also considered as one of the prime destinations in Chota Char Yatra in Uttarakhand. The temple has a cone-shaped lingam resembling the hump of Lord Shiva. The present temple of Kedarnath is believed to be established by Adi Shankaracharya in the 8th-9th century AD. Gaurikund is the nearest motorable road leading towards Kedarnath. Rest of the distance (around 14 km trekking trail) is covered through trekking on steep slopes, however, the panoramic views of the trail negotiate the tedious trekking experience and transform it in an enjoying and enthralling experience. Due to heavy snowfalls, the temple is closed from November to April and gets opened in April last.<\/p>\n<h4><strong>Places to Visit<\/strong><\/h4>\n<p>There are many nearby attractions located in Kedarnath Dham region including Gaurikund, Chorabari Tal, Bhairav Temple, and Vasuki Temple. Gaurikund is the base of the trekking trail to Kedarnath and houses an ancient Gauri Temple. Also called as Gandhi Sarovar, Chorabari Tal is believed that some of the ashes of Mahatma Gandhi were submerged in this water body. Also called as the protection of Kedarnath during winter, Bhairav Temple is believed to be constructed around 1000 years back. This sapphire-hued blue lake is located 8 km away from the Kedarnath Temple.<\/p>\n<h4><strong>How to Reach<\/strong><\/h4>\n<p><strong>By Air:<\/strong> Jolly Grant Airport is the nearest airport to Kedarnath Dham which is located around 103 km away from Kedarnath. From the Airport, you can hire a taxi to Gaurikund or till Haridwar or Rishikesh.<\/p>\n<p><strong>By Rail:<\/strong> Haridwar and Rishikesh Railway station are the nearest railway stations to Kedarnath. There are frequent trains plying from  Gaya Bihar to Haridwar and Dehradun on regular basis. From Haridwar, you can easily get a bus to reach your destination.<\/p>\n<p><strong>By Road:<\/strong> Gaurikund is well-connected with motorable roads, buses, and taxis. There are regular buses plying from Rishikesh, Dehradun, Rishikesh, and some other cities of Uttarakhand.<\/p>\n<h4><strong>Best Time to Visit:<\/strong><\/h4>\n<p>The region experiences cold weather throughout the year however, summer is the most ideal time to visit Kedarnath due to a quite pleasant temperature hovering around 17 degree Celsius. During monsoon temperature of the region drops down to 12 degree Celsius and is frequented with heavy rainfalls resulting in landslides sometimes. In winter, the region witnesses bone-tearing cold weather where the temperature reaches sub-zero level.<\/p>\n<h3><strong>Tungnath Temple<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-4367\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Tungnath-Temple.jpg\" alt=\"Tungnath Temple\" width=\"700\" height=\"525\" \/><br \/>\nSettled in the Rudraprayag district of Uttarakhand and on the Chandranath Mountain, Tungnath is considered as the highest and one of the most revered Kedars among Panch Kedars located in the northern state. The temple is situated at a great altitude of 3680 meters above sea level. The pilgrimage is dedicated to Lord Shiva where devotees pay their offering an homage to the hands of Lord Shiva. According to Hindu mythology, Adi Shankaracharya discovered this temple around more than 1000 years back. Due to its high altitude location similar to other temples in Uttarakhand, you need to cover a certain trekking distance to reach the shrine. However, the trekking is quite easy at some places but it becomes a bit difficult when you reach towards the Chandrashila Peak. The panoramic views and the beautiful landscapes take away all your tiredness and give an amazing and enthralling trekking experience. As like other high altitude temples of Uttarakhand, Tungnath is also closed during the winter season and is only touched by adventure enthusiasts in this season.<\/p>\n<h4><strong>Places to Visit<\/strong><\/h4>\n<p>Despite being a religious destination, Tungnath is equally visited by nature lovers, adventure enthusiasts, and peace seekers. It has many things to offer to the tourists visiting the place. Chopta, Deoria Lake, Kanchula Korak Musk Deer Sanctuary are some of the most visited places around Tungnath. Located at a distance of 4 km from Tungnath, Chopta is adorned with lush green meadows and the imposing Himalayan Mountain peaks alluring the tourists. A high altitude lake encircled by Chaukhamba Mountain, Deoria Lake is one of the must-visit places in Tungnath.<\/p>\n<h4><strong>How to Reach<\/strong><\/h4>\n<p><strong>By Road:<\/strong> Chopta is the last accessible place en-route Tungnath which is well-connected with other major cities in Uttarakhand like Rudraprayag. There are frequent inter-state and intrastate buses plying to Rudraprayag on regular basis. From Rudraprayag, you can avail yourself with the cab facilities to Chopta.<\/p>\n<p><strong>By Rail:<\/strong> Haridwar is the nearest railhead located around 180 km away from Chopta and is well-connected with the other major cities and towns of the country. From Haridwar, you can opt for road transport leading towards Chopta.<\/p>\n<p><strong>By Air:<\/strong> Jolly Grant Airport in Uttarakhand is the nearest airport to Tungnath and is located around 203 km away from the last accessible point (Chopta) of Tungnath. The airport is well-connected with the motorable roads of the state.<\/p>\n<h4><strong>Best Time to Visit:<\/strong><\/h4>\n<p>Summer is the most feasible time to visit Tungnath and to seek the blessings of Lord Shiva. This religious spot is visited during monsoon also but in a less number as the place witnesses heavy snowfall during these months. In the winter season, Tungnath is very less crowded with devotees but is heavily crowded with adventure enthusiasts and nature lovers.<\/p>\n<h3><strong>Rudranath Temple<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-4366\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Rudranath-Temple.jpg\" alt=\"Rudranath Temple\" width=\"700\" height=\"463\" \/><br \/>\nThis peacefully adorned temple in Uttarakhand is dedicated to Lord Shiva and is counted as one of the most sacred and important Shiva Temples in Panch Kedar array. This celestial temple is nestled amidst the alpine meadows and rhododendron forests and at an elevation of around 3600 meters above the sea level. The temple is believed to be constructed around the 8th century and it is known to house the face of Lord Shiva. This far-flung temple of Lord Shiva is situated in the Chamoli district in Garhwal Himalayan Ranges. The main deity of this temple is formed by the rock carvings shaped like a human face. The projection of the rock statue showcases a serene smile and pure kindness in the all-seeing eyes. The pious Baitarani stream or Rudra Ganga flows near the temple housing a grey-stoned statue of Lord Shiva. There is an annual fair celebration organized every year in the Hindu month of Shravan and on the full-moon day is so inviting to the locals as well as the tourists. Similar to other Kedars of Lord Shiva in Uttarakhand, Rudranath also gets closed during the winter season and gets re-opened with the commencement of summer season.<\/p>\n<h4><strong>Places to Visit<\/strong><\/h4>\n<p>Nandi Kund, Panar Bugyal, Pitradhar, and Kalpeshwar are some of the top attractions of Rudranath. Nandi Kund is believed to be the same place from where the Nandi Bull of Lord Shiva used to drink water perhaps the water of this lake is immensely cold. Panar Bugyal located near to Rudranath is quite appealing and inviting due to its picturesque landscape studded with flower-strewn valleys and lush-green meadows.<\/p>\n<h4><strong>How to Reach<\/strong><\/h4>\n<p><strong>By Air:<\/strong> Jolly Grant Airport in Dehradun is the nearest airport to Rudranath which is located around 258 km away from Rudranath. Frequent buses and taxis ply from the airport to Sagar Village or Gopeshwar from where the trekking trail to Rudranath commences. You need to cover a 21 km trekking distance to reach Rudranath from Sagar village.<\/p>\n<p><strong>By Rail:<\/strong> Rishikesh and Haridwar are the nearest railway stations located at a distance of 213 km and 236 km respectively from Gopeshwar. One can easily get a bus or a taxi from any of these railway stations to reach either Gopeshwar or to the Sagar Village.<\/p>\n<p><strong>By Road:<\/strong> Gopeshwar and Sagar village in Uttarakhand is well-connected with Rudranath through motorable roads.  Hiring a taxi or cab is the most convenient way to reach these two nearby accessible destinations of Rudranath.<\/p>\n<h3><strong>Madhyamaheshwar Temple<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-4365\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Madhyamaheshwar-Temple.jpg\" alt=\"Madhyamaheshwar Temple\" width=\"700\" height=\"466\" \/><br \/>\nThis north Indian style temple dedicated to Lord Shiva is situated at an elevation of 3490 meters above the sea level and is the fourth visiting temple in Panch Kedar array. Madhyamaheshwar is mystically adorned with snow-covered mountains, lush green meadows, and dense forests. Due to its mesmerizing scenic views, Madhyamaheshwar is counted as one of the most visited destinations in the Rudraprayag district in Uttarakhand which is always flocked by a good number of tourists coming from all over the world. The main deity of the temple is designed with black stone and projected as a navel-shaped lingam settled inside the main sanctum. At the right side of the main temple, you can find small temple housing a beautiful marble idol of Goddess Saraswati. The temple of Madmaheshwar is believed to be constructed by the Pandavas.<\/p>\n<h4><strong>Places to Visit<\/strong><\/h4>\n<p>Near Madhyamaheshwar there are many other tourists visiting places including Maa Hariyali Devi Temple, Ukhimath, Kanchani Tal, Guptkashi, Sonprayag and many more. Situated around 14 km away from Madhyamaheshwar, Ukhimath is considered to be its winter abode and of Kedarnath too. Beautifully encircled by Himalayan Peaks and dense forests Maa Hariyali Devi Temple is counted among 58 Peethas of Hindu mythology.<\/p>\n<h4><strong>How to Reach<\/strong><\/h4>\n<p><strong>By Road:<\/strong> there are numerous buses moving from  Gaya Bihar to Dehradun or Haridwar from where you can take a bus or taxi to Ukhimath.<\/p>\n<p><strong>By Rail:<\/strong> Located at a distance of 204 km from Ukhimath, Haridwar is the nearest railhead to Madmaheshwar from where buses and taxis are easily available to Ukhimath.<\/p>\n<p><strong>By Air:<\/strong> Jolly Grant Airport is located around 222 km away from Madmaheshwar and is the nearest airport. You can take a taxi from the airport to reach Ukhimath and then to Unaina which is the trekking base of Madmaheshwar.<\/p>\n<h4><strong>Best Time to Visit<\/strong><\/h4>\n<p>The region experiences chilly cold weather throughout the year but in summer the weather is quite pleasing and feasible to visit Madmaheshwar.<\/p>\n<h3><strong>Kalpeshwar Temple<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-4363\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Kalpeshwar-Temple.jpg\" alt=\"Kalpeshwar Temple\" width=\"700\" height=\"525\" \/><br \/>\nAt Kalpeshwar, the hair of Lord Shiva is being worshipped. Kalpeshwar is the last Shiva Temple to be visited in Panch Kedar array which is situated at an elevation of 2200 meters above the sea level and in the picturesque town of Chamoli district. Due to the low altitude location as compared to the other pilgrimage spots in Panch Kedar circuit, Kalpeshwar is the only Shiva Temple of Panch Kedar where you can do the philosophy throughout the year. Devotees must not miss paying their homage at the sacred Kalpeshwar tree which is famous among Hindu devout as a wish-granting tree. This small stone temple can be approached via a cave passage accessible after covering a trekking trail of 12 km from Helong.<\/p>\n<h4><strong>Places to Visit<\/strong><\/h4>\n<p>Nandi Kund Lake is the nearest tourist destination in Kalpeshwar where devotees can spend their free time and can get some fresh and refreshing air. This pristine lake has been spread over one and a half km.<\/p>\n<h4><strong>How to Reach<\/strong><\/h4>\n<p><strong>By Air:<\/strong> Jolly Grant Airport is the nearest airport located at a distance of 272 km from Kalpeshwar.<\/p>\n<p><strong>By Rail:<\/strong> Rishikesh is the nearest railhead to Kalpeshwar located at a distance of 255 km.<\/p>\n<p><strong>By Road:<\/strong> Haridwar, Rishikesh, Rudraprayag of Uttarakhand is well-connected with the motorable roads from the other major cities of Uttarakhand.<\/p>\n<h4><strong>Best Time to Visit:<\/strong><\/h4>\n<p>May, June, September, and October are the most ideal months to visit Kalpeshwar because of quite pleasing and feasible climatic conditions in the region.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Uttarakhand mostly reckoned as Devbhoomi or Land of holy abodes and is the most visited pilgrimage destinations in North India. There are myriads of legends associated with the origin of the holy abodes of Devbhoomi which are related to an array of five holy temples of Lord Shiva collectively called as Panch Kedar. This set of Lord Shiva temple includes [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5547,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28],"tags":[],"class_list":["post-4361","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uttarakhand"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Panch Kedar Yatra - The Five Shrines of Lord Shiva in Uttarakhand<\/title>\n<meta name=\"description\" content=\"Explore the holy pilgrimage destinations of the Panch Kedar circuit including Kedarnath, Tungnath, Rudranth, Madmaheshwar, and Kalpeshwar.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Panch Kedar Yatra - The Five Shrines of Lord Shiva in Uttarakhand\" \/>\n<meta property=\"og:description\" content=\"Explore the holy pilgrimage destinations of the Panch Kedar circuit including Kedarnath, Tungnath, Rudranth, Madmaheshwar, and Kalpeshwar.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-03-04T12:46:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-10-27T06:29:47+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"218\" \/>\n\t<meta property=\"og:image:height\" content=\"150\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Panch Kedar &#8211; Where Shiva is Worshipped in Different Forms\",\"datePublished\":\"2019-03-04T12:46:56+00:00\",\"dateModified\":\"2022-10-27T06:29:47+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/\"},\"wordCount\":2234,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg\",\"articleSection\":[\"Uttarakhand\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/\",\"name\":\"Panch Kedar Yatra - The Five Shrines of Lord Shiva in Uttarakhand\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg\",\"datePublished\":\"2019-03-04T12:46:56+00:00\",\"dateModified\":\"2022-10-27T06:29:47+00:00\",\"description\":\"Explore the holy pilgrimage destinations of the Panch Kedar circuit including Kedarnath, Tungnath, Rudranth, Madmaheshwar, and Kalpeshwar.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg\",\"width\":218,\"height\":150,\"caption\":\"Panch-Kedar\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Panch Kedar &#8211; Where Shiva is Worshipped in Different Forms\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Panch Kedar Yatra - The Five Shrines of Lord Shiva in Uttarakhand","description":"Explore the holy pilgrimage destinations of the Panch Kedar circuit including Kedarnath, Tungnath, Rudranth, Madmaheshwar, and Kalpeshwar.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/","og_locale":"en_US","og_type":"article","og_title":"Panch Kedar Yatra - The Five Shrines of Lord Shiva in Uttarakhand","og_description":"Explore the holy pilgrimage destinations of the Panch Kedar circuit including Kedarnath, Tungnath, Rudranth, Madmaheshwar, and Kalpeshwar.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2019-03-04T12:46:56+00:00","article_modified_time":"2022-10-27T06:29:47+00:00","og_image":[{"width":218,"height":150,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Panch Kedar &#8211; Where Shiva is Worshipped in Different Forms","datePublished":"2019-03-04T12:46:56+00:00","dateModified":"2022-10-27T06:29:47+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/"},"wordCount":2234,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg","articleSection":["Uttarakhand"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/","name":"Panch Kedar Yatra - The Five Shrines of Lord Shiva in Uttarakhand","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg","datePublished":"2019-03-04T12:46:56+00:00","dateModified":"2022-10-27T06:29:47+00:00","description":"Explore the holy pilgrimage destinations of the Panch Kedar circuit including Kedarnath, Tungnath, Rudranth, Madmaheshwar, and Kalpeshwar.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Panch-Kedar-218x150.jpg","width":218,"height":150,"caption":"Panch-Kedar"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/panch-kedar\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Panch Kedar &#8211; Where Shiva is Worshipped in Different Forms"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/4361","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=4361"}],"version-history":[{"count":8,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/4361\/revisions"}],"predecessor-version":[{"id":7908,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/4361\/revisions\/7908"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5547"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=4361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=4361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=4361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}