{"id":4426,"date":"2019-03-25T07:57:37","date_gmt":"2019-03-25T07:57:37","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=4426"},"modified":"2022-03-28T08:48:01","modified_gmt":"2022-03-28T08:48:01","slug":"jantar-mantar-in-jaipur","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/","title":{"rendered":"Jantar Mantar &#8211; The Land of Magical Calculation in Jaipur"},"content":{"rendered":"<p>The train sped away, the trees looking as if they were racing with us. The compartment was eerily quiet after the small confusion that we had at the previous station. There was a family which got into the wrong train quite inadvertently and it was a complete confusion how to convince them that they were in the wrong train. They were from Andhra and didn’t know a word of Hindi or English. Finally it took a pantry fellow who happened to speak their language, to convince them about their predicament. The very next station found the train halting and the Andhra family being escorted to the station master’s room. The train was now headed towards Jaipur. The very mention of Jaipur sends a thousand bells ringing in my sister’s ears. She had asked for a lehenga Choli and slippers called Mojris from Jaipur. Yes. I often visit this city as our company headquarters is here in this historical city. It was Borning to go to any place alone but work demands I finish my project on time. So with my laptop bag beside me and a small valise under the seat, I waited for the station to come so that I could jump out and feel free.<br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-4428\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg\" alt=\"Jantar Mantar\" width=\"741\" height=\"486\" \/><br \/>\nI had actually thought of getting off at Agra Fort Station and have a look at the Taj Mahal. But I had to report at night at the hotel that was booked for me. I had come with my delegation as part of a ten member committee for the International Conference at Jaipur. So I had to be there on time.<\/p>\n<p>The early morning sun rays shone through the crack on the roof of the shade that was built in Jaipur station. The whole ambience looked like we were in a kind of documentary on Rajasthan. Suddenly the hues and shades turned into pink, yellow, green and bright Colors. That is one thing about Jaipur and Rajasthan. The Vibrant Colours Anyway I had come with minimal luggage and soon checked into the hotel after being ushered into the car that was waiting for me. The other members were already there and we had an elaborate breakfast after a quick shower. We had to prepare for the next day’s presentation. Roy, my colleague and Krish, another acquaintance asked if we could go and have a look at the city’s monumental architecture. I agreed immediately and quietly suggested, “Jantar Mantar. I want to see that structure.’<\/p>\n<p>The other two agreed and as we were getting into the car, Pamela came rushing in. Pamela was the universal assistant of our firm and was ever ready with the best kind of trivia on any issue. She just hopped into the car. That was Pamela. No inhibitions, no hanky Panky.<\/p>\n<p>Gathering her breath, she asked “Where are you all going? I am so bored here.”<\/p>\n<p>“Jantar Mantar.” All the three of us said. “Oh No!” she said “I have been there umpteen times.”<\/p>\n<p>We told here another time wouldn’t matter and she reluctantly agreed. “so do you not have any trivia about Jantar Mantar?” Roy asked munching into a brownie he brought from the breakfast table. Roy was a gourmand and loved to eat. In spite of his senior position in the company, amongst friends he was an easy going person.<\/p>\n<p>Pamela, pushing her hair back said,” Yes, Jantar Mantar. Uh..hum..It is an astronomical observatory. Maharaja Jai Singh built it. Taking out a chewing gum, and offering it to us, she continued,” It is the biggest and the best amongst observatories that have been built by the Maharaja. He was a very avid astronomer you know.”<\/p>\n<p>“Bas Bas,” Krish said meaning enough in Hindi. “Phew! Pam, you talk so much.”<\/p>\n<p>Pamela giggled and said she was going to take a short nap and to tell here when we reach Jantar Mantar.<\/p>\n<p>But when was it built?” probed Roy, triggering off another pool of data from Pam! “Oh!” she continued it was built between the years 1728 and 1734. It is today the most logical kind of stone landscape. There are many instruments in Jantar Mantar which show the temperature and the amount of heat that the season would have, if there would be a famine etc.<\/p>\n<p>“Okay, I have Tidbit information too.” I added. Everyone looked towards me and I said that the Jantar Mantar was a UNESCO World Heritage Site.<\/p>\n<p>The three of them said “Hey! We knew that.” Laughing we just looked at the scene outside. It was beautiful with the desert sand showing up with intermittent greenery cropping up. The whole area looked like a desert yet there was lot of activity.<\/p>\n<p>Finally we reached Jantar Mantar. There was a guide there whom we paid a nominal amount and he took us on a guided tour around the structure. I had always seen the structure in text books, charts, pictures. Today, as I stood there looking at this huge marvel of architectural intelligence, I could only just stand there and gape at it like a fool. The name perhaps had some connection with the words Instrument and calculations. So the place looked very much in sync with the name Jantar Mantar. The City palace of Jaipur was very near Jantar Mantar. The simple structures around just completely overwhelmed us. Being engineers, we could understand that the whole structure had been built with a purpose and objective. The geometric angle to the entire structure was evident even to a layman. These are the features that attracted it to tourists. I have heard my mother telling me how she had come here as a student and had asked me to see the phenomena of calculation of time, prediction of eclipse instruments etc. There were also methods of tracking stars in the orbit and one could see some other astronomical activities also. The instruments found here are ancient and thus are found to be made of marble sandstone.<\/p>\n<p>As we walked around with the guide ranting away things which we didn’t want to hear. Pamela was grinning as she knew that we felt her trivia was better than his.! The observatory was obviously entirely made up of stone and marble.<\/p>\n<p>Pamela said,” See each of the instruments here is made with a specific purpose.” This timeless beautiful structure just quietly bore testimony to so much history that I was just too mesmerized to concentrate on what she was saying. I could see the melee of the tourists here included everyone from old men to confidently striding old women, students to teachers, astrologers to budding scientists, historians to people like us.<\/p>\n<p>The guide was saying, “There are fourteen astronomical instruments here. Each instrument is important.”<\/p>\n<p>“But the Vrihat Samrat Yantra is the most attractive, “Pam said. “Yes, yes,” the guide continued and said that it means it is the Sundial that Pam was talking about. We saw that at the left of the entrance the Laghu Samrat Yantra was there. This was the small sundial. This small sundial dealt with calculating the declination of all the bodies celestially.<\/p>\n<p><strong>We therefore went on a tour of the Yantra:<\/strong><\/p>\n<p>The in house guide explained to us how the instruments worked. First we saw the Narivalaya Yantra. This was a sundial which was used to calculate time with the help of the solar cycle. There were two hemispheres which were inclined at 27 degrees.<\/p>\n<p>The next instrument we saw was the Unnatansha Yantra. The guide explained that this was used to find out the actual position of the stars and planets at any point of day or night.<\/p>\n<p>The next instrument we saw was the Laghu Samrat yantra. Pamela said, “I know this. This is a small sundial that was built on 27 degrees north. This incidentally is the latitude where Jaipur lies. This was used to calculate the local time at Jaipur.” The guide said, “Yes she is right and the accuracy of calculation is as close as 20 seconds.”<\/p>\n<p>Chakra Yantra – This was the next instrument we saw. The instrument looked like some brass tubes. These tubes appeared to pass through the middle of the metal instruments which were two in number. The guide said that this instrument was used to deduct the angle at which the stars and planets passed the equator.<\/p>\n<p>We were quite enlightened about the old pattern of application of science and we were just enriched with information which was easy to comprehend and not beyond understanding. I wished college studies were as easy and as practical. The Ram Yantra was what we saw next. This looked like two rock circles like Stonehenge. There were vertical columns which supported some horizontal slabs. Pannalal, the guide said that this was used to find out the length of the celestial arc from the horizon to the zenith. “Isn’t It also used to measure the altitude of the sun&gt;?” asked Pamela. The guide nodded in agreement.<\/p>\n<p>Sometimes I wonder why Pamela knows so much but now I was proud of her. She really was well informed. Even though she claimed that it was only because her father was from Jaipur that she knew this place well, yet the memory recall was really commendable. We then saw an instrument which looked like there were two bowls which were sunk into the floor.<\/p>\n<p>Pannalal said “Maharaja Jai Singh himself constructed this instrument. This instrument is the one which measures the accuracy of all other instruments here”. A collective gasp went around the crowd as everyone looked at this mother of all instruments.<\/p>\n<p>The next that we saw was the Rashivalaya Yantra which came in a set of 12 pieces. The 12 pieces were for the 12 signs of the zodiac. The angle and the constellation were different. The astrologers make use of this to predict horoscopes.<\/p>\n<p>“Whoa! What is this?” I exclaimed as I saw a tall structure.”<\/p>\n<p>“This is the sundial which used to forecast the crop growth for the entire year.” Pannalal continued.<\/p>\n<p>“And it measures 75ft.” completed Pamela fanning my sweating brow. “don’t break into a sweat Shonu, this is not over yet, you have a look at other structures in Jaipur, and you would need a stock of sweat to perspire and imagine what a great country we are in.”<\/p>\n<p>“Yes, Pam, true, the place is really amazingly magnificent and intriguing.”<\/p>\n<p>We had to get back to the hotel as we had to prepare for the next day’s presentation. But the first thing I did after getting back, was write this blog. As memories flood my mind, nostalgia also takes over as I feel like going back to Jantar Mantar, Meet Pannalal, live the experience called Jantar Mantar again. I wished Jantar Mantar had a time machine which would then take us to the time when this was constructed so that we could see what it was that existed in the minds of those intelligent brains that made this landmark in Indian monuments.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The train sped away, the trees looking as if they were racing with us. The compartment was eerily quiet after the small confusion that we had at the previous station. There was a family which got into the wrong train quite inadvertently and it was a complete confusion how to convince them that they were in the wrong train. They [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":5300,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62],"tags":[],"class_list":["post-4426","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-jaipur"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Jantar Mantar, Jaipur - History, Architecture, Timing and Travel Guide<\/title>\n<meta name=\"description\" content=\"Jantar Mantar is a Historical structure of astrological significance. Visit now with the help of this detailed travel guide consisting of timings.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Jantar Mantar, Jaipur - History, Architecture, Timing and Travel Guide\" \/>\n<meta property=\"og:description\" content=\"Jantar Mantar is a Historical structure of astrological significance. Visit now with the help of this detailed travel guide consisting of timings.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-03-25T07:57:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-28T08:48:01+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"741\" \/>\n\t<meta property=\"og:image:height\" content=\"486\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Jantar Mantar &#8211; The Land of Magical Calculation in Jaipur\",\"datePublished\":\"2019-03-25T07:57:37+00:00\",\"dateModified\":\"2022-03-28T08:48:01+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/\"},\"wordCount\":1841,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg\",\"articleSection\":[\"Jaipur\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/\",\"name\":\"Jantar Mantar, Jaipur - History, Architecture, Timing and Travel Guide\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg\",\"datePublished\":\"2019-03-25T07:57:37+00:00\",\"dateModified\":\"2022-03-28T08:48:01+00:00\",\"description\":\"Jantar Mantar is a Historical structure of astrological significance. Visit now with the help of this detailed travel guide consisting of timings.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg\",\"width\":741,\"height\":486,\"caption\":\"Jantar-Mantar-Jaipur\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Jantar Mantar &#8211; The Land of Magical Calculation in Jaipur\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Jantar Mantar, Jaipur - History, Architecture, Timing and Travel Guide","description":"Jantar Mantar is a Historical structure of astrological significance. Visit now with the help of this detailed travel guide consisting of timings.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/","og_locale":"en_US","og_type":"article","og_title":"Jantar Mantar, Jaipur - History, Architecture, Timing and Travel Guide","og_description":"Jantar Mantar is a Historical structure of astrological significance. Visit now with the help of this detailed travel guide consisting of timings.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2019-03-25T07:57:37+00:00","article_modified_time":"2022-03-28T08:48:01+00:00","og_image":[{"width":741,"height":486,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Jantar Mantar &#8211; The Land of Magical Calculation in Jaipur","datePublished":"2019-03-25T07:57:37+00:00","dateModified":"2022-03-28T08:48:01+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/"},"wordCount":1841,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg","articleSection":["Jaipur"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/","name":"Jantar Mantar, Jaipur - History, Architecture, Timing and Travel Guide","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg","datePublished":"2019-03-25T07:57:37+00:00","dateModified":"2022-03-28T08:48:01+00:00","description":"Jantar Mantar is a Historical structure of astrological significance. Visit now with the help of this detailed travel guide consisting of timings.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/Jantar-Mantar-Jaipur.jpg","width":741,"height":486,"caption":"Jantar-Mantar-Jaipur"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jantar-mantar-in-jaipur\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Jantar Mantar &#8211; The Land of Magical Calculation in Jaipur"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/4426","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=4426"}],"version-history":[{"count":3,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/4426\/revisions"}],"predecessor-version":[{"id":7795,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/4426\/revisions\/7795"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/5300"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=4426"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=4426"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=4426"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}