{"id":462,"date":"2014-07-14T07:56:23","date_gmt":"2014-07-14T07:56:23","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=462"},"modified":"2023-08-10T06:25:05","modified_gmt":"2023-08-10T06:25:05","slug":"jim-corbett-national-park","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/","title":{"rendered":"Jim Corbett National Park,  The Safari Adventure"},"content":{"rendered":"<p>Enjoy the thrill of visiting Jim Corbett National Park, one of the most famed wildlife sanctuaries of India. Jim Corbett National Park is famous even worldwide because of the many endangered species of animals it preserves therein. A Jungle Safari of the Park would be a real memorable experience for any visitor. Read on to learn more about Jim Corbett National Park.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-8481 alignright\" src=\"\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg\" alt=\"Jim Corbett National Park\" width=\"300\" height=\"200\" \/>Everyone loves travelling. Visiting places of adventure is just not travelling but a little more for wander thirsts. India with its rich heritage and diversity has never disappointed travellers and thus India remains the tourist hub almost all around the year. Wildlife lovers never forget to allot in their schedule Corbett National Park which is one of the oldest national parks and the first Tiger Reserve of India. Established in 1936 it is situated in Ramnagar that falls under two districts- Nainital and Pauri of Uttarakhand.<\/p>\n<p>In the foothills of the Himalayas lies the wildlife area of Corbett National Park. Corbett National Park has been famous as the home of endangered Bengal Tiger. Earlier it was named Hailey National Park but after the influence of Jim Corbett in establishment of the park his name was given to the park. The wildlife and the scenic beauty capture thousands of tourists every year. It extends through a large area of 521 sq. km along with Sonanadi Wildlife Sanctuary which comprises the entire Corbett National Park of 1288 sq.km. Corbett is the destination of several animals with a wide variety of flora and fauna and birds. The park has taken complete responsibility of preserving the gifts of nature.<\/p>\n<h3><strong>Through the Pages of History<\/strong><\/h3>\n<p>Several areas of the park were under Tehri Garhwal. A Terai tribe named Boksas resided in the place and started their own cultivation. But after the control of the British Raj the tribes were driven away from the land. The British officer Major Ramsay took effort to protect the forest area. During 1900 the land was suggested to establish a reserve park by several British officers like E.A. Smythies and E. R. Stevans. It came into being in 1936 under the governor Sir Malcolm Hailey from which its first name came. Later in 1954 bit was renamed as Ramganga National Park but finally, the name was changed again in 1966 after the name of the author and wildlife conservationist Jim Corbett. In the year 1973 Jim Corbett National Park was selected as the venue of a project named PROJECT TIGER. It is one of the biggest projects launched by all the wildlife preservationist and naturalist from different parts of the world.<\/p>\n<h3><strong>To Begin the Journey<\/strong><\/h3>\n<p>The nearest railway station to Corbett National Park is Ramnagar station which is 12 kms away from the park. Trains like Ranikhet Express and Kumaon Express halts at Ramnagar but one can easily opt for a more memorable journey through roadways. State government buses are available from  Gaya Bihar, Haldwani, and Moradabad to Ramnagar. The Park has been divided into five tourism zones namely- Bijrani whose gate is at Amadanda; Dhikala having gate at Dhangari; Jhirna whose gate is at Khara, Kalagarh; Domunda has gate at Durgadevi; Sonanadi has its gate at Vatanvasa.<\/p>\n<h3><strong>Travel in the Park<\/strong><\/h3>\n<p>The entry fees for a day visit in different zones are Rs100\/- for Indian and Rs 450\/- for Foreigners. The vehicle fee ranges from Rs 250\/- to 1500 depending on the weight of the vehicle. The charge of commercial photography is Rs 500 for Indian and Rs 1500 for foreigners. For an elephant ride in the park for 2 hours the tariff is Rs 300 for each Indian and Rs 1500 for foreigner each. For the elephant safari one has to pay Rs 3000\/- and for the Ramganga conducted tour the tariff is Rs 1000\/- for Indian and Rs 2000\/- for foreigner.<\/p>\n<h3><strong>Flora and Fauna<\/strong><\/h3>\n<p>The park is the home of several varieties of animals and plants. There are around 488 species of different plants. There are mountains and different forests all over the park. Herbs, tress, bamboos, climbers, grasses and ferns cover the flora. Tress like Sal, Khair, Sissoo, Pine and Oak are seen all around the park during travel. Different palm trees are also available in plenty such as the Date, Kanju, Jamun, and Amla. Other significant trees are Teak, Eucalyptus, Jacaranda, and Bottlebrush, Silver Oak, Bel, Kusum, Mahua and Bakil. Flowering plants like Kachnaar, Semal, Dhak, Madaar and Amaltas colours the park with their vibrant beauty.<\/p>\n<h4><strong>Corbett Flora and Fauna<\/strong><\/h4>\n<p>The tiger has the greatest influence on the Corbett and is famous worldwide through the writings of Jim Corbett. Tigers are found in a different area from the other animals as they prefer solitude. But the female Tiger is seen with her cub. Tigers maintain a home range that is quiet distant from another tiger. Male tigers keep a distance of around 60-100 sq. km and females keep a distance of 20 sq.km while choosing their homes. Both of the sexes protect their own territory. They mark their territory with claw marks, urine and gland secretions on tress. As the number of tigers have declined the attack on humans have declined. Only when a tiger is too old to catch any other prey or is injured they prefer man eating. Other than the famous Bengal tiger there are animals like Elephant, Chital, Nilgai, Sambar Deer, King Cobra, Gharial, Flying Fox, Common Musk Shrew, Hedgehog, Wild Boar, Muntjac and Indian Pangolin. There are also birds of around 600 species. During the winter the variety of birds increases due to migration from countries of East Africa, Europe and Central Asia. Himalayan birds also flock in the area to escape from the snow up in the high ranges of Himalayas. The splendid landscapes and the well-protected areas in the foothills of the Himalayas attract tourists. It is an ideal place for any animal lover, bird watcher, angler or an adventure freak.<\/p>\n<p>The habitat of such a huge variety of plants and animals could not grow without the river Ramganga. It supports the lifestyle in the park. The tributaries of Ramganga- Sonanadi, Mandal and Pailan are the Significant Water producers. Ramganga is rain-fed river with water all over the year. Ramganga emerges in Marchula which is 100km before Corbett. During its rum Ramganga joins with Palain, Mandal and Sonanadi rivers. Due to the rivers there are a wide variety of aquatic animals like crocodiles and a variety of fishes. There are few seasonal streams inside the park. These are named Sota locally. The animals of the park depend on thee for drinking water. The several sots are Garjia, Dhara, Jhirna, Kothi Rao, Laldhang and Paterpani. These sots are surrounded by thick shrubs and bamboo clumps which becomes the shelter of tigers.<\/p>\n<h4><strong>Zones Covered &#8211; Places to Visit<\/strong><\/h4>\n<p><strong>Jhirna<\/strong>: This zone is ideal for bird viewing. The place is also the home of wild elephants, sloth bear and the Great Hornbill. Other animals like nilgai, Cheetal, Sambhar and the wild boar are found in this zone. The rest house available in the Jhirna zone is Jhirna in the southern boundary of the park in the Shiwalik landscape.<\/p>\n<p><strong>Bijrani:<\/strong> this zone of the forest has dominant Sal trees and other mixed forests of three major grasslands. The area is perfect for tiger viewing with curved jungle roads. The water availability is plenty and thus builds wide vegetation of tropical moist, deciduous mixed forests in the area. The rest houses in Bijrani zone are Malani and Bijrani.<\/p>\n<p><strong>Dhikala:<\/strong> this zone offers the greatest variety. The area is ideal for overnight stay. Animals like Ghoral- the great antelope, Maggars and Gharials. The exclusive is the Hog Deer. Accommodation facilities are available in this area. The rest houses available in this zone are Sarapduli, Sultan, Gairal, Khinnanauli and Kanda.<\/p>\n<p><strong>Durga Devi:<\/strong> this zone is well known for fishing and bird watching. This area is in the north east part of Corbett. Birds like Little Forktail, Grey-Headed Fish Eagle, Maroon Oriole and many more are found. Rivers Ramganga and Mandal in this area attracts leopards, elephants and tigers.<\/p>\n<p><strong>Sonanadi:<\/strong> this area is resided in the centre of the park and offers a wide range of flora and fauna. Around 550 species of birds along with, tiger, leopard, Cheetal, Sambhar and other reptiles are found in this zone. The rest houses in this zone are Lohachaur in the northern part, Rathuadhab in the forest road and Halduparao between Palain and Sonanadi rivers.<\/p>\n<h4><strong>Accommodation<\/strong><\/h4>\n<p>Advance booking is required for residing in the Dhikala forest House. As the accommodation area limited the service is available as per as first-come-get basis. The rooms are available for two persons each night. There are also accommodation facilities in tents, mud huts\/ standard rooms, camp cottages and many other stay options.<\/p>\n<h4><strong>Time of Visit<\/strong><\/h4>\n<p>The park remains closed from mid-June to mid-November due to monsoon. During the summer that is from March to June the temperature reaches 40C and the heat is quiet scorching for animals as well as tourists. During monsoon that is from July to September, there is heavy rainfall. The weather is pleasant and the tourist can avail a journey through the Jhirna Gate that remains open all throughout the year. During winters that starts from December till February the temperature is varying from 5C to 30C. Fog covers during the morning. The winter time of November to February is ideal for visit for the winter birds. The weather remains pleasant that attracts a large number of tourists at this time of the year.<\/p>\n<h5><strong>Do’s and Don’ts<\/strong><\/h5>\n<ul>\n<li>The necessary permits for entering the park should be taken following all the procedures.<\/li>\n<li>A guide who will help to travel across the park to avoid unwanted hazards of losing tracks inside the reserved forests.<\/li>\n<li>The mode of transportation should be such that it should not disturb the animals. A slow journey will give one enough time to devour the scenic beauty.<\/li>\n<li>One should follow the exact tracks made for travel. Taking unknown routes might disturb the normal course of animals and can be dangerous as well.<\/li>\n<li>A safe distance should be maintained from the animals.<\/li>\n<li>To avoid making harsh sounds that might disturb the animals. Keep in mind not to turn off the music system in the vehicle one is travelling.<\/li>\n<li>Bright colours and perfumes should be avoided. Animals get distracted by bright lights. Colours that mix well with colour of the forest should be worn.<\/li>\n<li>Carrying a gun or pistol is prohibited. Photography is allowed.<\/li>\n<li>No fire should be lit in the forest. It I good to avoid smoke in the area of wild animals.<\/li>\n<li>Be cautious of the places that one can come down from the vehicle. All places are not safe for walking.<\/li>\n<li>Do not pollute the forest area with any kind of litter or packets. Keep the area clean.<\/li>\n<li>Non-veg and alcohol is prohibited inside the park.<\/li>\n<li>Binoculars are must if one does not want to lose the precious sights of the park.<\/li>\n<li>Talking should be avoided as much as possible to enjoy the sound of the nature.<\/li>\n<li>Smoking is against the law and creates disturbance to the wild animals.<\/li>\n<li>During photography, it is asked to avoid the flash. The harsh light of the flash will blind the sensitive eyes of animals making them restless.<\/li>\n<li>During winter one should carry warm clothes as the temperatures falls during the night. In the summer one should carry hats and dark glasses. Mosquito repellents are necessary. Drinking lots of water is necessary to avoid dehydration.<\/li>\n<li>One should not be visiting Corbett only for tigers as they are shy animals and do not come out in sight very often. Other exclusive animals are also worth watch.<\/li>\n<li>Obey the instructions of guide and do not go too close to animals.<\/li>\n<li>It is advisable to not to feed the animals. Human foods are not suitable for animals and feeding the animals with those foods can cause serious gum injury and bleeding.<\/li>\n<li>Do not excite animals. Do not chase them to change their position. Using camera lights direct into their eyes is threat prone to animals.<\/li>\n<li>Circling around the animal in a group is dangerous.<\/li>\n<li>Children should be taken care of and not allowed to come close to animals. The size of children can be misunderstood by the animals as their prey.<\/li>\n<\/ul>\n<h5><strong>Things to Carry<\/strong><\/h5>\n<ul>\n<li>Permits of hotel and resort booking.<\/li>\n<li>Id proof<\/li>\n<li>Mosquito Repellent<\/li>\n<li>Jacket<\/li>\n<li>Rope<\/li>\n<li>Torch and spare batteries<\/li>\n<li>Sun cream<\/li>\n<li>Gloves<\/li>\n<li>Extra pair socks<\/li>\n<li>Pocket Knife<\/li>\n<li>Quick eatables, snacks and water<\/li>\n<li>Binoculars<\/li>\n<li>Hat or cap<\/li>\n<li>Full Sleeve Shirts<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Enjoy the thrill of visiting Jim Corbett National Park, one of the most famed wildlife sanctuaries of India. Jim Corbett National Park is famous even worldwide because of the many endangered species of animals it preserves therein. A Jungle Safari of the Park would be a real memorable experience for any visitor. Read on to learn more about Jim Corbett [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":8481,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28],"tags":[],"class_list":["post-462","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uttarakhand"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Jim Corbett National Park Uttarakhand - Things to Do &amp; Sightseeing<\/title>\n<meta name=\"description\" content=\"Find full information about Corbett National Park travel guide with latest information of Corbett, best time to visit, do and don&#039;ts, visiting places etc.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Jim Corbett National Park Uttarakhand - Things to Do &amp; Sightseeing\" \/>\n<meta property=\"og:description\" content=\"Find full information about Corbett National Park travel guide with latest information of Corbett, best time to visit, do and don&#039;ts, visiting places etc.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2014-07-14T07:56:23+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-10T06:25:05+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"300\" \/>\n\t<meta property=\"og:image:height\" content=\"200\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Jim Corbett National Park, The Safari Adventure\",\"datePublished\":\"2014-07-14T07:56:23+00:00\",\"dateModified\":\"2023-08-10T06:25:05+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/\"},\"wordCount\":2082,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg\",\"articleSection\":[\"Uttarakhand\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/\",\"name\":\"Jim Corbett National Park Uttarakhand - Things to Do & Sightseeing\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg\",\"datePublished\":\"2014-07-14T07:56:23+00:00\",\"dateModified\":\"2023-08-10T06:25:05+00:00\",\"description\":\"Find full information about Corbett National Park travel guide with latest information of Corbett, best time to visit, do and don'ts, visiting places etc.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg\",\"width\":300,\"height\":200,\"caption\":\"Jim Corbett National Park\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Jim Corbett National Park, The Safari Adventure\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Jim Corbett National Park Uttarakhand - Things to Do & Sightseeing","description":"Find full information about Corbett National Park travel guide with latest information of Corbett, best time to visit, do and don'ts, visiting places etc.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/","og_locale":"en_US","og_type":"article","og_title":"Jim Corbett National Park Uttarakhand - Things to Do & Sightseeing","og_description":"Find full information about Corbett National Park travel guide with latest information of Corbett, best time to visit, do and don'ts, visiting places etc.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2014-07-14T07:56:23+00:00","article_modified_time":"2023-08-10T06:25:05+00:00","og_image":[{"width":300,"height":200,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Jim Corbett National Park, The Safari Adventure","datePublished":"2014-07-14T07:56:23+00:00","dateModified":"2023-08-10T06:25:05+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/"},"wordCount":2082,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg","articleSection":["Uttarakhand"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/","name":"Jim Corbett National Park Uttarakhand - Things to Do & Sightseeing","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg","datePublished":"2014-07-14T07:56:23+00:00","dateModified":"2023-08-10T06:25:05+00:00","description":"Find full information about Corbett National Park travel guide with latest information of Corbett, best time to visit, do and don'ts, visiting places etc.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/07\/Jim-Corbett-National-Park.jpg","width":300,"height":200,"caption":"Jim Corbett National Park"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/jim-corbett-national-park\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Jim Corbett National Park, The Safari Adventure"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/462","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=462"}],"version-history":[{"count":5,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/462\/revisions"}],"predecessor-version":[{"id":8482,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/462\/revisions\/8482"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/8481"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=462"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=462"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=462"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}