{"id":492,"date":"2014-07-19T07:19:06","date_gmt":"2014-07-19T07:19:06","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=492"},"modified":"2023-08-10T06:30:33","modified_gmt":"2023-08-10T06:30:33","slug":"north-east-india-visiting-places","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/","title":{"rendered":"Visiting Places in North East India"},"content":{"rendered":"<p>North East India clad in dense forest covers, hills and mounts kissed by the low lying clouds has a mystic beauty of its own. The springs and fountains, fauna and flora, the tribal culture, the earthiness that you get to see and feel in the North East, is indeed unique and memorable. Read on to learn more about North East India.<\/p>\n<p>Northeast India consists of Seven Sister States, that is, Arunachal Pradesh, Assam, Manipur, Meghalaya, Mizoram, Nagaland, Tripura and the Himalayan state of Sikkim which is the easternmost region of India. The countries like Nepal and Bangladesh are connected with India through a narrow corridor of east India. It also comprises with various international borders like China in the north, Bhutan in the North West and Myanmar in the east. The total population of this area is 38,857,769. The total area of this north east India is 262,230 sq.km. In North East India, there are various local languages like Assamese, Bengali, Garo, Khasi, Kokborok, Bodo, Mizo, Manipuri, Sikkimese, Nepali etc. The basic religions in this area are Hinduism, Buddhism, Christianity, Islam and Sanamahism.<\/p>\n<p>This North East region geographically consists with Eastern Himalayas, North East Hills like Patkai Naga Hills and Lushai Hills and the river Brahmaputra and the Barak valley plains. Besides all these, the biodiversity of this area should be highlighted because there are 51 forest types are found which classified into six major types like tropical semi-evergreen forests, tropical moist deciduous forests, tropical wet evergreen forests, subtropical forests, temperate forests and alpine forests which are highly attractive for any visitor or traveller. For an adventurist, the hills, the forests and the living creatures are undoubtedly the most attractive things because there are 1500 endangered floral species. The Indo Burma Hotspot in North East India is the world’s second largest just after the Mediterranean basin.<\/p>\n<h2><strong>The Reserve Forests for the Jungle lovers<\/strong><\/h2>\n<p>In North East India, there are multiple numbers of reserve parks like Namdapha National Park, Kaziranga National Park, Manas National Park, Pobitora Wildlife Sanctuary, Orang National Park, Sipahijola Wildlife Sanctuary, and Keibul Lamjao National Park etc.<\/p>\n<h3><strong>Namdapha National Park<\/strong><\/h3>\n<p>Namdapha National Park is the largest national park of North East India. It is situated in Arunachal Pradesh and it spreads over an area of 1985 square kilometres. In the ecosystem of this park, there are more than 150 species of timber. Besides this, there are some rare fauna species like Abies Delavayi, Blue Vanda, Pinus Merkusi and Mishimi Teeta. Tiger, Clouded Leopard, Snow Leopard are reserved here in Changlang district of Arunachal Pradesh. Besides these, Assamese macaque, stump-tailed macaque, Hoolock gibbon are the important primates. Mammals like elephant, Indian Bison, deer and Asian black bear and the birds like white-winged wood duck, great Indian hornbill, pheasant, Jungle fowl etc. are also in the centre of attraction for the tourists.<\/p>\n<h3><strong>Kaziranga National Park<\/strong><\/h3>\n<p>Kaziranga National Park is situated in the bank of the river Brahmaputra, Assam. It considers as the home to the world’s largest population of Great Indian one-horned rhinoceros. Besides the rhinoceros, it is the living place of leopard, swamp deer, barking deer, hog deer, wild boar, wild water buffalo, golden langur, capped langur, otter, grey-headed fish eagle, pygmy hog, crested serpent eagle, swamp partridge, Bengal florican, pelican, black-necked stork, egret heron, rock python, monitor lizards and many more.<\/p>\n<h3><strong>Manas National Park<\/strong><\/h3>\n<p>Manas National Park is declared as a world heritage by UNESCO. Here the Assam Government is basically concentrated on the reservation of the elephants. Pobitora Wildlife Sanctuary, in Morigaon, Assam is commonly famous for Great Indian one-horned rhinoceros. Orang National Park is also known as Mini Kaziranga. Besides one-horned rhinoceros, there are Asiatic elephant, Royal Bengal Tiger, civet, hare and porcupines etc. Sepahijala National Park is woodland with an artificial lake and is boasted with the unique bespectacled monkey. It is situated in Tripura. Keibul Lamjao National Park in Imphal, Manipur has Loktak Lake, the largest freshwater lake in India.<\/p>\n<p>North-East India comprises of a number lakes and water bodies which have become tourist attractions. The lakes of Assam are Deepor Beel, Chandubi Lake, Son Beel are quite famous. The other lakes are Chapanala Lake, Bordoibam Beel and Bordoibam. Deepor Beel is in Kamrup district of Assam. It is a freshwater lake and is one of the largest beels in Assam. The lake surroundings have ample amount of flora and fauna. The water plants and animals also contribute to become a part of the habitat if the area. Around the Chandubi Lake are deep forest and tea gardens. Migratory birds flock the lake during winter. The best time to visit the lake is during November to May. Son Beel is situated in the Karimganj district of Assam. It is one of the largest wetland of Assam. During the winter season crops like rice are cultivated in the area and from March the field becomes covered with water to turn into a lake. The lake is famous for fishing.<\/p>\n<p>Umiam Lake is the famous lake in Shillong in Meghalaya. Sports and adventure activities like boating, scooting, water cycling and kayaking are famous in this lake. Loktak Lake is the largest freshwater lake in India. There are several floating islands on this lake. In Mizoram, Palak Dil and Tam Dil are considered as the most beautiful lakes. Sikkim has lakes that are famous tourist spots. Gurudongmar Lake is one of the highest lakes of the world. It is situated in northern part of Sikkim. The Khecheopalri Lake is considered as a sacred lake. On the way to the monastery, there is a monastery and the place is the cult of Buddhism. Lake Tsomgo and Cholamu Lake are the other important lakes of Sikkim.<\/p>\n<h2><strong>States to Visit for<\/strong><\/h2>\n<h3><strong>Assam<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-8233\" src=\"\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg\" alt=\"Kamakhya Devi Temple, Assam\" width=\"750\" height=\"450\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg 750w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam-300x180.jpg 300w\" sizes=\"auto, (max-width: 750px) 100vw, 750px\" \/><\/p>\n<p>Assam is the central state of North East India. The main urban and biggest city in North India is Guwahati located in Assam. The important tourist spots of Guwahati are Kamakhya Temple, Sankardev Kalakhetra, Assam state zoo, Umananda Temple etc. Besides these, in the outskirts of the city, Sonapur, Madan Kamdev, Chandubi Lake is also famous. Majuli is the largest freshwater island on the river Brahmaputra. This place is actually famous for its Vaishnavite Satras. Jatinga is a place which is famous for mysterious suicide spot of the birds. Dibrugarh is regarded as the tea capital of the world. Tinsukia, Haflong, Hajo, Sivasagar, Jorhat, Sonitpur etc. are also very attractive place to visit.<\/p>\n<h3><strong>Meghalaya<\/strong><\/h3>\n<p>Meghalaya is the most pleasant tourist spot of North East India. Shillong is the center of the state where a lot of interesting places are situated. Elephant Falls, Wards Lake, Lady Hydari Park, Motphran, Shillong Peak, Captain Williamson Sangma State Museum, Don Bosco Centre for Indigenous Cultures, Entomological Museum, Air Force Museum, Chrysalis gallery, Spread Eagle Falls, Sweet Falls are the main attraction. Shillong Golf Course is the largest Golf course in Asia is located here. Besides the shilling, Cherrapunji is the most famous place to visit. Cherrapunji is best known for the maximum raining city in the world. Mawsynram is also awesome for its landscape. Mawlynnong is the cleanest village of Asia where a multiple tree root bridges are located. Mawsmai Cave is the one of the most attractive place to visit. Seven Sisters falls and the border of Bangladesh in Cherrapunji is another splendid beauty of North East India.<\/p>\n<h3><strong>Aizawl<\/strong><\/h3>\n<p>Aizawl is the capital of Mizoram. Mizoram state museum, Champhai, Rih dil, Murlen National Park, Thenzawl, Lunglei etc are the places to visit in Mizoram. The Hill Stations like Hmuifang Tlang and Reiek Tlang represent the scenic beauty of Mizoram while Vantawng Falls is another beauty of the state. Palak Dil and Tam Dil are the lakes which add an extra beauty to the city.<\/p>\n<h3><strong>Manipur<\/strong><\/h3>\n<p>Manipur is very rich for its cultural activities like martial arts, dance, theatre and sculptor. The floating islands at Loktak Lake, Sangai etc. are the rare thing found in Manipur. Kaina is hill station of Manipur which is regarded as a sacred place for the people of Hindu religion. Keibul Lamjao National Park is the home of Manipur’s eco-tourism. The famous picnic spot Sadu Chiru which is also known as Leiram waterfall is situated here.<\/p>\n<h3><strong>Arunachal Pradesh<\/strong><\/h3>\n<p>Arunachal Pradesh is myth logically an important state. It is regarded that Lord Krishna’s wife Rukmini lived here and in the Purana Lake, Parshuram washed his sins. Besides these facts, Tawang is a town consists of multiple number of Buddhist Monastery. Tezpur, Bomdila, Namdapha, Itanagar etc. are the places to visit. In the state capital, the Jawaharlal Nehru Museum has become the important spot for tourists.<\/p>\n<h3><strong>Nagaland<\/strong><\/h3>\n<p>In Nagaland, Dimapur and Kohima are the most important cities. The World war cemetery, State Museum, Ruins of the Medieval Kachari Kingdom, Rangapahar Reserve Forest etc. are the main attraction of the cities. Besides these, Longleng is a paradise for adventurers. Mokokchung, Mon, Peren, Phek, Tuensang, Kiphire etc. are also the cities to visit. In Tripura, the cities like Agartala, Deotamura, Kumarghat etc. consist of a various number of tourist spots. The rock cut images, pineapple cultivation fields, Unakoti Tirtha, Dumboor Lake, Jampui hill; Pilak etc. are the most famous place.<\/p>\n<h3><strong>Sikkim<\/strong><\/h3>\n<p>Sikkim is one of the best tourist spot not only in North East India but also in India. Nathu La pass which is the corridor between China and India is the most important and attractive tourist spot. Rumtek Monastery, Pemayangtse Monastery and the Phodong Monastery are the most sacred place for the Buddhist. Gurudongmar Lake and Khecheopalri Lake create the most beautiful scenic beauty of Sikkim. Yumthang valley is a mesmerizing beauty of the hills. Zemu Glacier is one of the most prolific attractions of the Sikkim. Hanuman Tok is another pious place for the people of Hindu religion. Namgyal Institute of Tibetology is a place where the students earn the knowledge of Buddhism and Buddhist mythologies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>North East India clad in dense forest covers, hills and mounts kissed by the low lying clouds has a mystic beauty of its own. The springs and fountains, fauna and flora, the tribal culture, the earthiness that you get to see and feel in the North East, is indeed unique and memorable. Read on to learn more about North East [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":8233,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[89],"tags":[],"class_list":["post-492","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-india"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>North East India Tourist Attractions - Things to Do<\/title>\n<meta name=\"description\" content=\"Get the tourism information about North East India - explore north east top tourist destinations, wildlife, mountains, lakes, travel tip, fauna-flora and more.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"North East India Tourist Attractions - Things to Do\" \/>\n<meta property=\"og:description\" content=\"Get the tourism information about North East India - explore north east top tourist destinations, wildlife, mountains, lakes, travel tip, fauna-flora and more.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2014-07-19T07:19:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-10T06:30:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"450\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Visiting Places in North East India\",\"datePublished\":\"2014-07-19T07:19:06+00:00\",\"dateModified\":\"2023-08-10T06:30:33+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/\"},\"wordCount\":1642,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg\",\"articleSection\":[\"India\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/\",\"name\":\"North East India Tourist Attractions - Things to Do\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg\",\"datePublished\":\"2014-07-19T07:19:06+00:00\",\"dateModified\":\"2023-08-10T06:30:33+00:00\",\"description\":\"Get the tourism information about North East India - explore north east top tourist destinations, wildlife, mountains, lakes, travel tip, fauna-flora and more.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg\",\"width\":750,\"height\":450,\"caption\":\"Kamakhya Devi Temple, Assam\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Visiting Places in North East India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"North East India Tourist Attractions - Things to Do","description":"Get the tourism information about North East India - explore north east top tourist destinations, wildlife, mountains, lakes, travel tip, fauna-flora and more.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/","og_locale":"en_US","og_type":"article","og_title":"North East India Tourist Attractions - Things to Do","og_description":"Get the tourism information about North East India - explore north east top tourist destinations, wildlife, mountains, lakes, travel tip, fauna-flora and more.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2014-07-19T07:19:06+00:00","article_modified_time":"2023-08-10T06:30:33+00:00","og_image":[{"width":750,"height":450,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Visiting Places in North East India","datePublished":"2014-07-19T07:19:06+00:00","dateModified":"2023-08-10T06:30:33+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/"},"wordCount":1642,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg","articleSection":["India"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/","name":"North East India Tourist Attractions - Things to Do","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg","datePublished":"2014-07-19T07:19:06+00:00","dateModified":"2023-08-10T06:30:33+00:00","description":"Get the tourism information about North East India - explore north east top tourist destinations, wildlife, mountains, lakes, travel tip, fauna-flora and more.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2018\/07\/Kamakhya-Devi-Temple-Assam.jpg","width":750,"height":450,"caption":"Kamakhya Devi Temple, Assam"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/north-east-india-visiting-places\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Visiting Places in North East India"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/492","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=492"}],"version-history":[{"count":7,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/492\/revisions"}],"predecessor-version":[{"id":8483,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/492\/revisions\/8483"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/8233"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=492"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=492"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=492"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}