{"id":604,"date":"2014-08-09T09:38:20","date_gmt":"2014-08-09T09:38:20","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=604"},"modified":"2022-02-26T10:50:53","modified_gmt":"2022-02-26T10:50:53","slug":"ladakh-tourist-places","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/","title":{"rendered":"Places of Tourist Interest in Ladakh"},"content":{"rendered":"<p>It has been called ‘the moonland’, or ‘the last Shangri La’. Those romantic definitions all hold more than a slight degree of truth. Ladakh is the most remote region of India, a barren, virtually rainless area which lies north of the Himalayan, an area known geographically as the Tibetan plateau. The Himalayas serve as a barrier to clouds carrying rain form the Sahara. The result is the ‘moonland’ label – much of Ladakh looks much like the moon, a barren, grey-brown landscape from faraway glaciers or melting snow, carry water to habitation do you find plant life. Ladakh is a part of strategically important Jammu and Kashmir; there are so many places to visit for so many reasons.<\/p>\n<p>Here are some visiting places in Ladakh listed below:<\/p>\n<p><strong>Drass<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-607\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Drass.jpg\" alt=\"Drass, Ladakh\" width=\"700\" height=\"600\" \/><br \/>\nThis is a small village with a TCP and a large military camp on the Drass River, en route to Kargil. The public works Department Rest House has a tourist officer and stands on the right hand side of the road from Srinagar. It can’t be missed as it is directly opposite the Rahi Tea Stall where there is ‘Hot Tea Available Anytime’. Drass is famed for its freezing temperatures and heavy winter snowfalls. In this area the dialect spoken is named after the weather &#8211; Hambabs means snowfall. For trekking from Drass to Sanku (Suru Valley).<\/p>\n<p>From Drass to Kargil the road follows the river. At a left-hand curve outside of Drass four 7th century Buddhist bas-reliefs stand next to the road: Maitreya, Avalokitesvera, an equestrian figure and a lotus. Beyond Tashgam the valley narrows and the mountain side on both sides of the river are covered with rocks and pebbles. Shortly before the road from the Drass Valley turns off into the Suru Valley a reasonable bridge, passable by jeeps, crosses the Drass River towards the left. This bridge is barred to foreigners as it leads into a restricted military area.<\/p>\n<p>From Drass the road runs to Kharbu (10 km), to Channigund (14 km) an then Kargil (10 km). The villages along the route are all hundreds of meters above the road, on small plateau. Beyond Tashgam the Landscape becomes more rocky, the mountains on both sides of the ricer reaching 5000 to 5500 meters.<\/p>\n<p><strong>Kargil<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-608\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Kargil-e1407578859928.jpg\" alt=\"Kargil Town\" width=\"700\" height=\"301\" \/><br \/>\nKargil was once an important trading post due to its strategic location at strategic location at the intersection of trade routes from Russia to India and from China to the west. Over the last 30 years political changes have considerably reduced its importance. Today it is just a village at the junction of the Drass and Suru Rivers, 20 km from the Indus; a stopping point with hotels, camping facilities and a service station on the road to Leh. The buses to and from Leh stop for the night here. Civilian leave for Leh between 4.30 and 5 am.<\/p>\n<p>If you are contemplating trekking in Zanskar or Ladakh it is worth pointing out that until Padum travelers must live off their stored supplies for virtually the entire distance. Anything forgotten in Srinagar should, therefore, be bought here. Due to the strong religious beliefs of the local population great difficulties accompany the purchase of alcohol.<\/p>\n<p>The dialect spoken here is Purik and shows its relationship with the dialect spoken in Skardu, Pakistan. In contrast to the rest of Ladakh, the children here are taught in Arabic. A momentous occasion in Kargil is the archery contest in May. By the time of gets to Kargil the traveler will have been struck by the artificially irrigated fields. Since irrigation is so important in this region, the distribution of water requires great care. Every village is divided into groups, called Gowar, of from five to 10 families, to ensure an equitable arrangement. In Kargil itself the conspicuous absence of women in the streets is a consequence of Islamic religious practice. The people follow the Shi’ite Moslem sect, like the Iranians.<\/p>\n<p>Kargil is the second largest town in Ladakh and has a population of about 3000. It’s situated in a lovely valley with apricot trees growing in the intensively cultivated fileds. Willows and poplars grow beside the irrigation ditches which lead to the terraced files. They furnish building materials for the construction of houses in this nearly treeless land.<\/p>\n<p>Trespone and sankhoo are two ‘Imambaras” found in Kargil. These Turkish style buildings have Persian and Arabic speaking Moslem mystic’s kwon as Aghas in residence. Kargil also has a mosque, the Jami Masjid. Kargil’s Moslems are noted for their extreme orthodoxy.<\/p>\n<p><strong>Around Kargil<\/strong><br \/>\nMount Kala Pahar (4575 metres) near to Kargil was under Pakistani control until the 1971 India-Pakistan conflict. In that war the borders of India were pushed further to the west but one still cannot travel directly to the Indus Valley and along the Indus to Leh. One must still take the hard way over the Namika-La and Fatu-La passes and reach the Indus Valley by Khalsi. At present a road is being built around the Namika-La pass – ‘which touches the sky’. It runs through the forbidden zone, west of the present road. In this region are the interesting villages of Garkon, Dards, Dardchik and Dha Hanu, whose population (altogether about 700 people) is light skinned and speaks a language which sounds like Russian although it also contains elements of Persian and Sanskrit, the language of the Aryan invaders. The remote locality and the custom of marrying only amongst themselves have preserved their distinctive indent right up to the present day. The government of the village is the responsibility of a seven-man village council, chosen by all men in the village. In July these villages celebrate a harvest festival which lasts for several days. Garkon is 80 km from Kargil.<\/p>\n<p><strong>Shergol<\/strong><br \/>\nThe small village of Shergol is 33 km from Kargil. The village, on the right hand side of the Wakkha River, is hard to see from the road as it lies behind a mountain. A small Gompa perches half-way up the eastern slope of this mountain. Appropriate to its size the Gompa has only two monks who are tended b a single nun. Some of the room, such as the kitchen, are hewn from the rock and resemble holes more than rooms. At the foot of the mountain, near the 35-houses village (210 inhabitants), there is a less important Gompa.<\/p>\n<p><strong>Mulbekh<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-6286\" src=\"\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery-1024x683.jpg\" alt=\"mulbekh-monastery\" width=\"840\" height=\"560\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery-1024x683.jpg 1024w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery-300x200.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery-768x512.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery-165x110.jpg 165w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery-370x247.jpg 370w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery-780x520.jpg 780w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg 1600w\" sizes=\"auto, (max-width: 840px) 100vw, 840px\" \/><br \/>\nA further seven from Shergol brings you to this Wakhan valley village. The palace of Rajah Chalon of Mulbekh is on the left hand side of the road. Above the village on the slopes is a double monastery. It’s a difficult ascent, particularly if you are not yet acclimatized to the altitude of Ladakh. Two paths lead to the Gompa and the right hand path (Monastery Mountain to the left) is the easier. Here, as with all Gompas  in Ladakh, one should make enquiries’ beforehand in the village as to whether the monks are present. Often the Gompas may be deserted for days at a time and therefore shut. Only in the mornings and evening can one be sure of encountering lamas who are not engaged in prayer. We were able to put two lamas of Mulbekh Gompa into action by showing them pictures of the Dalai Lama. These pictures of a holy and are haled accordingly – carefully touched, pressed on the forehead and reverentially returned. With amazing speed the lamas then ascended the mountain and opened the Gompas (the Serdung and Gandentse Gompas) for us.<\/p>\n<p>Choose the direct path up to the Gompas even though it seems steep for it gives a better view of the Wakkha Valley. A festive highpoint is the harvest thanksgiving festival (Shuba) which is celebrated at the same time in practically all larger Wakkha Valley villages. Mulbekh Subhla is a great attraction during the harvest time when the oracle of Mulbekh makes an appearance. In one is incarnated in a young farmer.<\/p>\n<p>One should always remove one’s shoes when visiting a Gompa. If you do not like going barefoot, the floors are often coated with rancid butterfat, take along socks or stockings for these visits. Obviously one should also have a reverent attitude;’ don’t make loud noises or touch holy figures. Remember that Mani walls or Chortens should always be walked around clockwise with the structure on your right.<\/p>\n<p><strong>Chamba Statue<\/strong><br \/>\nA km beyond Mulbekh, beside the road on the right hand side, is a huge figure of the Matriya, or future, Buddha, cut into the rock. The figure is thought to date from Kushan period, around the time of the birth of Christ. Inscriptions found on the side of the rock are in the Kharosthi script. A new small temple, which partly obscures the figure, was built in 1975.<\/p>\n<p><strong>Gel<\/strong><br \/>\nIf you wish to make more than a short pause at Mulbekh and to experience a little of the local way of life then visit the village of Gel. The small village, picturesquely situated on a steep slope above the Wakkha River, still lives, (like many Ladakh villages) in a bygone era. Although it is only a few km from the surfaced road Indian soldiers rarely come here and during a visit there time seems to stand still. When we visited Get not only did the children cry when they first saw us, but adults held the animals fast in their quarters, barricaded the doors and observed us suspiciously form the roofs of their houses. The ice was rapidly broken, however, when we wanted to buy an expensive Giri (hand-spindle with distaff). With the construction of the new jeep-road to the Namika-La, the modern world is now encroaching upon Ge.<\/p>\n<p><strong>Namika La &amp; Fatu La<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-610\" src=\"\/blog\/wp-content\/uploads\/2019\/04\/Namika-La.jpg\" alt=\"Namika La\" width=\"700\" height=\"534\" \/><br \/>\nFrom Mulbekh the road climbs through a sand hill landscape to the 3718 meter high Namika La. The first village beyond the pass is Kangral; a small collection of houses where it may be possible to obtain fuel Here also a dirt road branches to the left, leading to Stakchey, Samra, Chiktan (with old palace ruins), Sihakar, and Sanjar and along the Indus to eventually meet the Kargil-Khalsi road. The principal town in the valley of the Kanji Nallah is Bodh Kharbu, a large military camp which stretches put on both the right and left sides of the road. In the rest houses of the PWD, on the left had side of the road, the two traveler’s rooms can sometimes be used by tourists. There are many government projects underway during the beautiful summer moths so your chances of finding a room free are not good.<\/p>\n<p>The road follows the river for a short time and then winds its way to the 4094 meter high Fatu La pass, which is always cool and windy. This is the highest pass on the Srinagar-Leh road. About 15 km from the top of the pass the old Tibetan monastery of Lamayuru stands below the road on a crumbling mountain. There is a village on the mountain side.<\/p>\n<p><strong>Basgo<\/strong><br \/>\nAbove the road at this small town is the heavily devastated Basgo Fort. Basgo Gompa is worth a visit on account of its Buddha figures but, unfortunately, its wall painting have been badly water damaged. The first Gompa has a two-storey high golden Chamba statue in ‘European’ sitting posture. Smaller Chamba statues stand in front of the figure of the white clothed Chamonada. One of the three monks who live below the Gompa in a small house will have the Gompa key.<\/p>\n<p><strong>Nimmu<\/strong><br \/>\nOn the right had side of the road in the green fields there are four ‘Gate’ Chortens. Just 2.5 km beyond Nimmu the road leads to the place where the Zanskar River flows into the Indus through the Nimmu Gateway (Nimmu Gyasgo), a large cleft rock. From here it is only 35 km to Leh.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It has been called ‘the moonland’, or ‘the last Shangri La’. Those romantic definitions all hold more than a slight degree of truth. Ladakh is the most remote region of India, a barren, virtually rainless area which lies north of the Himalayan, an area known geographically as the Tibetan plateau. The Himalayas serve as a barrier to clouds carrying rain [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":6286,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41],"tags":[],"class_list":["post-604","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-ladakh"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Place to Visit in Ladakh - Ladakh Tourism<\/title>\n<meta name=\"description\" content=\"Get the information about Ladakh tourism - monasteries, gompa, trekking destinations, visiting place in ladakh such as Drass, Kargil, suru valley etc.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Place to Visit in Ladakh - Ladakh Tourism\" \/>\n<meta property=\"og:description\" content=\"Get the information about Ladakh tourism - monasteries, gompa, trekking destinations, visiting place in ladakh such as Drass, Kargil, suru valley etc.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2014-08-09T09:38:20+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-26T10:50:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"1067\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Places of Tourist Interest in Ladakh\",\"datePublished\":\"2014-08-09T09:38:20+00:00\",\"dateModified\":\"2022-02-26T10:50:53+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/\"},\"wordCount\":1950,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg\",\"articleSection\":[\"Ladakh\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/\",\"name\":\"Place to Visit in Ladakh - Ladakh Tourism\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg\",\"datePublished\":\"2014-08-09T09:38:20+00:00\",\"dateModified\":\"2022-02-26T10:50:53+00:00\",\"description\":\"Get the information about Ladakh tourism - monasteries, gompa, trekking destinations, visiting place in ladakh such as Drass, Kargil, suru valley etc.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg\",\"width\":1600,\"height\":1067,\"caption\":\"mulbekh-monastery\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Places of Tourist Interest in Ladakh\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Place to Visit in Ladakh - Ladakh Tourism","description":"Get the information about Ladakh tourism - monasteries, gompa, trekking destinations, visiting place in ladakh such as Drass, Kargil, suru valley etc.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/","og_locale":"en_US","og_type":"article","og_title":"Place to Visit in Ladakh - Ladakh Tourism","og_description":"Get the information about Ladakh tourism - monasteries, gompa, trekking destinations, visiting place in ladakh such as Drass, Kargil, suru valley etc.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2014-08-09T09:38:20+00:00","article_modified_time":"2022-02-26T10:50:53+00:00","og_image":[{"width":1600,"height":1067,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Places of Tourist Interest in Ladakh","datePublished":"2014-08-09T09:38:20+00:00","dateModified":"2022-02-26T10:50:53+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/"},"wordCount":1950,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg","articleSection":["Ladakh"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/","name":"Place to Visit in Ladakh - Ladakh Tourism","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg","datePublished":"2014-08-09T09:38:20+00:00","dateModified":"2022-02-26T10:50:53+00:00","description":"Get the information about Ladakh tourism - monasteries, gompa, trekking destinations, visiting place in ladakh such as Drass, Kargil, suru valley etc.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/08\/mulbekh-monastery.jpg","width":1600,"height":1067,"caption":"mulbekh-monastery"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/ladakh-tourist-places\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Places of Tourist Interest in Ladakh"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/604","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=604"}],"version-history":[{"count":5,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/604\/revisions"}],"predecessor-version":[{"id":7534,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/604\/revisions\/7534"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/6286"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=604"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=604"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=604"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}