{"id":670,"date":"2014-09-09T08:34:59","date_gmt":"2014-09-09T08:34:59","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=670"},"modified":"2022-02-26T11:19:33","modified_gmt":"2022-02-26T11:19:33","slug":"west-bengal-tourist-places","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/","title":{"rendered":"Tourist Attractions in West Bengal"},"content":{"rendered":"<p>Explore the land; its art, culture and history; and you will see for yourself why we call it beautiful Bengal for nothing. Leaf on through the post to realize why the diversity puts West Bengal among.<\/p>\n<p><strong>Reaching the City of Joy<\/strong><br \/>\nThere are four entry points to India- Gaya Bihar, Mumbai, Kolkata and Chennai, though most Western flights make a stop at either  Gaya Bihar or Mumbai. One might land there, and avail of a connecting domestic flight to Kolkata. With the new international terminal however, the city has revamped its international aviation infrastructure to receive flights from abroad too.<\/p>\n<p>You can plan your travel yourself as well as depute you travel agent to do the same. Hotels in Kolkata are many, as you will find out in the following few pages.<\/p>\n<h3><strong>Best Places to Visit<\/strong><\/h3>\n<p><strong>Kolkata<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-6258\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City-1024x538.jpg\" alt=\"Kolkata-City\" width=\"840\" height=\"441\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City-1024x538.jpg 1024w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City-300x158.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City-768x403.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City-170x89.jpg 170w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City-370x194.jpg 370w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City-780x410.jpg 780w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kolkata-City.jpg 1200w\" sizes=\"auto, (max-width: 840px) 100vw, 840px\" \/><br \/>\nAn electric mix of diverse tastes and preference, Kolkata is a truly cosmopolitan place. From the mansions of North Kolkata to high-rises of the South, and from the deep roots of western influence in the Central part of the City of Joy to the distinctly community-based East, the nature of diversity is spread way too deep into the veins of the city. Today, it’s quite amazing to look back some three centuries ago, where wild animals used to strut about in the three villages of Sutanuti, Govindapur and Kalikata, part of the realm of one Sabarna Roy Choudhury. What was one the temple of Chowringhee Nath, today is the busy heart of the City, Chowringhee? Myriad, isn’t it?<\/p>\n<p>As we take you through Kolkata, we reveal a treasure trove for those who have an eye for great architecture. Along with this, a touch of the religio9us movement of yore. In the form of weekend detours in Air-Conditioned buses tracing the trail of Sri Ramakrishna and Swami Vivekananda; this includes trips to Belur Math, Dakshineswar Kali Bari and Swamiji’s ancestral home, to name but a few. The other trip introduces tourists to the architectural wonders of erstwhile Kolkata-Jorasanko Rajbari, Thakurbari, Gokul Mitra’s house, Kumartuli and its artisanville, Sovabazar Rajbari, Marble Palace and quite a few others. Embarking on these two trips, you are sure to experience the old-world charms of erstwhile Kolkata.<\/p>\n<p><strong>Darjeeling<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-6260\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling-1024x683.jpg\" alt=\"Darjeeling\" width=\"840\" height=\"560\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling-1024x683.jpg 1024w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling-300x200.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling-768x512.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling-165x110.jpg 165w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling-370x247.jpg 370w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling-780x520.jpg 780w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Darjeeling.jpg 1600w\" sizes=\"auto, (max-width: 840px) 100vw, 840px\" \/><br \/>\nAs you open your window, you find a view of a lifetime – her snowcapped peak reddened with the early morning rays of the Sun. behold the Kanchenjunga in her glory, a regal sight by itself. All of a sudden, you find your room engulfed in clouds and an abrupt shower sets the mood for you honeymoon. Welcome to Darjeeling, India’s best hill station, just 663km away from Kolkata at an altitude of 2134 meters above sea level. 5km away from Darjeeling, overlooking Ghoom lies the Batasia Loop, that will make you relive the golden, slow-moving but rambling life of yesteryears, as you travel through Darjeeling on the Toy Train.<\/p>\n<p><strong>Kalimpong<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-6261\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong.jpg\" alt=\"Kalimpong\" width=\"759\" height=\"485\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong.jpg 759w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-300x192.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-170x110.jpg 170w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-370x236.jpg 370w\" sizes=\"auto, (max-width: 759px) 100vw, 759px\" \/><br \/>\nThough Kalimpong, the city of monasteries, carries a rich heritage with her, she is equally zealous to preserve the present as well as her past glories. Heritage schools in Kalimpong are still national benchmarks in the field of education. The 12km stretch road from Ghoom station is a travelers’ delight. For instant the meeting point of the Teesta and the Rnagit. You’d miss mout on quite a lot if you din’t stop by this spot, popularly kown as “Lovers spot”. Other spots include the Morgan House, the Golf Course, the Deolo View Point, Dr. Graham’s Home, Pedong-Thongsa-Tharpa-Choling Monastery, wild orchids and animals.<\/p>\n<p><strong>Sandakphu<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-6263\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu-1024x683.jpg\" alt=\"Sandakphu\" width=\"840\" height=\"560\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu-1024x683.jpg 1024w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu-300x200.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu-768x512.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu-165x110.jpg 165w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu-370x247.jpg 370w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu-780x520.jpg 780w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sandakphu.jpg 1075w\" sizes=\"auto, (max-width: 840px) 100vw, 840px\" \/><br \/>\nHigh above the rest, lies Sandakphu, the highest point of West Bengal, at 11,929 ft above sea level. The Sandakphu trekking region lies in the Singalila Park in Darjeeling, off the Bengal-Sikkim border. An average temperature of -20 degrees Celsius, Mount Everest, the Kanchenjunga and the snow-capped Makalu and Lhotse. Sandakphu is home to all these and over 600 species of wild Orchids.<\/p>\n<p><strong>Kurseong<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-6265\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Kurseong.jpg\" alt=\"Kurseong\" width=\"700\" height=\"362\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kurseong.jpg 700w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kurseong-300x155.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kurseong-170x88.jpg 170w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kurseong-370x191.jpg 370w\" sizes=\"auto, (max-width: 700px) 100vw, 700px\" \/><br \/>\nSpend a day or two at Kurseong en route Darjeeling. Dip into the serenity at 1458 meters above sea level. This city, originally called Kharsang, after the wild orchids, gained prominence as a tourist destination since the 1880’s. For instance, the Saint Paul’s Church and Dow Hills School. Other attractions include Giddapahar Durgamata Mandir, Jagadish Mandir, and the Gumpha of Gautam Buddha at Down Hill, Juma Masjid at Hat bazar, Deer Park and waterfalls.<\/p>\n<p><strong>Lava<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-6266\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-lava.jpg\" alt=\"Kalimpong-lava\" width=\"828\" height=\"466\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-lava.jpg 828w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-lava-300x169.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-lava-768x432.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-lava-170x96.jpg 170w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-lava-370x208.jpg 370w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Kalimpong-lava-780x439.jpg 780w\" sizes=\"auto, (max-width: 828px) 100vw, 828px\" \/><br \/>\nJust 21\/2 hours away from Kalimpong, lies Lava at 7016 feet above sea level. Lava happens to be one of the few places in West Bengal that experience snowfall. The main attractions of Lava are the Brids. It rests amid nature, for form the madding crowd of he city. Besides the monasteries and museums, Neora Valley National Park is another crowd puller here. Rare animals like Red Pandas, Clouded Leopards, Musk Deer, Black Bears, Golden Cats, and Himalayan Flying Squirrels roam about freely here.<\/p>\n<p><strong>Lolegaon<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-6269\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Lolegaon.jpg\" alt=\"Lolegaon\" width=\"960\" height=\"720\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Lolegaon.jpg 960w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Lolegaon-300x225.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Lolegaon-768x576.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Lolegaon-147x110.jpg 147w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Lolegaon-333x250.jpg 333w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Lolegaon-725x544.jpg 725w\" sizes=\"auto, (max-width: 960px) 100vw, 960px\" \/><br \/>\n12 km away from Lava, at 5500 feet above sea level, lies the calm and coldness of Lolegaon. Away from the bustle and din of the city, the clear and uncluttered view of the Kanchenjunga is a top draw.<\/p>\n<p><strong>Reaching the Hills:<\/strong><br \/>\nYou can reach Darjeeling through Siliguri. Board any of the numerous trains from either of Howrah or Sealdah to Siliguri or Jalpaiguri. Avail of the Toy Train service or take the roadway to Darjeeling. Should you want to board a flight, you can do so from the NSC Bose Airport to Bagdogra Airport, Siliguri and then follow the same route to Darjeeling.<\/p>\n<p>Hire a car from Siliguri or Darjeeling for a 3 to 4 house drive to Kalimpong. Sandakphu can be accessed from Manebhanjan to Tonglu and Kalipokhri, the distance being 31 km.<\/p>\n<p><strong>Dooars<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-6270\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/dooars-north-bengal-1024x575.jpg\" alt=\"dooars-north-bengal\" width=\"840\" height=\"472\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/dooars-north-bengal.jpg 1024w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/dooars-north-bengal-300x168.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/dooars-north-bengal-768x431.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/dooars-north-bengal-170x95.jpg 170w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/dooars-north-bengal-370x208.jpg 370w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/dooars-north-bengal-780x438.jpg 780w\" sizes=\"auto, (max-width: 840px) 100vw, 840px\" \/><br \/>\nDooars, the vast expanse of greenery at the foothills of the Northern Himalayas, borrows its name from “Dwar” in Sanskrit, the mother of most Indian language. Indeed, the gateway to the Himalayas has multiple shades of green in it – be it the dense forest or the cloud-capped tea estates, or even green plains. A few mountain rivers stream through the idyllic surroundings which are the habitat for bison, one-horned rhinos, leopards, elephants and many other animals. One can see all of these, at the same time having a clear view of the Himalayas standing tall in the background.<\/p>\n<p><strong>Reaching different shades of green<\/strong><br \/>\nYou can access Dooars through multiple districts on road. Long distance buses ply from Kolkata. Railways connect the Dooars to Siliguri and Kolkata via New Jalpaiguri and Alipurduar. The Bagdogra airport helps the Dooars to connect with the rest of the country, i.e. Kolkata,  Gaya Bihar and Guwahati.<\/p>\n<p><strong>Sunderbans<\/strong><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-large wp-image-6271\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans-1024x672.jpg\" alt=\"Sunderbans\" width=\"840\" height=\"551\" srcset=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg 1024w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans-300x197.jpg 300w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans-768x504.jpg 768w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans-168x110.jpg 168w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans-370x243.jpg 370w, https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans-780x512.jpg 780w\" sizes=\"auto, (max-width: 840px) 100vw, 840px\" \/><br \/>\nTruly a World Heritage site, this delta is the house to ancient mangroves that have successfully sustained many a species of wild animals. Among various attractions are the monitor lizards, migratory birds, sharks, crocodiles and of course the Royal Bengal Tiger, for which tourists from all corner of the world throng this place.<\/p>\n<p>One can reach the core area of the Sunderbans, i.e. Netidhopani over the river Bonbibi Bharani. On the way, one shall pass Sundarkhali, Bilkhali and Gajikhali and the river Netai. This area is surrounded by Sundari, Keora, Hental and Goran varieties of mangroves and is interspersed by Forest Department watch-towers. One can consider himself pretty fortunate if he were to watch a tiger from one of these towers.<\/p>\n<p><strong>Reaching out to the wild<\/strong><br \/>\nSunderbans can only be accessed from the waters. One can avail a launch from the nearest river-harbor, Canning. Alternatively, buses ply between Kolkata and Basanti, from where you can hire a boat to Sajnekhali or you can choose to arrive via Gosaba and Sonakhali, besides there are launches from Namkhana too. Should you choose to reach via Canning, you can board a train from Kolkata to Canning.<\/p>\n<p><strong>Santiniketan<\/strong><br \/>\nThe land of red soil, with tales of literary brilliance in the air, that’s Santiniketan for you. It’s where the river Kopai meanders slowly and lore revolves around the Khowai. In Bengali, it means “The Abode of Peace”. Indeed, that was the only thing on Maharshi Debendranath Tagore’s mind as he set up an Ashram that was made immortal by the Bard of Bengal, Rabindranath Tagore, when he established Viswa Bharati University, a preferred destination for students from across the world.<\/p>\n<p><strong>Bishnupur<\/strong><br \/>\nOriginally christened Mallabhum after the age-old Malla rulers of Bengal, it is the birthplace of an art truly exclusive to this region – the Terracotta. The district capital Bishnupur is strewn with terracotta (burnt earth) structures describing tales from the Vedas and the Gathas. Of course temples throughout the whole district bear testimony to the aesthetics of the artisans, and are highly held by connoisseurs around the world. At present, 22 of Bankura’s 32 well-established temples are being maintained by the Archaeological Survey of India.<\/p>\n<h3><strong>Reaching the land of Red Soil-<\/strong><\/h3>\n<p><strong>Santiniketan<\/strong><br \/>\nThe nearest railway station is Bolpur. You can approach it from Rampurhat too. The best possible way to approach Santiniketan is on rail from Kolkata to Bolpur, and then traveling the remaining 2 km ride on road. Should you want to make a road trip, Santiniketan is connected to Kolkata via NH2.<\/p>\n<p><strong>Bishnupur<\/strong><br \/>\nThe main railway station is Bankura Town. It’s also a 5 hour drive from Kolkata. You can avail of long-distance buses from Kolkata.<\/p>\n<p><strong>Murshidabad<\/strong><br \/>\nA treasure trove of history, Murshidabad is intrinsic to memories of the erstwhile Dewan of Bengal, Bihar and Orissa, Nawab Murshid Quli Khan. Lalbag, the then capital of Bengal, and the British established city at Berhampore portray two different views in history. Notable tourist spots include Hazarduari, Katra Mosque, tomb of Siraj-ud-Daula and large number of other palaces dating back to about 400 years, like the Madina Mosque, Jahan Kosha, Khosbag, Motijhil, Kiriteshwari temple, Kathgola Palace, Nizamat Imambara to name but a few. The Wasef Manzil, Jagat Seth’s house, Bacchawali Cannon, Nimakharam Deuri, Karna Suvarna and the fields of Plassey continue to enthrall tourists from all corners of the world. A 30-minute drive across the river can take you to the ruins of Karnasubarna, the ancient capital of Bengal.<\/p>\n<h3><strong>Other Places of Interest<\/strong><\/h3>\n<p><strong>Digha<\/strong><br \/>\nA bemused Warren Hastings referred Digha as ‘Brighton of the East’. Every year millions of people throng Digha, for its beautiful coastline, along with a spectacular sunrise and sunset view. Of late, it’s the most popular sea retreat of West Bengal.<\/p>\n<p><strong>Mandarmani<\/strong><br \/>\nThe 13 km long beach of Mandarmani is the home of serenity and solitude. Some reputed hoteliers have set up their resorts, yet leaving the magic of this place intact and have made it more of a weekend retreat for tourists from Kolkata and its adjoining area.<\/p>\n<p><strong>Coochbehar<\/strong><br \/>\nThe erstwhile princely state of Coochbehar came under the Indian jurisdiction in 1949 but its royal legend goes on, with imposing palaces (Rajbari), temples (Madan Mohan and Baneshwar Shiva Temple) and celebrated personalities like Rajmata Gayatri Devi of Jaipur, who hails from the Coochbehar royal family. In short, the city of Cooch Behar is ideal for the travelers who have an eye for history and Bengal’s eventful past.<\/p>\n<p><strong>Malda<\/strong><br \/>\nThe erstwhile seat of power of Bengal is famous for its delicious mangoes, hand-woven coten and silk textiles along with the relics of the Hindu, Muslim and Buddhist regimes.<\/p>\n<p><strong>Mayapur<\/strong><br \/>\nThe birthplace of Chaitanya is the most pious place for Bengali Vaishnavas. It is also the headquarters of the International Society for Krishna Consciousness (ISKON). The ISKON’S Chandrodaya Mandir is one of the most important pilgrim destinations for Vaishnavites all over the world.<\/p>\n<h4><strong>Art and Crafts<\/strong><\/h4>\n<p>Each of soil, sponge-wood (shoal), cotton, jute, silk, handmade paper, bell metal and cane is indigenous to Bengal. So are their usages in Bengali livelihood. Terracotta, pottery, shoal-work, Patachitra painting, bell-metalwork, cane-work, hand-woven textiles (Sari), embroidery on light quilts, to name but a few and most worthy of mention is the fact that each of these handicrafts has been given the status of exquisite folk –art by generations of specialist artisans. Today the finesse of Krishnanagar clay dolls, distinct form of terracotta horse of Bankura, Dokra artifacts of tribal craftsmen and patachitra of Kalighat in Kolkata have garnered recognition from the world over.<\/p>\n<p>In modern times, Abanindranath Tagore, Rabindranath Tagore, Nandalal Bose and many others established the Bengal School of Painting and other fine arts during the 19th and 20th centuries. As time passed by, the tradition of excellence in art was followed by the names like Atul Bose, Jamini Roy, Debi Prasad Raychaudhuri, Hemen Majumdar, Zainul Abedin, Nirad Majumdar, Abani Sen and Gobardhan Ash. In recent times Kolkata emerged as a prominent trading center with the stalwarts Ganesh Pyne, Jogen Chowdhury and Subhaprasanna, all joining with their own bit in the fray.<\/p>\n<h4><strong>Culture and Festivals<\/strong><\/h4>\n<p>It is said to be a land of 13 festivals in 12 months. And the biggest among these carnivals is Durga Puja. Scriptures say that it marks the goddess Durga’s homecoming on earth. The four days of Puja are celebrated in a manner that has few parallels in the world! Spectacular Pandals, illuminated streets and millions of people treading miles for Pandal hopping – are all specific to this festival that ends with immersion of the earthen Durga idol. It is one of the largest carnivals of the earth attracting millions of people to Kolkata and Bengal.<\/p>\n<p>Besides Durga Puja, Bengalis celebrate Dol (festivals of colors), Rash (mainly at Mayapur), Dipabali (festival of light), Nababarsha (Bengali new-year) and Christmas with high enthusiasm.<\/p>\n<p>The colorful cultural gamut of Bengal, includes various folk dance forms, Chhau is a masked folk dance form from Purulia district that has achieved more international acclaim over others like Natua, Raibenshey and Tusu.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Explore the land; its art, culture and history; and you will see for yourself why we call it beautiful Bengal for nothing. Leaf on through the post to realize why the diversity puts West Bengal among. Reaching the City of Joy There are four entry points to India- Gaya Bihar, Mumbai, Kolkata and Chennai, though most Western flights make a stop at [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":6271,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[37],"tags":[],"class_list":["post-670","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-west-bengal"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Places to Visit in West Bengal - Bengal Travel Guide<\/title>\n<meta name=\"description\" content=\"Visit and discover the famous tourist destination in West Bengal. Colourful people with their lifestyle, art, crafts, culture and festivals etc.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Places to Visit in West Bengal - Bengal Travel Guide\" \/>\n<meta property=\"og:description\" content=\"Visit and discover the famous tourist destination in West Bengal. Colourful people with their lifestyle, art, crafts, culture and festivals etc.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2014-09-09T08:34:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-26T11:19:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"672\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Tourist Attractions in West Bengal\",\"datePublished\":\"2014-09-09T08:34:59+00:00\",\"dateModified\":\"2022-02-26T11:19:33+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/\"},\"wordCount\":2261,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg\",\"articleSection\":[\"West Bengal\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/\",\"name\":\"Places to Visit in West Bengal - Bengal Travel Guide\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg\",\"datePublished\":\"2014-09-09T08:34:59+00:00\",\"dateModified\":\"2022-02-26T11:19:33+00:00\",\"description\":\"Visit and discover the famous tourist destination in West Bengal. Colourful people with their lifestyle, art, crafts, culture and festivals etc.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg\",\"width\":1024,\"height\":672,\"caption\":\"Sunderbans\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Tourist Attractions in West Bengal\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Places to Visit in West Bengal - Bengal Travel Guide","description":"Visit and discover the famous tourist destination in West Bengal. Colourful people with their lifestyle, art, crafts, culture and festivals etc.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/","og_locale":"en_US","og_type":"article","og_title":"Places to Visit in West Bengal - Bengal Travel Guide","og_description":"Visit and discover the famous tourist destination in West Bengal. Colourful people with their lifestyle, art, crafts, culture and festivals etc.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2014-09-09T08:34:59+00:00","article_modified_time":"2022-02-26T11:19:33+00:00","og_image":[{"width":1024,"height":672,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Tourist Attractions in West Bengal","datePublished":"2014-09-09T08:34:59+00:00","dateModified":"2022-02-26T11:19:33+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/"},"wordCount":2261,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg","articleSection":["West Bengal"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/","name":"Places to Visit in West Bengal - Bengal Travel Guide","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg","datePublished":"2014-09-09T08:34:59+00:00","dateModified":"2022-02-26T11:19:33+00:00","description":"Visit and discover the famous tourist destination in West Bengal. Colourful people with their lifestyle, art, crafts, culture and festivals etc.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Sunderbans.jpg","width":1024,"height":672,"caption":"Sunderbans"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/west-bengal-tourist-places\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Tourist Attractions in West Bengal"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/670","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=670"}],"version-history":[{"count":5,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/670\/revisions"}],"predecessor-version":[{"id":7580,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/670\/revisions\/7580"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/6271"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=670"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=670"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=670"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}