{"id":715,"date":"2014-09-18T12:06:09","date_gmt":"2014-09-18T12:06:09","guid":{"rendered":"https:\/\/www.namasteindiatrip.com\/blog\/?p=715"},"modified":"2023-08-10T06:58:01","modified_gmt":"2023-08-10T06:58:01","slug":"list-of-towns-in-kashmir","status":"publish","type":"post","link":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/","title":{"rendered":"Important Towns &#038; City of Kashmir"},"content":{"rendered":"<p>Srinagar is the capital city of the valley. Important towns on national highway and other locations are:<\/p>\n<h3><strong>Pampore: – Lat. 340.1’ Longitude 740.58’<\/strong><\/h3>\n<p>Pampore was founded in the first quarter of the 9th century by King Padma Dutt. Due to its central location in the valley the city grew in importance and is frequently mentioned in Rajatarangini.<\/p>\n<p>Presently the town en-route National Highway is situated on the right bank of river Jhelum, about 10 kms in the south-east direction from Srinagar. Pampore, a tehsil headquarter of Pulwama district, is a sub – urban area which is growing fast as an industrial centre. Government joinery mills, Bharat Petroleum Gas Terminal, Steel Authority of India and Silk Research Centre are the trading centers. Jamia Masjid and the shrine of Shah-i-Hamdan (RA) and Shoka Baba (RA) are most famous. The pampore karewa in its southern side is called the Sona Krund (Golden Basket) Wudar, and is devoted to saffron cultivation. Saffron a cash crop fetches a very good price in both local and international market. 10gms of high quality saffron coasts between Rs.2000-3000.<\/p>\n<p>Vigne has observed that the long ridges of limestone strata in the neighborhood of Pampore are very remarkable.<\/p>\n<p>Pampore is nowadays a trading centre with a good market. It is also famous for its brick kilns on the opposite side of river Jhelum. The limestone deposits in Khrew area of Pampore are famous as they provide the raw material to all the cement factories confined to this area.<\/p>\n<h3><strong>Awantipora: Lat. 33.055’ Long = 750.3’<\/strong><\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-8496 alignright\" src=\"\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg\" alt=\"Awantipora\" width=\"300\" height=\"200\" \/><\/p>\n<p>Awantipora town en-route Srinagar – Jammu National Highway, occupies the famous site of one ancient capitals of Kashmir. It lies on the right bank of river Jhelum at the foot of Wusturnan hills and is midway between Anantnag, Pulwama and Srinagar district. Tral, a tehsil headquarter, lies at a distance of 10 kms from Awantipora, towards its east. It is about thirty kilometers from Srinagar city.<\/p>\n<p>Awantipora, as the ancient capital was founded by the famous king Awanti Verma, who reigned from 854 A.D. to 888 A.D. The only traces that remain of its former greatness are the two temples. Both were dedicated to Mahadeva, under the title of Awanti-Swamy, and Awantiswara. These two temples are situated on the bank of the river one at Awantipora and other near the village Javbior. They are now shapeless masses of ruins, but the gateways of both are standing. They are commonly referred as “Pandow Larey” i.e. the houses of Pandavas. Awantipora was a flourishing city upto 12th century A.D., when it was destroyed and burnt down by Damars (Feudal Hindu Tribe).<\/p>\n<p>Nowadays, Awantipora a tehsil headquarter of Pulwama district is developing fastly as a trade centre. It is a growing knowledge centre, as Islamic University of Science and Technology has been established here.  It is the base for Army Airport; it is also famous for the shrine of Syed Mantaqi (RA), Jamia Masjid and the Gurudwara, all the three lie on the highway side.<\/p>\n<h3><strong>Bijbehara or Vij – Beara: Lat. 330.47’, Long. 750.9’<\/strong><\/h3>\n<p>Bijbhera or Vij &#8211; Beara is said to have been founded by King Vijaya (69-61B.C.). Bijbehara, a tehsil headquarter of Islamabad (Anantnag) district is connected to Srinagar, Islamabad, Pahalgam and Shopian by road. This ancient town of considerable importance is developed on both the sides of River Jhelum which are connected by two concrete bridges.<\/p>\n<p>Bijbhera is famous for its various gardens especially the “Padshahi Bagh”, which was laid by Dara Shikoh. The garden regained its past glory during the reign of Mufti Mohammad Syed, when enough funds were spent for its maintenance.  Bijbehara is developing as a trading centre for fresh fruit especially the apples. There are various shrines and the shrine of Baba Nasir-ud-Din ‘Gazi)’ (RA) is the largest and most famous. It is situated on the left bank of Vyeth, near the Jamia-Masjid. The temple  on the left side or river Jhelum and the newly constructed Gurudwara by Sikh Community both on National Highway are the pilgrimage sites.<\/p>\n<h3><strong>Islamabad (Anantnag) – Latitude 330.44’, longitude 750.12’<\/strong><\/h3>\n<p>Islamabad (Anantnag) after Srinagar is the largest town in the valley of Kashmir. It is district headquarter. Its ancient name was Anyech. It is called Islamabad by Muslims while Hindus refer it as Anant Nag. Islamabad is situated about one and half kilometers from the right bank of river Jhelum, near the confluence of the aripat. It lies under the western side of an elevated karewa, upon the edge of which is a conical hill overlooking the town. From its foot flows the fountain of Anant Nag. Another spring Malkh Nag is impregnated with sulphur. The famous shrine of Rishi Malu (RA) is in the centre of the town. Anantnag is famous for its gardens and springs. It is a market town and a trading centre. It is a home of traders, businessmen and artisans especially handicrafts.<\/p>\n<p>Anantnag is the knowledge hub of South Kashmir. Various professional and degree colleges and technical institutions are established here. The K.P. Road (Khanabal – Pahalgam Road) has developed as a new and modern market in the field of economy, education and health sector. The south campus of the University of Kashmir is located h ere. Two gardens i.e. Wazir Bagh and Sher Bagh are developing as recreation grounds. During Aurangzeb’s rules, Islam Khan (1664 – 65 A.D.) the Governor of Kashmir laid out a garden for the Mughal Emperor, who named the place after the governor as Islamabad.<\/p>\n<h3><strong>Qazigund<\/strong><\/h3>\n<p>Qazigund, an important town en-route Srinagar – Jammu National Highway is located at a distance of 30 Kms from Anantnag. It lies at the foot of Pir Panjal Mountains close to Banihal Pass. It is a stopover for passengers traveling from either Jammu or Srinagar. It is often referred as the Gateway of Kashmir. It has developed as a food market for passengers. The railways in Kashmir are operating from Qazigund to Baramulla on the flood plain area. A tourist cafeteria, tea stalls and Dabas providing eatables are always ready to serve the passengers.<\/p>\n<h3><strong>Kulgam – Latitude 330.45’ and Longitude 740.14’<\/strong><\/h3>\n<p>Kulgam, now a district headquarters carved out of Islamabad district, in 2006 A.D. is at a distance of 70 kms from Srinagar and 17 kms from Islamabad. It is picturesquely situated on the Southern side of table land overlooking the left bank of the Vishal, whose bed is spread out here and divided into several channels.<\/p>\n<p>Kulgam is famous for its streams. Two famous shrines i.e. Syed Hussain Simnani and Shah Hamdan are located here which attract a good number of devotees to offer prayers. One Degree college and an ITI centre are located here to cater the needs of students. It is an important business centre and is famous for apple production. A fruit Mandi has been established here for the benefit of fruit growers of the locality. A modern fruit Mandi caters to the needs of local merchandise especially the apple and walnuts.<\/p>\n<p>Nature has gifted the Kulgam area with favorable agro-climatic conditions, suited for agriculture in its lower belts and fruit culture in the upper belt. On account of fertile soil and rich productivity, it is considered as the “Rice B owl” of Kashmir. Livestock and sheep rearing is a subsidiary occupation of the area.<\/p>\n<h3><strong>Shopian – Latitude 330.44; and Longitude 740.53’<\/strong><\/h3>\n<p>The beautiful town of Shopian is on the south-western side of the valley in close proximity of Pir Panjal mountain range. It is situated on the right bank of famous Rambiara, a wide but a shallow stream. It lies at a distance of 51 kms from Srinagar and 20 kms from Pulwama. It is a picturesque town, with a very good economy. It is a famous production centre for famous Kashmiri apples, which fetch a very good price in both local and international markets. Shopian is known for its indigenous “Ambri” apple which is famous due to its flavor and taste.<\/p>\n<p>The Shopian market is famous for its quality products and goods. The Jamia Masjid of Shopian is famous for its architectural design which resembles the Jamia Masjid of Srinagar. Due to re-opening of Mughal road, Shopian again excels as a trading centre and a connecting ling between Kashmir and Jammu division of the J&amp;K State, as the route is all weather road.<\/p>\n<p>According to Drew, Shopian is the distortion of “Shah Payan” i.e. Royal story. Shopian has been an ancient town of Kashmir, since it is situated on the famous Mughal road.<\/p>\n<h3><strong>Pattan<\/strong><\/h3>\n<p>Pattan a famous town, enroute Srinagar – Muzaffarabad National Highway is about 27 miles from Srinagar city towards north-western side. It is located at the base of a table land. The ancient name of the town was Shankarapura. The ruins of two ancient temples are still standing here. Pattan is developing as a sub-urban area due to its location.<\/p>\n<h3><strong>Sopore:<\/strong><\/h3>\n<p>Sopore is the most rich and developed town of Kashmir valley in terms of its economy. Sopore, as a tehsil headquarter falls under the jurisdiction of Baramulla district which is about 25 kilometers from Sopore. Sopore is almost 55 kilometer from Srinagar towards north-western side. Sopore, as a progressive town, due to its apple production and trade and commerce surpasses the other areas of the valley except the capital city of Srinagar. The town is built upon both banks of river Jhelum a few kilometers below the spot where the river leaves the famous Wular Lake. Sopore was founded by Sura, a minister during the reign of Avanti Varma, and was called as Surapura. Sopore, has a very good connectivity of roads which lead to Srinagar, Baramulla, Bandipora, Kupwara, Gulmarg and Karnah etc. sopore, is developing fast as a modern trading and knowledge centre. Several professional institutions are established to provide technical education in both public and private sector. The market area is quite splendid and is doing a brisk business all-round the year.<\/p>\n<h3><strong>Baramulla:<\/strong><\/h3>\n<p>Baramulla is one of the three old districts (Anantnag, Srinagar &amp; Baramulla) of the valley of Kashmir. It is situated at the mouth of the famous gorge by which river Jhelum leaves the valley of Kashmir. It is at a distance of 90 kms from Srinagar on the Srinagar – Muzaffarabad National Highway (Jhelum Valley Road).<\/p>\n<p>Baramulla is often referred as Varmul. The town is inhabited by two religious communities i.e., Muslims and Sikhs respectively. The cantonment area lies to the west of the town. Before partition in 1947, Baramulla was the most important trading centre and an exit point for the Kashmiri trade and commerce.<\/p>\n<h3><strong>Bandipora:<\/strong><\/h3>\n<p>Bandipora a newly created district is situated at an average height of 1701 metres from sea level. It was carved out of Baramulla district during 2006 A.D.<\/p>\n<p>Bandipora since early times almost served as a port. It used to be one of the important places of the old Kingdom known as Khaihom. During Mughal period, there were two main ports as the source of communication between Srinagar and the Central Asian states for commercial purposes. These ports were Aloosa (Ghat) and Nasoo (Bandipora). The route to Central Asia traversed through Aloosa and once Mughal emperors conferred the area of Khaihom as “Jagir” to the family of Bandey’s in Srinagar since then the area has come to be known as Bandipora. Bandipora is also referred as the “Galaxy of Gilgit and Astor”. Bandipora is situated around the north shore of the Wular Lake, in front of the mountains. Wular Lake, the largest fresh water lake of Asia, is located here and is famous for fishing. The area is famous for Nadru, Singhara and Pachi (used for Kashmiri mat – wagu).<\/p>\n<h3><strong>Ganderbal:<\/strong><\/h3>\n<p>Ganderbal the famous town is flanked by district Baramulla in the west, Srinagar in the south, Bandipora in the north-west and Kargil in the east. It has a unique geographical location. The famous Nala Sind traverses through its centre, which is a store house for the finest form of sand, used for construction purposes. The Ganderbal power house, on the Srinagar Leh National Highway is one of the oldest power houses supplying electricity. The central university and the physical education college campus is the added attraction for Ganderbal.<\/p>\n<h3><strong>Pulwama:<\/strong><\/h3>\n<p>Lying at a distance of 37 kms from Srinagar city is one of the famous towns of South Kashmir. Its original name was Panwargam, &amp; district headquarters. It is famous as a production centre for milk and vegetables throughout the valley. The famous Mughal road leads through this town. The town is connected with Shopian, Anantnag, Srinagar and Budgam area. The army airport is very close to the town at Malangpora. The industrial site of Lassipora in the vicinity of Pulwama town in developing at a fast rate.<\/p>\n<h3><strong>Tral:<\/strong><\/h3>\n<p>Lying in the lap of lofty mountains from three sides, the beautiful Tral valley is at a distance of 40 kms from Srinagar city and ten kms from Awantipora. The town is famous for its shrine of Mir Syed Ali Hamdani, the famous saint who was instrumental in the propagation of Islam in the valley. The shrine is located in the heart of town. Tral is very famous as a production centre for Almonds and Honey. Beautiful tourist locations outside the town are Shikargah (3 kms from Tral) and Nagaberi (20 kms).<\/p>\n<h3><strong>Budgam:<\/strong><\/h3>\n<p>Budgam owes its name to its dense population, i.e. Bud = Big, Gam = Village. It is now a district headquarters, which was carved out of Srinagar district in 1980 A.D. The famous Chinese traveler, Hiuen Tsang, followed this route to reach Poonch. Old records refer to the area as “Pargana Deesu”. It is the home of one of the noble Shia family called Aga. The village Kanihama, of Budgam, the home of famous Kani Shawl was an important trade centre during Dogra rule.<\/p>\n<h3><strong>Charar-i-Sharief:<\/strong><\/h3>\n<p>It is one of the most famous towns of Kashmir valley, which lies at a distance of 29 kms from Srinagar city. It lies on the north-west side of the valley. The town is built on one of the many bare sandy ridges by which the Pir Panjal range subsides into the level of the valley; these ridges are usually more or less flattened at the top, but have steep and almost perpendicular sides, which are here and there furrowed with rain channels. The town is built somewhat in the form of letter. The place is very famous for its shrine of Sheikh Noor-ud-Din Rishi, popularly known as Alamdar-e-Kashmir. Sheikh is one of the tallest saints and the founder of the Rishi order in Kashmir.<\/p>\n<h3><strong>Uri:<\/strong><\/h3>\n<p>Uri, a border town, is at a distance of 101 kms from Srinagar and 46 kms from Baramulla and is situated on the banks of river Jhelum. It was an important station on the Jhelum valley road before partition. With the opening of the said road, the place is gaining importance as a check and entry point for the merchandise coming in from Azad Kashmir and going out from Indian Kashmir. The river Jhelum flows along its northern side, resulting tumultuously through a deep and rocky gorge.<\/p>\n<p>Uri is a tehsil headquarter of Baramulla district. The road from Uri leads to Poonch via Haji Pir Pass. Uri is strategically an important location, since it is very close to the LOC (line of control) between India and Pakistan. Pahari and Gojri are the common languages.<\/p>\n<p>Uri is famous for its Uri Hydro Electric Project, which as a capacity of 480 MW. The project is situated on the river Jhelum along Jhelum valley road. It is spread over a distance of 20 kms. The project was constructed by NHPC with Swedish collaboration. It utilizes a drop of 257 metres in a river length of 16 kms to generate 480 MW of power with a discharge of 8000 cusecs. Head race tunnel which is 10 kms long is the biggest component of the project. It leaves the river at Boniyar and reaches Lagama, the site of underground power house with a capital cost of Rs.240 crores (221 crores for main project, 16 crores for transmission system upto pooling point in the Northern Grid). Uri project is one of the biggest power projects construed in the Kashmir valley so far.<\/p>\n<h3><strong>Ashmuqam:<\/strong><\/h3>\n<p>Aishmuqam is a famous town is located at the foot of a hill enroute Islamabad – Pahalgam road. It is at a distance of 70 kms from Srinagar and 20 kms from Islamabad.<\/p>\n<p>The town is famous for its cave and shrine of famous saint Zain-ul-Abidin Wali, on the left side of Lidder River. To reach the shrine one has to climb a flight of steps. From the top of the shrine, one can watch a magnificent view of famous Lidder valley.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Srinagar is the capital city of the valley. Important towns on national highway and other locations are: Pampore: – Lat. 340.1’ Longitude 740.58’ Pampore was founded in the first quarter of the 9th century by King Padma Dutt. Due to its central location in the valley the city grew in importance and is frequently mentioned in Rajatarangini. Presently the town [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":8496,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[23],"tags":[],"class_list":["post-715","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-jammu-kashmir"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Major Town in the Kashmir - Kashmir Cities List<\/title>\n<meta name=\"description\" content=\"Get the information about Kashmir major cities and town such as Pulwama, Bandipora, Tral, Budgam, Ganderbal, Baramulla, Anantnag, Kulgam, Sopore etc.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Major Town in the Kashmir - Kashmir Cities List\" \/>\n<meta property=\"og:description\" content=\"Get the information about Kashmir major cities and town such as Pulwama, Bandipora, Tral, Budgam, Ganderbal, Baramulla, Anantnag, Kulgam, Sopore etc.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/\" \/>\n<meta property=\"og:site_name\" content=\"Namaste India Trip Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\" \/>\n<meta property=\"article:published_time\" content=\"2014-09-18T12:06:09+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-10T06:58:01+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"300\" \/>\n\t<meta property=\"og:image:height\" content=\"200\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"DevFarswan\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:site\" content=\"@NmasteIndiaTrip\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"DevFarswan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/\"},\"author\":{\"name\":\"DevFarswan\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\"},\"headline\":\"Important Towns &#038; City of Kashmir\",\"datePublished\":\"2014-09-18T12:06:09+00:00\",\"dateModified\":\"2023-08-10T06:58:01+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/\"},\"wordCount\":2731,\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg\",\"articleSection\":[\"Jammu &amp; Kashmir\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/\",\"name\":\"Major Town in the Kashmir - Kashmir Cities List\",\"isPartOf\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg\",\"datePublished\":\"2014-09-18T12:06:09+00:00\",\"dateModified\":\"2023-08-10T06:58:01+00:00\",\"description\":\"Get the information about Kashmir major cities and town such as Pulwama, Bandipora, Tral, Budgam, Ganderbal, Baramulla, Anantnag, Kulgam, Sopore etc.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg\",\"width\":300,\"height\":200,\"caption\":\"Awantipora\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.namasteindiatrip.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Important Towns &#038; City of Kashmir\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#website\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"name\":\"Namaste India Trip Blog\",\"description\":\"Explore India With Us\",\"publisher\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#organization\",\"name\":\"Namaste India Trip Blog\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"contentUrl\":\"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png\",\"width\":300,\"height\":86,\"caption\":\"Namaste India Trip Blog\"},\"image\":{\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/NamasteIndiaTrips\/\",\"https:\/\/x.com\/NmasteIndiaTrip\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046\",\"name\":\"DevFarswan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g\",\"caption\":\"DevFarswan\"},\"description\":\"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Major Town in the Kashmir - Kashmir Cities List","description":"Get the information about Kashmir major cities and town such as Pulwama, Bandipora, Tral, Budgam, Ganderbal, Baramulla, Anantnag, Kulgam, Sopore etc.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/","og_locale":"en_US","og_type":"article","og_title":"Major Town in the Kashmir - Kashmir Cities List","og_description":"Get the information about Kashmir major cities and town such as Pulwama, Bandipora, Tral, Budgam, Ganderbal, Baramulla, Anantnag, Kulgam, Sopore etc.","og_url":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/","og_site_name":"Namaste India Trip Blog","article_publisher":"https:\/\/www.facebook.com\/NamasteIndiaTrips\/","article_published_time":"2014-09-18T12:06:09+00:00","article_modified_time":"2023-08-10T06:58:01+00:00","og_image":[{"width":300,"height":200,"url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg","type":"image\/jpeg"}],"author":"DevFarswan","twitter_card":"summary_large_image","twitter_creator":"@NmasteIndiaTrip","twitter_site":"@NmasteIndiaTrip","twitter_misc":{"Written by":"DevFarswan","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#article","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/"},"author":{"name":"DevFarswan","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046"},"headline":"Important Towns &#038; City of Kashmir","datePublished":"2014-09-18T12:06:09+00:00","dateModified":"2023-08-10T06:58:01+00:00","mainEntityOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/"},"wordCount":2731,"publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg","articleSection":["Jammu &amp; Kashmir"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/","name":"Major Town in the Kashmir - Kashmir Cities List","isPartOf":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage"},"thumbnailUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg","datePublished":"2014-09-18T12:06:09+00:00","dateModified":"2023-08-10T06:58:01+00:00","description":"Get the information about Kashmir major cities and town such as Pulwama, Bandipora, Tral, Budgam, Ganderbal, Baramulla, Anantnag, Kulgam, Sopore etc.","breadcrumb":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#primaryimage","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2014\/09\/Awantipora.jpg","width":300,"height":200,"caption":"Awantipora"},{"@type":"BreadcrumbList","@id":"https:\/\/www.namasteindiatrip.com\/blog\/list-of-towns-in-kashmir\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.namasteindiatrip.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Important Towns &#038; City of Kashmir"}]},{"@type":"WebSite","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#website","url":"https:\/\/www.namasteindiatrip.com\/blog\/","name":"Namaste India Trip Blog","description":"Explore India With Us","publisher":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.namasteindiatrip.com\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#organization","name":"Namaste India Trip Blog","url":"https:\/\/www.namasteindiatrip.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","contentUrl":"https:\/\/www.namasteindiatrip.com\/blog\/wp-content\/uploads\/2019\/04\/cropped-namaste-india-trip-logo.png","width":300,"height":86,"caption":"Namaste India Trip Blog"},"image":{"@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/NamasteIndiaTrips\/","https:\/\/x.com\/NmasteIndiaTrip"]},{"@type":"Person","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/b282cf90caba5d42796c4166d5689046","name":"DevFarswan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.namasteindiatrip.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9e187644498e160df4f8f9a6952b22f9?s=96&d=mm&r=g","caption":"DevFarswan"},"description":"Param Dass, works with Namaste India Trip. An avid travel enthusiast by nature, he brings his characteristic zeal and sincerity to all projects he involves himself in. His videography and photography reflect his urge to help fellow travelers who embrace the pleasures and perils of journeys just for the sense of adventure and newness they bring to our otherwise monotonous lives."}]}},"_links":{"self":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/715","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/comments?post=715"}],"version-history":[{"count":9,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/715\/revisions"}],"predecessor-version":[{"id":8498,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/posts\/715\/revisions\/8498"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media\/8496"}],"wp:attachment":[{"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/media?parent=715"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/categories?post=715"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.namasteindiatrip.com\/blog\/wp-json\/wp\/v2\/tags?post=715"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}